{"Source_Name":"TechCrunch","Author":"Anthony Ha","Title":"Daily Crunch: Waymo raises $2.5B","Description":"Alphabet’s self-driving car company raises its first outside investment, Robinhood goes down and Pixel phones get new gesture controls. Here’s your Daily Crunch for March 3, 2020. 1. Waymo brings in $2.25B from outside investors, Alphabet This is the company’…","Published_Date":"2020-03-03","Content":"Alphabet’s self-driving car company raises its first outside investment, Robinhood goes down and Pixel phones get new gesture controls. Here’s your Daily Crunch for March 3, 2020.1. Waymo brings in $2.25B from outside investors, AlphabetThis is the compan… "}
{"Source_Name":"TechCrunch","Author":"Jon Evans","Title":"Burn the EARN IT Act","Description":"I want to talk about malignant incompetence on the part of our elected officials, and this isn’t even about the pandemic. Rather, it’s about the spectacularly misguided, counterproductive, expensive, and overbearing approach to end-to-end encryption by the US…","Published_Date":"2020-03-08","Content":"I want to talk about malignant incompetence on the part of our elected officials, and this isn’t even about the pandemic. Rather, it’s about the spectacularly misguided, counterproductive, expensive, and overbearing approach to end-to-end encryption by the US… "}
{"Source_Name":"TechCrunch","Author":"J.M. Donaldson","Title":"Extra Crunch members get design tool Canva Pro free for 90 days","Description":"Extra Crunch is excited to announce a new community perk from design and publishing platform Canva. Starting today, annual and two-year members of Extra Crunch can receive 90 days of their Pro plan for free. You must be new to Canva to claim this offer, and r…","Published_Date":"2020-03-02","Content":"Extra Crunch is excited to announce a new community perk from design and publishing platform Canva. Starting today, annual and two-year members of Extra Crunch can receive 90 days of their Pro plan for free. You must be new to Canva to claim this offer, and r… "}
{"Source_Name":"Yahoo.com","Author":null,"Title":"Air Canada cancels order for 11 Boeing 737 Max jets amid ongoing questions - Yahoo Canada Finance","Description":"Air Canada cancels order for 11 Boeing 737 Max jets amid ongoing questions Yahoo Canada Finance Boeing 737 Max cancellations pile up in bleak start to the year CNBC Air Canada relaxes rebooking fees, cancels order for 11 Boeing 737 Max aircraft Financial Post…","Published_Date":"2020-03-11","Content":"MONTREAL Air Canada is cancelling an order for 11 Boeing 737 Max aircraft amid ongoing production delays to the grounded jet, which continues to face questions around its safety.Canada's largest airline said Wednesday it will decrease the number of Max fami… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Bank of Canada rate cut will put already hot real estate market 'on steroids' - The Globe and Mail","Description":"Bank of Canada rate cut will put already hot real estate market 'on steroids' The Globe and Mail Bank of Canada lowers overnight rate target to 1 ¼ percent Bank of Canada Bank of Canada cuts key interest rate target to 1.25 per cent CTV News Now is the worst …","Published_Date":"2020-03-04","Content":"A home that is sold is photographed along Runnymede Rd. in Toronto on Wednesday, March 4, 2020. Tijana Martin\/The Globe and MailThe Bank of Canadas interest-rate cut threatens to overheat the countrys booming housing markets, making it easier for home buy… "}
{"Source_Name":"Hellomagazine.com","Author":"HELLO! Canada","Title":"Photos: Kate Middleton and Prince William in Ireland - HELLO! CANADA - HELLO! Canada","Description":"Photos: Kate Middleton and Prince William in Ireland - HELLO! CANADA HELLO! Canada Kate Middleton Stuns in Green for Ireland Trip w\/ Prince William Access Kate Middleton Glitters in Green at Guinness Storehouse in Dublin Alongside Prince William PEOPLE.com Wi…","Published_Date":"2020-03-03","Content":"Non"}
{"Source_Name":"CNN","Author":"Peter Valdes-Dapena, CNN Business","Title":"Ford is bringing its all-electric Transit cargo vans to the US","Description":"Ford is bringing an all-electric version of its best-selling cargo van to North America. The electric version of the Transit, which is currently available in gasoline- and diesel-powered versions, will be available in the United States and Canada in 2021.","Published_Date":"2020-03-03","Content":"(CNN Business)Ford is bringing an all-electric version of its best-selling cargo van to North America. The electric version of the Transit, which is currently available in gasoline- and diesel-powered versions, will be available in the United States and Canad… "}
{"Source_Name":"Globalnews.ca","Author":"Anne Drewa","Title":"Travel, vacation and timeshare scams top BBB’s 10 riskiest scams in Canada - Global News","Description":"Travel, vacation and timeshare scams top BBB’s 10 riskiest scams in Canada Global News What scams are people falling for? WBIR Calgary police and Better Business Bureau release 10 most prominent scams in Canada CTV News BBB releases list of Top 10 riskiest sc…","Published_Date":"2020-03-03","Content":"Travel, vacation and timeshare scams took the number one spot in the Better Business Bureau’s top 10 riskiest scams for 2019.The BBB says victims lost an average of $5,000 to scammers with several consumers reporting bogus businesses tricking them into payi… "}
{"Source_Name":"Ctvnews.ca","Author":"Laura Osman","Title":"Canada releases coronavirus guidelines on when to cancel major events - CTV News","Description":"Canada releases coronavirus guidelines on when to cancel major events CTV News Federal government to announce supports for people, businesses hit by COVID-19 on Wednesday CBC.ca Ottawa to release unprecedented report into foreign espionage in Canada Toronto S…","Published_Date":"2020-03-11","Content":"OTTAWA -- The Public Health Agency of Canada has posted guidelines aimed at helping event planners figure out whether to cancel mass gatherings of people as the federal government works to quell the potential spread of the novel coronavirus.The next best … "}
{"Source_Name":"Globalnews.ca","Author":"Melissa Gilligan","Title":"2 people killed in Trans-Canada Highway crash near Calgary - Global News","Description":"2 people killed in Trans-Canada Highway crash near Calgary Global News Trans-Canada crash kills two west of Calgary CTV News Two dead in single-vehicle crash west of Calgary Calgary Herald Two people dead after Highway 1 crash west of Calgary CBC.ca 24-year-o…","Published_Date":"2020-03-06","Content":"Two people were killed in a crash on the Trans-Canada Highway west of Calgary on Friday.Emergency crews were called to Highway 1 just west of Old Banff Coach Road at around 9:30 a.m. for a single-vehicle collision.A spokesperson for Calgary EMS said two m… "}
{"Source_Name":"Yahoo.com","Author":null,"Title":"U.S. Stock Futures Swing to Gains After BOJ Emergency Act - Yahoo Canada Finance","Description":"U.S. Stock Futures Swing to Gains After BOJ Emergency Act Yahoo Canada Finance BOJ reassurance on coronavirus bolsters speculation of global policy action Investing.com Tokyo stocks rebound after BOJ's stability pledge Nikkei Asian Review Stock Slide Halts on…","Published_Date":"2020-03-02","Content":"(Bloomberg) -- U.S. index futures indicated a positive start for the week, with contracts rebounding after the Bank of Japan issued an emergency statement to support market stability.. Shares in Europe climbed, oil jumped while the U.S. dollar traded lower.… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Canada introduces ban on LGBTQ2 conversion therapy - Global News","Description":"Canada introduces ban on LGBTQ2 conversion therapy Global News Federal Liberals introduce bill aimed at cracking down on conversion therapy CTV News Liberals introduce bill to 'eradicate' conversion therapy CBC.ca Conversion Therapy Ban Legislation Tabled By …","Published_Date":"2020-03-10","Content":""}
{"Source_Name":"Globalnews.ca","Author":"Staff","Title":"Coronavirus impact could include ‘longer-term layoffs,’ Bank of Canada governor says - Global News","Description":"Coronavirus impact could include ‘longer-term layoffs,’ Bank of Canada governor says Global News Bank of Canada believes this time rate cut will bolster housing market, not fuel froth Financial Post Interest rate cut for COVID-19 is like surgery with a club: …","Published_Date":"2020-03-05","Content":"Canada’s top central banker says concerns about the immediate impact of the novel coronavirus spurred the Bank of Canada to cut its trend-setting interest rate this week.Governor Stephen Poloz said Thursday in a luncheon speech that worries about the downsi… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Freezing rain could hit Ottawa and Valley Monday afternoon Environment Canada says - CTV News","Description":"Freezing rain could hit Ottawa and Valley Monday afternoon Environment Canada says CTV News View Full coverage on Google News","Published_Date":"2020-03-02","Content":"OTTAWA -- There could still be some freezing rain in parts of the National Capital Region late this afternoon but, by the evening, it should be mostly rain.Environment Canada has issued a special weather statement for Ottawa, warning that \"patchy freezing… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"North American stock markets rally to start the week higher; loonie climbs - CTV News","Description":"North American stock markets rally to start the week higher; loonie climbs CTV News At midday: TSX reverses early slide and jumps higher The Globe and Mail Toronto market down in early trading to start the week, loonie edges higher CP24 Toronto's Breaking New…","Published_Date":"2020-03-02","Content":"TORONTO -- Canada's main stock index rallied in late-morning trading as it posted a triple-digit gain to start the week following its worst losses since the financial crisis last week.The S&amp;P\/TSX composite index was up 131.20 points at 16,394.25.In … "}
{"Source_Name":"The Globe And Mail","Author":"Matt Sedensky, John Leicester","Title":"WHO urges governments to pull out 'all the stops' to slow spread of coronavirus - The Globe and Mail","Description":"WHO urges governments to pull out 'all the stops' to slow spread of coronavirus The Globe and Mail Canada confirms first 'community case' of COVID-19: Here's what that means CTV News Chinese province at centre of coronavirus outbreak reports no new cases outs…","Published_Date":"2020-03-05","Content":"Iraqi medical staff check a passenger's temperature upon arriving at Najaf airport, on March 5, 2020.ALAA AL-MARJANI\/ReutersOn Friday, health columnist Andre Picard will take reader questions during a live Facebook Q&amp;A. Email your coronavirus question… "}
{"Source_Name":"Ctvnews.ca","Author":"Ross Marowits","Title":"TSX crosses into bear market territory after COVID-19 declared a pandemic - CTV News","Description":"TSX crosses into bear market territory after COVID-19 declared a pandemic CTV News 3 TSX Stocks to AVOID During This Market Panic! The Motley Fool Canada Western Canada: Oil price crash sends Alberta’s economy back into crisis The Globe and Mail North America…","Published_Date":"2020-03-11","Content":"TORONTO -- Canada's main stock index crossed into bear market territory Wednesday in the wake of the World Health Organization declaring the COVID-19 outbreak a pandemic.The S&amp;P\/TSX composite index closed down 688 points or 4.6 per cent at 14,270.09.… "}
{"Source_Name":"Globalnews.ca","Author":"Laura Osman","Title":"Travellers from Iran face increased border screening in Canada as COVID-19 cases rise - Global News","Description":"Travellers from Iran face increased border screening in Canada as COVID-19 cases rise Global News Ontario confirms 4 new COVID-19 cases CBC News Ontario reports three new coronavirus cases, bringing province's total to 18 The Globe and Mail Coronavirus outbre…","Published_Date":"2020-03-02","Content":"The federal government has increased border-screening measures for travellers arriving in Canada from Iran in light of the growing number of novel coronavirus cases linked to that country.Several of Canada’s most recent 27 confirmed cases of the new coronav… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Freezing rain could hit Ottawa and Valley Monday afternoon Environment Canada says - CTV News","Description":"Freezing rain could hit Ottawa and Valley Monday afternoon Environment Canada says CTV News Freezing rain likely in Ottawa area on Monday, Environment Canada forecasts Global News Freezing rain forecasted for Montreal area CTV News Looks like a wet and mild w…","Published_Date":"2020-03-02","Content":"OTTAWA -- It could be a slippery drive home from work and school today.Environment Canada has issued a special weather statement for Ottawa, warning that freezing rain possible this afternoon.The agency says precipitation approaching from the southwest … "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Kevin Koe (CAN) - Thin triple FTW vs. McEwen (WC) - 2020 Tim Hortons Brier - Curling Canada","Description":"Kevin Koe (CAN) - Thin triple FTW vs. McEwen (WC) - 2020 Tim Hortons Brier Curling Canada BC rink drops fourth straight at Brier Quesnel Cariboo Observer N.L.’s Brad Gushue beats Nunavut’s Higgs at Tim Hortons Brier Sportsnet.ca Gunnlaugson hits outstanding s…","Published_Date":"2020-03-03","Content":"Non"}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Chrystia Freeland calls for ‘whole of country’ response to prevent spread of coronavirus - The Globe and Mail","Description":"Chrystia Freeland calls for ‘whole of country’ response to prevent spread of coronavirus The Globe and Mail Containment efforts will delay, not prevent, COVID-19 outbreak in Canada, Hajdu warns CBC.ca Global National: March 4, 2020 | How Canada is preparing f…","Published_Date":"2020-03-05","Content":"Deputy Prime Minister Chrystia Freeland and Health Minister Patty Hajdu, both seen here at the National Press Theatre in Ottawa on March 4, 2020, said at the news conference that all Canadians have a role to play. Justin Tang\/The Canadian PressDeputy Prim… "}
{"Source_Name":"Ctvnews.ca","Author":"Graham Slaughter","Title":"Canada confirms first 'community case' of COVID-19: Here's what that means - CTV News","Description":"Canada confirms first 'community case' of COVID-19: Here's what that means CTV News 8 more cases of COVID-19 virus identified in B.C., including 1 of unknown origin CBC.ca Coronavirus outbreak: Canadian WHO doctor returns from China with critical COVID-19 les…","Published_Date":"2020-03-06","Content":"TORONTO -- A woman in B.C. has tested positive for COVID-19 despite not having travelled recently and having no known contact with anyone infected with the virus.Until now, all cases in Canada involved individuals who had recently travelled to countries s… "}
{"Source_Name":"Castanet.net","Author":null,"Title":"Collapse in oil prices triggers a plunge in energy sector - Business News - Castanet.net","Description":"Collapse in oil prices triggers a plunge in energy sector - Business News Castanet.net TSX plunges as much as 10%, prompting trading halt Yahoo Canada Finance Biggest drop since '87 crash: US$218B lost in Canada stocks BNNBloomberg.ca Collapse in oil triggers…","Published_Date":"2020-03-09","Content":"UPDATE: 1:55 p.m.Canada's main stock index closed down 10.3 per cent to its lowest level in 14 months as a collapse in oil prices triggers a plunge in the energy sector.The S&amp;P\/TSX composite index lost 1,660.78 points to close at 14,514.24 and the cap… "}
{"Source_Name":"Ctvnews.ca","Author":"Ross Marowits","Title":"North American stock markets partially rebound on stimulus hope and higher crude - CTV News","Description":"North American stock markets partially rebound on stimulus hope and higher crude CTV News As the TSX tanked, this was the only stock that stayed in the green Yahoo Canada Finance Buffett Indicator: How Much Further Will the TSX Stock Market Crash? The Motley …","Published_Date":"2020-03-10","Content":"TORONTO -- Canada's main stock index partially rebounded from its worst one-day decline in more than 30 years on the promise of fiscal stimulus by the U.S. and other governments and a lift in oil prices.The S&amp;P\/TSX composite index gained as much as 54… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Everything you missed on the shocking season finale of 'The Bachelor' l GMA - Good Morning America","Description":"Everything you missed on the shocking season finale of 'The Bachelor' l GMA Good Morning America Where Peter Weber and Madison Prewett Stand After The Bachelor Finale E! Online 'Bachelor' finale turns into super dramatic 'Jerry Springer'-like episode Yahoo Ne…","Published_Date":"2020-03-11","Content":"Non"}
{"Source_Name":"Sootoday.com","Author":"Brad Coccimiglio","Title":"Team Jacobs rebounds for key wins at Brier - SooToday.com","Description":"Team Jacobs rebounds for key wins at Brier SooToday.com Kevin Koe (CAN) - Thin triple FTW vs. McEwen (WC) - 2020 Tim Hortons Brier Curling Canada Jacobs rink vows to 'fight, fight, fight' possibility of missing playoffs TSN Downtown Kingston, Ont. businesses …","Published_Date":"2020-03-04","Content":"In the blink of an eye, Team Northern Ontario, which consists of Sault Ste. Marie’s Brad Jacobs and his team from the Community First Curling Centre, is back in the mix at the 2020 Tim Hortons Brier in Kingston, Ont.After dropping to 1-3 on Monday night wit… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Canada to spend $1 billion combating COVID-19 spread, economic impacts - CTV News","Description":"Canada to spend $1 billion combating COVID-19 spread, economic impacts CTV News Federal government to announce supports for people, businesses hit by COVID-19 on Wednesday CBC.ca Canada releases coronavirus guidelines on when to cancel major events CTV News J…","Published_Date":"2020-03-11","Content":"OTTAWA -- The federal government is putting more than $1 billion into its plan to combat and mitigate the impacts of the outbreak of COVID-19 in Canada.Prime Minister Justin Trudeau and a handful of key cabinet ministers announced the \"comprehensive\" coro… "}
{"Source_Name":"Ctvnews.ca","Author":"Andrew Weichel","Title":"Vancouver university temporarily closed over 'possible student exposure' to COVID-19 - CTV News","Description":"Vancouver university temporarily closed over 'possible student exposure' to COVID-19 CTV News University Canada West closes Vancouver campus following presumptive case of COVID-19 Global News View Full coverage on Google News","Published_Date":"2020-03-05","Content":"VANCOUVER -- A small private university in downtown Vancouver is closing its campus for three days after learning two students may have been exposed to COVID-19.University Canada West announced Thursday the students have both been placed in isolation and … "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Ont. hospital to set up special COVID-19 clinic to ease busy emergency rooms - CTV News","Description":"As hospitals and health care facilities across Canada prepare to handle the spread of coronavirus seen around the world, some doctors are worried about a potential flood of patients hitting emergency rooms.","Published_Date":"2020-03-05","Content":"TORONTO -- As hospitals and health care facilities across Canada prepare to handle the spread of coronavirus seen around the world, some doctors are worried about a potential flood of patients hitting emergency rooms.Dr. Jeff Powis, the medical director o… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Goal is to contain and delay a COVID-19 outbreak, federal health officials say - CBC News","Description":"Goal is to contain and delay a COVID-19 outbreak, federal health officials say CBC News How Canada is encouraging self-isolation to prevent the spread of COVID-19 Global News View Full coverage on Google News","Published_Date":"2020-03-04","Content":"Deputy Prime Minister Chrystia Freeland, Health Minister Patty Hajdu, Chief Public Health Officer Theresa Tam and Deputy Chief Public Health Officer Howard Njoo give briefing on Canada's response to COVID-19.To read more: http:\/\/cbc.ca\/1.5484854»»» Subscr… "}
{"Source_Name":"Bnnbloomberg.ca","Author":"Bloomberg News","Title":"Rate cut will stabilize housing, not cause 'froth': Poloz - BNNBloomberg.ca","Description":"Bank of Canada Governor Stephen Poloz justified his decision to slash interest rates on Wednesday as a confidence-boosting measure that can help “bridge” the fallout from the coronavirus.","Published_Date":"2020-03-05","Content":"Bank of Canada Governor Stephen Poloz justified his decision to slash interest rates on Wednesday as a confidence-boosting measure that can help bridge the fallout from the coronavirus.The impact of the shock combined with domestic headwinds could lead to s… "}
{"Source_Name":"Globalnews.ca","Author":"Amanda Connolly","Title":"Canada and the West are at war with Russia whether they want it or not: military experts - Global News","Description":"Canada and the West are at war with Russia whether they want it or not: military experts Global News Russia greatest short-term threat to North America: Norad deputy commander CTV News View Full coverage on Google News","Published_Date":"2020-03-04","Content":"Russian aggression is the greatest challenge facing Canada and Western democracies right now as the Kremlin tries to dismantle the rules-based international order that’s existed since the end of the Second World War, military experts are warning.And as a re… "}
{"Source_Name":"Reuters","Author":"Tracy Rucinski","Title":"Father of 737 MAX crash victim stages protest on anniversary of Ethiopia crash","Description":"As families from many nations gathered for a memorial in Ethiopia to honor 157 victims of a Boeing 737 MAX plane crash a year ago, one father was thousands of miles away in Canada, protesting regulators who let the jet fly.","Published_Date":"2020-03-10","Content":"(Reuters) - As families from many nations gathered for a memorial in Ethiopia to honor 157 victims of a Boeing 737 MAX plane crash a year ago, one father was thousands of miles away in Canada, protesting regulators who let the jet fly. “There’s nothing for … "}
{"Source_Name":"TechCrunch","Author":"Romain Dillet","Title":"Blockchain (the company) lets you borrow USD PAX against collateral","Description":"What do you do when you’re rich in cryptocurrencies but you don’t want to sell your positions? The company named Blockchain thinks it has found a solution. It lets you borrow money against cryptocurrencies held in your Blockchain wallet. As soon as you lock c…","Published_Date":"2020-03-11","Content":"What do you do when youre rich in cryptocurrencies but you dont want to sell your positions? The company named Blockchain thinks it has found a solution. It lets you borrow money against cryptocurrencies held in your Blockchain wallet.As soon as you lock cr… "}
{"Source_Name":"Globalnews.ca","Author":"Heather Yourex-West","Title":"Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action - Global News","Description":"Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action Global News Trudeau urges patience as Wet'suwet'en consider proposed land and title deal CBC.ca Indigenous Canadians concerned about racist backlash over Wet'suwet'en rail …","Published_Date":"2020-03-04","Content":"Gabrielle Lindstrom says the last few weeks have made her sad.The Calgary professor is an Indigenous woman and has been speaking with her students a lot about racism in recent weeks.While she doesn’t believe the tensions surrounding the Wet’suwet’en solid… "}
{"Source_Name":"Hellomagazine.com","Author":"HELLO! Canada","Title":"Kate Middleton shimmers in The Vampire's Wife at the Guinness Storehouse's Gravity Bar - HELLO! Canada","Description":"Kate Middleton shimmers in The Vampire's Wife at the Guinness Storehouse's Gravity Bar HELLO! Canada Royal Inspiration! Kate Middleton Wears Metallic Dress Almost Identical to Princess Beatrice's Look PEOPLE.com William and Kate meet Ireland's president and T…","Published_Date":"2020-03-03","Content":"March 03, 2020Duchess Kate went green again in Ireland on the first day of her tour of Ireland with Prince William. The Duchess of Cambridge shimmered in a green dress by The Vampire's Wife as she and her husband stepped out to the Guinness Storehouse's Gravi… "}
{"Source_Name":"Yahoo.com","Author":"Alicja Siekierska","Title":"CN trains back up and running but recovery 'will take several weeks' - Yahoo Canada Finance","Description":"CN trains back up and running but recovery 'will take several weeks' Yahoo Canada Finance CN employees heading back to work after temporary layoffs as blockades wind down CTV News 'We've got 10 months': CN CEO aims to hit forecasts despite blockades BNNBloomb…","Published_Date":"2020-03-03","Content":"Canadian National railway says its trains are back up and running, and employees are returning to work as the anti-pipeline protests that brought part of its network to a virtual standstill appear to have largely disappeared.CN said in a statement Tuesday t… "}
{"Source_Name":"Bnnbloomberg.ca","Author":"Bloomberg News","Title":"All signs point to Bank of Canada following Fed's rate cut - BNNBloomberg.ca","Description":"All signs point to Bank of Canada following Fed's rate cut BNNBloomberg.ca Fed official says coronavirus uncertainty could lead to demand shock The Globe and Mail Why the Fed Rate Cut Will Inflate the Stock Bubble – And Cause It To Pop CCN.com The Fed's Rate …","Published_Date":"2020-03-03","Content":"The Bank of Canada is poised to follow the U.S. Federal Reserve and cut interest rates in the face of rising coronavirus concerns.All odds point to Governor Stephen Poloz lowering interest rates by at least 25 basis points on Wednesday after global coronavi… "}
{"Source_Name":"Globalnews.ca","Author":"jonazpiri","Title":"University Canada West closes Vancouver campus following presumptive case of COVID-19 - Global News","Description":"University Canada West closes Vancouver campus following presumptive case of COVID-19 Global News COVID-19 precautions close Vancouver business school for 3-day disinfection CBC.ca Vancouver university temporarily closed over 'possible student exposure' to CO…","Published_Date":"2020-03-05","Content":"A private Vancouver university says it has closed its doors after identifying a student with a presumptive case of COVID-19.In a statement, University Canada West said the “student had been visited by their father who has positively been tested for COVID-19… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"U.S. refuses more than 100 people from Canada over COVID-19 concerns - CBC News","Description":"U.S. refuses more than 100 people from Canada over COVID-19 concerns CBC News B.C. premier outlines province’s COVID-19 response plan Global News B.C. identifies 8 new COVID-19 infections, including a 'community case' CTV News John Horgan to announce BC’s res…","Published_Date":"2020-03-06","Content":"More than 100 people have been refused entry from Canada into the United States as a result of coronavirus-related travel restrictions, according to a senior U.S. official.»»» Subscribe to CBC News to watch more videos: http:\/\/bit.ly\/1RreYWSConnect with C… "}
{"Source_Name":"Yahoo.com","Author":"Alicja Siekierska","Title":"TSX plunges as much as 10%, prompting trading halt - Yahoo Canada Finance","Description":"TSX plunges as much as 10%, prompting trading halt Yahoo Canada Finance US stocks halted after falling 7%. Global stocks plunge as oil crashes and coronavirus fear spreads CNN Dow plummets more than 1,600 points, S&P 500 sinks 6% amid oil price war CNBC Look …","Published_Date":"2020-03-09","Content":"The Toronto Stock Exchange ended Mondays bleak trading session down more than 10 per cent as a collapse in oil prices and ongoing concerns about the coronavirus outbreak pummelled stock markets around the world. The S&amp;P\/TSX Composite Index (^GSPTSE) fel… "}
{"Source_Name":"Yahoo.com","Author":"Emily McCormick","Title":"Stock market news live updates: Stock futures fall, extending Monday's crushing losses - Yahoo Canada Finance","Description":"Stock market news live updates: Stock futures fall, extending Monday's crushing losses Yahoo Canada Finance Dow futures point to opening surge of 600 points after Trump floats payroll tax cut CNBC Billions of dollars in value vanishes on major markets as a re…","Published_Date":"2020-03-09","Content":"Contracts on the S&amp;P 500, Dow and Nasdaq kicked off the overnight session sharply lower before turning positive, suggesting the market carnage from Monday may partially rebound."}
{"Source_Name":"680news.com","Author":null,"Title":"Bank of Canada expected to cut interest rate amid coronavirus concerns - 680 News","Description":"Bank of Canada expected to cut interest rate amid coronavirus concerns 680 News The Fed just hit the coronavirus panic button CNN Trump Calling For Even a Bigger Rate Cut Benefits Bitcoin For This Key Reason newsBTC Can the Fed Save the Economy From Coronavir…","Published_Date":"2020-03-04","Content":"The Bank of Canada will announce Wednesday morning its trend-setting interest rate amid economic concerns stemming from the novel coronavirus outbreak.In January, governor Stephen Poloz opened the door to a possible interest rate cut if weakness in the econ… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Demi Lovato Opens Up About Overdose On 'The Ellen Show' - ET Canada","Description":"Demi Lovato Opens Up About Overdose On 'The Ellen Show' ET Canada Demi Lovato discusses her relapse and OD: 'I'm 6 years sober, but I'm miserable' Yahoo Entertainment Demi Lovato Gets Candid About Her Eating Disorder Struggle TheEllenShow Demi Lovato Discusse…","Published_Date":"2020-03-05","Content":""}
{"Source_Name":"Huffingtonpost.ca","Author":"Sima Shakeri","Title":"Peter MacKay Says He Regrets How 'Stinking Albatross' Comment Was Viewed - HuffPost Canada","Description":"Peter MacKay Says He Regrets How 'Stinking Albatross' Comment Was Viewed HuffPost Canada Jason Kenney endorses Erin O'Toole for Conservative leader | Power & Politics CBC News 10\/3 podcast: What Jason Kenney's Erin O'Toole endorsement means National Post Pete…","Published_Date":"2020-03-06","Content":"REGINA — Federal Conservative leadership candidate Peter MacKay says he regrets how some people interpreted his comment that current leader Andrew Scheer’s socially conservative values were a “stinking albatross.”MacKay made the remark after the last federa… "}
{"Source_Name":"Mashable","Author":"Amanda Yeo","Title":"Google asks tens of thousands of U.S. workers to stay home amid coronavirus fears","Description":"As concern about the coronavirus continues to build, many workplaces are encouraging people to work remotely to prevent it from spreading further. Now, in one of the biggest such moves yet, Google has asked all its employees in the U.S. and Canada to work fro…","Published_Date":"2020-03-11","Content":"As concern about the coronavirus continues to build, many workplaces are encouraging people to work remotely to prevent it from spreading further. Now, in one of the biggest such moves yet, Google has asked all its employees in the U.S. and Canada to work fro… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Italian doctor on treating COVID-19 patients - CTV News","Description":"Italian doctor on treating COVID-19 patients CTV News How to protect yourself and others from infection as COVID-19 cases increase CityNews Opinion: Canada must prepare its hospitals for COVID-19. And do it quickly National Post View Full coverage on Google N…","Published_Date":"2020-03-04","Content":"Non"}
{"Source_Name":"Sootoday.com","Author":"Brad Coccimiglio","Title":"Jacobs splits on day two of Brier - SooToday.com","Description":"Jacobs splits on day two of Brier SooToday.com 2020 Tim Hortons Brier - Media Scrum - Draw 5 Curling Canada Curlers hoping to find elusive ‘zone’ in Kingston this week TSN Bryan Cochrane was going to retire from curling. Then a new rule changed everything CBC…","Published_Date":"2020-03-02","Content":"The second day of competition at the 2020 Tim Hortons Brier in Kingston, Ont. saw Team Northern Ontario, represented by Sault Ste. Marie’s Brad Jacobs and his team from the Community First Curling Centre locally, pick up a split.The split means the Jacobs r… "}
{"Source_Name":"Calgarysun.com","Author":null,"Title":"Flames move into third place in Pacific Division with victory over Florida - Calgary Sun","Description":"Flames move into third place in Pacific Division with victory over Florida Calgary Sun NHL Highlights | Flames @ Panthers 3\/1\/20 NHL Talbot makes 38 saves as Flames beat Panthers TSN Flames blank Panthers as Florida loses record 7th straight at home Sportsnet…","Published_Date":"2020-03-02","Content":"SUNRISE, Fla. — Sunday’s game-winning goal was for Grandpa John.Skating with a heavy heart after the loss of one of his biggest fans, Johnny Gaudreau was both the offensive and emotional engine for the Calgary Flames as they capped a five-game getaway with … "}
{"Source_Name":"Castanet.net","Author":null,"Title":"B.C. Special Olympic athletes return to the Okanagan with medals - Kelowna News - Castanet.net","Description":"B.C. Special Olympic athletes return to the Okanagan with medals - Kelowna News Castanet.net Whitehorse Special Olympics athletes return home from Canada Winter Games with medals CBC.ca Thunder Bay says goodbye to special Olympians Tbnewswatch.com Training pa…","Published_Date":"2020-03-02","Content":"Kelowna International Airport's arrival bay was filled with family, friends, and fans of Team BC's Special Olympic athletes Sunday afternoon. After a short flight delay, 30 members returned home from competing at the Special Olympics Canada Winter Games hel… "}
{"Source_Name":"Winnipegsun.com","Author":null,"Title":"Measuring system in curling comes into question after controversial finish at Brier - Winnipeg Sun","Description":"Measuring system in curling comes into question after controversial finish at Brier Winnipeg Sun Alberta, Wild Card last unbeaten rinks at Brier TSN 2020 Tim Hortons Brier - Media Scrum - Draw 8 Curling Canada CTV News at Five and Six broadcasting from 2020 T…","Published_Date":"2020-03-02","Content":"KINGSTON, Ont. — What would a national curling championship be without a bit of controversy?It came to the Tim Hortons Brier on Sunday night when Manitoba’s Jason Gunnlaugson won a measurement in the 10th end to score a deuce and pull off a 6-5 upset of top… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Justin Bieber Has the Perfect Answer When Asked How Many Kids He Wants - Entertainment Tonight","Description":"Justin Bieber Has the Perfect Answer When Asked How Many Kids He Wants Entertainment Tonight Hailey Bieber Loves to Call Justin Bieber by This Pet Name E! Online Justin Bieber Answers Ellen's 'Burning Questions' TheEllenShow Justin Bieber Drops ‘Habitual’ Vid…","Published_Date":"2020-03-03","Content":""}
{"Source_Name":"Citynews1130.com","Author":null,"Title":"U of C researchers highlight the importance of hand hygiene - CityNews Vancouver","Description":"CALGARY (CityNews) – An open-source tool designed by University of Calgary researchers is gaining traction as a way to help remind people to wash their hands. This, as Canada reported more cases of COVID-19 on Thursday. READ MORE: WHO racing to send supplies …","Published_Date":"2020-03-05","Content":"CALGARY (CityNews) – An open-source tool designed by University of Calgary researchers is gaining traction as a way to help remind people to wash their hands.This, as Canada reported more cases of COVID-19 on Thursday.READ MORE: WHO racing to send supplie… "}
{"Source_Name":"Al Jazeera English","Author":"Al Jazeera","Title":"Russia has OPEC over a barrel as cartel agrees to deep oil cuts - Aljazeera.com","Description":"Russia has OPEC over a barrel as cartel agrees to deep oil cuts Aljazeera.com OPEC unveils plan to slash production after coronavirus slams oil prices CNN OPEC Gambles With Move to Force Russia Into Oil Production Cut Yahoo Canada Finance The Risk For Oil Is …","Published_Date":"2020-03-05","Content":"Against a backdrop of ebbing energy demand as the coronavirus outbreak sweeps the globe, OPEC on Thursday agreed to cut the output by an extra 1.5 million barrels per day (bpd) in the second quarter of this year - but only if Russia joins in.The oil demand … "}
{"Source_Name":"Vocm.com","Author":"Ben Murphy","Title":"Team Gushue Wins Third Brier in Four Years - VOCM","Description":"Team Gushue Wins Third Brier in Four Years VOCM Tim Hortons Brier: Final - Newfoundland and Labrador 7, Alberta 3 FULL HIGHLIGHTS TSN 2020 Tim Hortons Brier - Media Scrum - Final Curling Canada Brad Gushue captures 3rd Brier title in 4 years CBC.ca Team Gushu…","Published_Date":"2020-03-09","Content":"Team Gushue are Brier champions for the third time in four years. Brad Gushue and team members Mark Nichols, Brett Gallant and Geoff Walker defeated Brendan Bottcher’s team representing Alberta, by a final score of 7-3 to take home another national champion… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Saudi slashes oil prices amid dispute with Russia - Al Jazeera English","Description":"Saudi slashes oil prices amid dispute with Russia Al Jazeera English What the oil plunge means for Canada and Alberta Global News Shares plunge in worst day since financial crisis BBC News Six Thoughts on the Collapse of the Oil Market Bloomberg Russia-Saudi …","Published_Date":"2020-03-09","Content":""}
{"Source_Name":"Www.tsn.ca","Author":"TSN.ca Staff","Title":"Dark horse Dunstone focuses on getting Saskatchewan back to Brier playoffs - TSN","Description":"Dark horse Dunstone focuses on getting Saskatchewan back to Brier playoffs TSN No lead is safe as jaw-dropping shots making for memorable Brier CBC.ca 2020 Tim Hortons Brier - Media Scrum - Draw 13 Curling Canada BC rink ends Brier with loss Terrace Standard …","Published_Date":"2020-03-04","Content":"KINGSTON, Ont. Saskatchewan is hungry for a Brier title. The prairie province hasnt won the Tankard in four decades ever since Rick Folk and his Saskatoon rink of Ron Mills, Tom Wilson and lead Jim Wilson stood atop the podium at the Stampede Corral in Calg… "}
{"Source_Name":"Castanet.net","Author":null,"Title":"Oil plunges 25 per cent as new virus-fueled trading week begins - World News - Castanet.net","Description":"Oil plunges 25 per cent as new virus-fueled trading week begins - World News Castanet.net What the oil plunge means for Canada and Alberta Global News Shares plunge in worst day since financial crisis BBC News Six Thoughts on the Collapse of the Oil Market Bl…","Published_Date":"2020-03-09","Content":"Oil prices are plunging amid concern a dispute among producers could lead a global economy weakened by COVID-19 to be awash in an oversupply of crude.Brent crude, the international standard, lost $11.44, or 25.3%, to $33.83 per barrel in electronic trading … "}
{"Source_Name":"Thestarphoenix.com","Author":"Phil Tank, Saskatoon StarPhoenix","Title":"Juno awards proceeding in Saskatoon despite coronavirus concern - Saskatoon StarPhoenix","Description":"Juno awards proceeding in Saskatoon despite coronavirus concern Saskatoon StarPhoenix The coronavirus effect: COVID-19’s impact on sporting, cultural, civic events across Canada Global News Hotel rooms and Juno event tickets still available says Tourism Saska…","Published_Date":"2020-03-09","Content":"That would be a big shift, that would be something different. If we did have an outbreak in a long-term care facility, that also would be a shift and a change in how we manage (any potential outbreak), Opondo said.Pamela Goulden-McLeod, the citys director o… "}
{"Source_Name":"BBC News","Author":"https:\/\/www.facebook.com\/bbcnews","Title":"Canada presents bill banning conversion therapy","Description":"The federal government has introduced legislation that would criminalise the discredited practice.","Published_Date":"2020-03-09","Content":"Image copyrightGetty ImagesImage caption The so-called therapy is widely discreditedCanada's government is moving ahead with plans for a nationwide ban on conversion therapy.Newly proposed federal legislation would make it illegal to have a minor underg… "}
{"Source_Name":"Business Insider","Author":"Yeji Jesse Lee","Title":"Canada's cannabis market may balloon to $2.8 billion this year. Despite strict packaging rules, top edibles companies say they're racing to get a foot in the door.","Description":"Canada legalized cannabis in 2018, but only recently has the country allowed products like vapes, edibles, and beverages to be sold on store shelves. US-based edibles companies are either gearing up to launch products in Canada or waiting to see how other bra…","Published_Date":"2020-03-10","Content":"The packaging on Canadian cannabis edibles is far from attractive.It's plastered with yellow health-warning labels and prohibited from having images or fluorescent colors. Nor can it include cutout windows to show the inside of the container, meaning consum… "}
{"Source_Name":"Boingboing.net","Author":"David Pescovitz","Title":"Crazy video of fireworks shooting from car as it's speeding down highway","Description":"On Friday night, someone driving on a Saskatoon, Canada highway was sure having a blast. Watch the CTV News video above. According to the newscaster, \"Saskatoon police have not confirmed whether they are investigating.\" At least they haven't confirmed that th…","Published_Date":"2020-03-02","Content":"Non"}
{"Source_Name":"Yahoo.com","Author":null,"Title":"In Canada, doctors broadened coronavirus testing, and made an unlikely save","Description":"Canada's official guidance on the novel coronavirus has been to test patients who recently traveled to affected areas, but some doctors and hospitals have expanded testing on their own, finding the first in a series of patients linked to Iran before the scale…","Published_Date":"2020-03-06","Content":"Non"}
{"Source_Name":"Ctvnews.ca","Author":"Rachel Gilmore","Title":"Tory leadership candidate's climate plan is to 'drill, drill, build pipelines' and 'adapt' - CTV News","Description":"Tory leadership candidate's climate plan is to 'drill, drill, build pipelines' and 'adapt' CTV News Conservative leadership candidate Jim Karahalios pledges to kill carbon tax, exit Paris deal CBC.ca MacKay a front-runner for Tory leadership race, but half of…","Published_Date":"2020-03-05","Content":"OTTAWA -- Conservative Leadership Candidate Jim Karahalios says his environmental plan would be to \"drill, drill, build pipelines\" and \"adapt.\"During an episode of CTV Power Play on Wednesday, host Evan Solomon asked Karahalios how he would get pipelines … "}
{"Source_Name":"Cheatsheet.com","Author":"Aramide Tinubu","Title":"Prince Harry and Meghan Markle Won't Bring Archie to the UK for Their Final Royal Engagements - Showbiz Cheat Sheet","Description":"Prince Harry and Meghan Markle Won't Bring Archie to the UK for Their Final Royal Engagements Showbiz Cheat Sheet Baby Archie to Stay in Canada During Meghan Markle & Prince Harry's U.K. Trip (Report) Access Courteney Cox Says There's 'No Way' She'd Last In T…","Published_Date":"2020-03-03","Content":"Meghan, Duchess of Sussex and Prince Harry are finishing out their final engagements as senior working members of the British Royal Family. Unfortunately, the transition hasn’t been as smooth as everyone had hoped it would be. When the duo first announced the… "}
{"Source_Name":"Ctvnews.ca","Author":"Jackie Dunham","Title":"Final spring forward: Yukoners to end seasonal time changes - CTV News","Description":"Final spring forward: Yukoners to end seasonal time changes CTV News Yukon to make Daylight Saving Time permanent after final time change Sunday Global News Yukon to stay on daylight time as territory scraps seasonal time change CBC.ca Yukon Will No Longer Ch…","Published_Date":"2020-03-05","Content":"TORONTO -- Yukoners will be changing their clocks for the last time this weekend after the government announced the territory will no longer participate in seasonal time changes.On Sunday, Yukon residents will adjust their clocks an hour forward for the a… "}
{"Source_Name":"Ctvnews.ca","Author":"Aleksandra Sagan","Title":"Starbucks halts use of personal cups at North American stores over coronavirus - CTV News","Description":"Starbucks halts use of personal cups at North American stores over coronavirus CTV News Fears of coronavirus contamination prompt coffee chains to temporarily ban reusable mugs CBC.ca Coronavirus: Starbucks halting use of personal, in-store cups in U.S. and C…","Published_Date":"2020-03-05","Content":"Two major coffee chains have stopped serving coffee in reusable cups brought by customers amid the novel coronavirus outbreak.Starbucks and The Second Cup Ltd. say they are temporarily halting the environmentally friendly measure, but will continue to honou… "}
{"Source_Name":"Reuters","Author":"Jeff Lewis","Title":"Miners avoid handshakes at Toronto meeting over coronavirus fears","Description":"Miners in Toronto for an annual industry dealmaking event slathered on hand sanitizer and avoided handshakes, while Chile's mines minister doled out masks as coronavirus concerns overshadowed buyout buzz and prompted delegates to scrap some events.","Published_Date":"2020-03-02","Content":"TORONTO (Reuters) - Miners in Toronto for an annual industry dealmaking event slathered on hand sanitizer and avoided handshakes, while Chile’s mines minister doled out masks as coronavirus concerns overshadowed buyout buzz and prompted delegates to scrap som… "}
{"Source_Name":"Ctvnews.ca","Author":"Teresa Wright","Title":"Work on Coastal GasLink pipeline resumes, but impasse on pipeline remains - CTV News","Description":"Work on Coastal GasLink pipeline resumes, but impasse on pipeline remains CTV News Wet'suwet'en protests: What you need to know about the anti-pipeline blockades in Canada National Post Coastal GasLink pipeline construction resumes with draft accord set betwe…","Published_Date":"2020-03-02","Content":"OTTAWA -- Work has resumed on a natural gas pipeline in British Columbia at the centre of protests that have disrupted both rail and road traffic across the country, but questions remain about how opponents to the project will react to workers and the RCMP … "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Kate Middleton Sips Guinness With Prince William On Ireland Tour - Access","Description":"Kate Middleton Sips Guinness With Prince William On Ireland Tour Access Royal Inspiration! Kate Middleton Wears Metallic Dress Almost Identical to Princess Beatrice's Look PEOPLE.com Prince William and Kate start first official visit to Ireland The Telegraph …","Published_Date":"2020-03-04","Content":"Cheers! Kate Middleton and Prince William are getting an early start on St. Patrick's Day festivities! The Duke and Duchess of Cambridge toasted Irish guards at the Guinness Storehouse's Gravity Bar in Dublin on Tuesday, the first evening event of their Irela… "}
{"Source_Name":"Bnnbloomberg.ca","Author":"Bloomberg News","Title":"Global stocks sink with crude oil in free fall - BNNBloomberg.ca","Description":"Global stocks sink with crude oil in free fall BNNBloomberg.ca Collapse in oil triggers plunge on stock markets, loonie takes a dive CTV News Collapse in oil triggers plunge on stock markets, loonie takes a dive CP24 Toronto's Breaking News Toronto stocks eye…","Published_Date":"2020-03-09","Content":"U.S. stocks plunged more than 7.5 per cent in the worst day on Wall Street since the financial crisis, as a full-blown oil price war rattled financial markets already on edge over the spreading coronavirus. Treasury yields plummeted, crude sank 20 per cent an… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"COVID-19: Canada's top doctor warns against travelling on cruise ships - CTV News","Description":"COVID-19: Canada's top doctor warns against travelling on cruise ships CTV News COVID-19: B.C. man on Grand Princess ‘exhilarated’ to be repatriated back to Canada Global News Coronavirus live updates: Don't go on cruises, Canada's top doctor says National Po…","Published_Date":"2020-03-09","Content":"OTTAWA -- As Canadian passengers aboard the Grand Princess cruise ship wait for a chartered plane to take them back to Canada from Oakland, Calif., Canadian health officials are warning Canadians to avoid travelling on all cruise ships in order to prevent t… "}
{"Source_Name":"Www.tsn.ca","Author":"TSN.ca Staff","Title":"Jacobs rink vows to 'fight, fight, fight' possibility of missing playoffs - TSN","Description":"Jacobs rink vows to 'fight, fight, fight' possibility of missing playoffs TSN 2020 Tim Hortons Brier - Media Scrum - Draw 11 Curling Canada Eight Ends: Early observations from the 2020 Brier Sportsnet.ca CTV News at Five and Six broadcasting from 2020 Tim Hor…","Published_Date":"2020-03-03","Content":"KINGSTON, Ont. The No. 1 ranked team on the planet has their backs against the wall at the Tim Hortons Brier.Northern Ontario skip Brad Jacobs and his team were the hottest rink in curling this season heading into the Canadian mens curling championship afte… "}
{"Source_Name":"Livescience.com","Author":"Stephanie Pappas","Title":"How does the new coronavirus spread? - Livescience.com","Description":"How does the new coronavirus spread? Livescience.com How do I know if I have COVID-19? A guide to symptoms CTV News Best practices to take action against COVID-19 | ABC NEWS LIVE PRIME ABC News Shaun Francis: If the virus hits Canada, our hospitals will be ov…","Published_Date":"2020-03-03","Content":"The new coronavirus SARS-CoV-2 appears to be fairly easily spread. But the good news is that it's not among the most transmissible diseases out there.The new coronavirus spreads mostly through person-to-person contact within about a 6-foot (1.8 meters) radi… "}
{"Source_Name":"Cp24.com","Author":"The Canadian Press","Title":"Ontario reports three new coronavirus cases, brings province's total to 18 - CP24 Toronto's Breaking News","Description":"Ontario reports three new coronavirus cases, brings province's total to 18 CP24 Toronto's Breaking News LILLEY: Health officials reveal 4 new cases of COVID-19 Sunday in GTA Toronto Sun Coronavirus in Canada: Here’s a timeline of cases across provinces Global…","Published_Date":"2020-03-02","Content":"TORONTO - Ontario is reporting three new cases of the novel coronavirus today, bringing the total in the province to 18.The province's chief medical officer of health, Dr. David Williams, is expected to provide details about the new cases at a news conferen… "}
{"Source_Name":"Cp24.com","Author":"Allison Jones","Title":"Ontario reports three new coronavirus cases, bringing province's total to 18 - CP24 Toronto's Breaking News","Description":"Ontario reports three new coronavirus cases, bringing province's total to 18 CP24 Toronto's Breaking News Sudbury health unit planning for possible pandemic of COVID-19 CBC.ca Global concerns rising over COVID-19, seven new cases in Canada, sixth deaths in U.…","Published_Date":"2020-03-02","Content":"TORONTO -- Ontario reported three new cases of the novel coronavirus Monday, bringing the total in the province to 18, though officials say the virus is not spreading locally.A spate of new cases has been reported over the past few days, all of them people … "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Compared: AirPods Pro, Galaxy Buds+, & Powerbeats Pro! - AppleInsider","Description":"Compared: AirPods Pro, Galaxy Buds+, & Powerbeats Pro! AppleInsider Razer Hammerhead True Wireless review: \"A fierce competitor to Apple's AirPods\" GamesRadar+ Apple AirPods 2 on Sale for $188 from Costco Online So You Can Skip the Warehouse iPhone in Canada …","Published_Date":"2020-03-05","Content":"We compare the brand new Samsung Galaxy Buds Plus against Apple's massively popular AirPods Pro and Powerbeats Pro. Which is the best true wireless headphone?Apple AirPods Pro ON SALE https:\/\/amzn.to\/2TH5r92Or buy from B&amp;H https:\/\/bhpho.to\/3asSjuQLowest… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"What the coronavirus means for business | CNBC Reports - CNBC International","Description":"What the coronavirus means for business | CNBC Reports CNBC International How Canada is encouraging self-isolation to prevent the spread of COVID-19 Global News Coronavirus: The misinformation outbreak Sky News Is coronavirus technically a “pandemic”? Does th…","Published_Date":"2020-03-05","Content":"The novel coronavirus that originated in Asia, and has now spread to the Europe, the Americas and beyond, is impacting businesses around the world. CNBCs Nessa Anwar and Timothyna Duncan report on how industries are responding to the outbreak.-----Subscribe… "}
{"Source_Name":"Globalnews.ca","Author":"Kirby Bourne","Title":"Premier Jason Kenney defends Alberta’s ‘war room’ on 630 CHED amid opposition - Global News","Description":"Premier Jason Kenney defends Alberta’s ‘war room’ on 630 CHED amid opposition Global News Alberta Parks Closures, Privatizations Announced By Kenney Govt. HuffPost Canada Alberta unions put pressure on UCP government with new campaign Global News If Alberta t…","Published_Date":"2020-03-04","Content":"Appearing on 630 CHED Mornings with Chelsea Bird and Shaye Ganam on Wednesday, Premier Jason Kenney defended the Canadian Energy Centre, saying it’s still early in the project and Albertans can expect to see more from the new endeavor after they get fully sta… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Exploratory talks between Ontario high school teachers’ union and government break off - The Globe and Mail","Description":"Exploratory talks between Ontario high school teachers’ union and government break off The Globe and Mail Ford government backs down on high school class sizes, e-learning ahead of more Ont. teacher strikes CTV News I'm An Ontario Teacher But I Chose To Go Wh…","Published_Date":"2020-03-04","Content":"Thousands of picketers from the four main teachers' unions march around Queen's Park during a provincewide strike in Toronto on Feb. 21, 2020. Tijana Martin\/The Globe and MailThe union representing high-school teachers has ended informal contract talks wi… "}
{"Source_Name":"Ctvnews.ca","Author":"Carly Yoshida-Butryn","Title":"Protest shuts down major Vancouver intersection | CTV News - CTV News","Description":"Protest shuts down major Vancouver intersection | CTV News CTV News Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action Global News B.C. students join nationwide school walkout in support of Wet'suwet'en hereditary chiefs CB…","Published_Date":"2020-03-04","Content":"VANCOUVER -- A student walkout in support of the Wet'suwet'en hereditary chiefs who oppose a liquefied natural gas pipeline through their traditional territory closed the intersection of West 49th Avenue and Cambie Street in Vancouver during the afternoon r… "}
{"Source_Name":"Lethbridgenewsnow.com","Author":null,"Title":"Three new coronavirus cases in Ontario, pushing provincewide total to 23 - Lethbridge News Now","Description":"Three new coronavirus cases in Ontario, pushing provincewide total to 23 Lethbridge News Now Toronto man rode TTC, GO and MiWay before testing positive for COVID-19 CP24 Toronto's Breaking News Do you think you have coronavirus symptoms? Here’s who to call fi…","Published_Date":"2020-03-07","Content":"News from Peel region came after Ontarios chief medical officer of health announced two other new cases of the virus on Thursday.Dr. David Williams says those cases are a woman who returned to Kitchener, Ont., from Italy and a man who returned to Toronto fr… "}
{"Source_Name":"Ctvnews.ca","Author":"Mason DePatie","Title":"Daylight Saving Time is coming and you should check more than just your clock - CTV News","Description":"Daylight Saving Time is coming and you should check more than just your clock CTV News Daylight saving time switch linked to 28 fatal car accidents in U.S., study says National Post Yukon Will No Longer Change Clocks For Daylight Saving Time HuffPost Canada S…","Published_Date":"2020-03-06","Content":"WINNIPEG -- Clocks aren't the only thing you should check during the upcoming jump to Daylight Saving Time.As you set your clocks to spring ahead, the Winnipeg Fire Paramedic Service is recommending you check your smoke and carbon monoxide alarms too.Fi… "}
{"Source_Name":"Globalnews.ca","Author":"Simon Little","Title":"B.C. premier, health officials to provide update on COVID-19 - Global News","Description":"B.C. premier, health officials to provide update on COVID-19 Global News U.S. refuses more than 100 people from Canada over COVID-19 concerns CBC News B.C. identifies 8 new COVID-19 infections, including a 'community case' CTV News Coronavirus outbreak: Canad…","Published_Date":"2020-03-06","Content":"B.C.’s premier and top health officials are scheduled to provide an update on the province’s preparations for COVID-19 on Friday.The event is scheduled for noon. Global News will stream the event live.READ MORE: B.C. identifies 8 new COVID-19 cases, one… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"B.C. records Canada’s first coronavirus death - The Globe and Mail","Description":"B.C. records Canada’s first coronavirus death The Globe and Mail COVID-19: B.C. announces Canada’s first coronavirus death Global News 1st COVID-19-related death in Canada recorded in B.C. CBC News Vaughn Palmer: Keep cruise ships away from B.C., health offic…","Published_Date":"2020-03-10","Content":"Canada is aware of some local transmission of the coronavirus, but so far it is limited to the outbreak at B.C.'s Lynn Valley Care Centre, seen here on March 9, 2020. DARRYL DYCK\/The Globe and MailCanada has recorded its first death from the new coronavir… "}
{"Source_Name":"Globalnews.ca","Author":"mattbingley","Title":"COVID-19 spurs calls to reduce traffic in Toronto hospitals - Global News","Description":"COVID-19 spurs calls to reduce traffic in Toronto hospitals Global News FUREY: It seems the public health system really is working in Canada – for now Toronto Sun Risk of coronavirus remains low - Chirico The North Bay Nugget Toronto man who returned from Swi…","Published_Date":"2020-03-10","Content":"With the number of positive cases of COVID-19 continuing to grow, especially in the Toronto region, preparations are underway to quell the possibility of infection spread within health facilities.Canadas first positive case of COVID-19 saw the patient atten… "}
{"Source_Name":"Ctvnews.ca","Author":"Ian Holliday","Title":"B.C. urges 'social distancing' as 7 new COVID-19 cases identified - CTV News","Description":"B.C. urges 'social distancing' as 7 new COVID-19 cases identified CTV News Coronavirus: B.C. confirms 7 new COVID-19 cases, 2 of them health-care workers Global News 7 new coronavirus cases found in BC CBC Vancouver 7 new coronavirus cases found in B.C., incl…","Published_Date":"2020-03-11","Content":"VANCOUVER -- Health officials in British Columbia are underlining the importance of \"social distancing\" as the province deals with seven new cases of COVID-19.Provincial Health Officer Dr. Bonnie Henry and B.C. Minister of Health Adrian Dix made the annou… "}
{"Source_Name":"Sportsnet.ca","Author":"Sportsnet Staff","Title":"Blue Jackets to close home games to public amid COVID-19 concerns - Sportsnet.ca","Description":"Blue Jackets to close home games to public amid COVID-19 concerns Sportsnet.ca Blue Jackets, Sharks to play games without fans due to concerns over COVID-19 TSN Blue Jackets continue to allow fan attendance, forgo state's recommendation Yahoo Canada Sports Pe…","Published_Date":"2020-03-11","Content":"The Columbus Blue Jackets will be closing home games at Nationwide Arena to the public in light of the Governor of Ohio Mike DeWine’s order prohibiting mass gatherings in the state as part of COVID-19 precautions, as long as the order is in effect, the team a… "}
{"Source_Name":"Globalnews.ca","Author":"Bill Graveland","Title":"Alberta premier worried about layoffs as oil and gas sector struggles with coronavirus - Global News","Description":"Alberta premier worried about layoffs as oil and gas sector struggles with coronavirus Global News A new, softer Jason Kenney emerges from the great oil collapse of 2020 CBC.ca Nenshi says Calgary 'must resist the urge to panic' after oil price collapse Calga…","Published_Date":"2020-03-11","Content":"Alberta Premier Jason Kenney flew to Ottawa on Wednesday with a list of demands and a key message for the prime minister to focus on the economy.Kenney and his fellow premiers are to meet with Prime Minister Justin Trudeau amid growing concerns about the no… "}
{"Source_Name":"Globalnews.ca","Author":"kerribreen1","Title":"Coronavirus: How gaps in U.S. health coverage could affect Canada’s fight against COVID-19 - Global News","Description":"Coronavirus: How gaps in U.S. health coverage could affect Canada’s fight against COVID-19 Global News Coronavirus live updates: Canadians being advised to stay away from cruises, self-monitor after travel National Post Global National: March 6, 2020 | How co…","Published_Date":"2020-03-07","Content":"How do you stop a disease from spreading in a country where millions have no health insurance? As the U.S. government takes steps to manage the COVID-19 outbreak — including an $8.3-billion funding package — its decisions may have implications for Canada.Af… "}
{"Source_Name":"Ctvnews.ca","Author":"Laura Osman","Title":"Canada's top doctor says country ready with co-ordinated response to COVID-19 - CTV News","Description":"A Canadian patient newly diagnosed with COVID-19 recently travelled to Las Vegas and used public transit in Toronto for several days before he was tested for the virus, says the Toronto public health authority.","Published_Date":"2020-03-07","Content":"OTTAWA -- A Canadian patient newly diagnosed with COVID-19 recently travelled to Las Vegas and used public transit in Toronto for several days before he was tested for the virus, says the Toronto public health authority.The man, who is in his 40s, was one… "}
{"Source_Name":"Engadget","Author":"Jon Fingas","Title":"Waymo's first outside investment round includes car industry heavyweights","Description":"Believe it or not, Waymo hasn't really leaned on outside help to fulfill its self-driving car ambitions -- Alphabet (and earlier, Google) has shouldered much of the load. Now, however, it's expanding its sources of cash. Waymo has announced its first external…","Published_Date":"2020-03-02","Content":"Alphabet is also contributing, but it appears to be in the minority this time around.Waymo was vague about how it would use the funds, saying only that this would help \"our people, our technology, and our operations.\" One look at Waymo's business suggests t… "}
{"Source_Name":"Autoblog.comhttps","Author":"Greg Rasa","Title":"Ford Transit electric commercial vans coming to U.S. and Canada for 2022","Description":"Filed under: Green, Ford, Minivan\/Van, Commercial Vehicles, Electric Continue reading Ford Transit electric commercial vans coming to U.S. and Canada for 2022 Ford Transit electric commercial vans coming to U.S. and Canada for 2022 originally appeared on Auto…","Published_Date":"2020-03-04","Content":"In this age of Amazon, delivery to your door has become the biggest of businesses, and delivery by any means, from piece-workers' personal vehicles to USPS postal trucks to, someday, pizza robots but most especially, delivery by cargo vans. Amazon has taken a… "}
{"Source_Name":"TechCrunch","Author":"David Riggs","Title":"The risky first transatlantic flight of a Reaper drone","Description":"The Royal Air Force delayed safety warnings about the first transatlantic flight of a new Reaper aircraft in 2018, over fears that they could tip anti-drone protestors to its arrival in the U.K.","Published_Date":"2020-03-09","Content":"The Royal Air Force delayed safety warnings about the first transatlantic flight of a new Reaper aircraft in 2018, over fears that they could tip anti-drone protestors to its arrival in the U.K., according to emails seen by TechCrunch.On July 11, 2018, the … "}
{"Source_Name":"Vice News","Author":"Anya Zoledziowski, Natasha Grzincic, Josh Visser","Title":"If You Have Coronavirus Symptoms in Canada, Here's What You Should Do","Description":"From avoiding face masks, travel, and racism to calling your doctor, here is every step you need to take if and when Canada experiences a COVID-19 outbreak.","Published_Date":"2020-03-05","Content":"This article originally appeared on VICE Canada.With at least 36 confirmed cases of the new coronavirus (COVID-19) in Canadaand many more expectedhealth authorities are providing frequent updates to ensure residents know exactly what to do if they suspect t… "}
{"Source_Name":"Swiss-miss.com","Author":"swissmiss","Title":"Blacksaw","Description":"I have fallen in love with Blacksaw Blankets. Check their brand video to learn more about this lovely Canada based company.","Published_Date":"2020-03-03","Content":"Non"}
{"Source_Name":"Financial Post","Author":null,"Title":"PDAC mining conference goers asked to monitor for coronavirus symptoms after Sudbury area man tests positive - Financial Post","Description":"PDAC mining conference goers asked to monitor for coronavirus symptoms after Sudbury area man tests positive Financial Post Sudbury man who attended Toronto conference has COVID-19: health officials CP24 Toronto's Breaking News Coronavirus update: Man from Su…","Published_Date":"2020-03-11","Content":"Anyone who attended the Prospectors &amp; Developers Association of Canada 2020 convention in Toronto is being asked to monitor themselves for symptoms of the coronavirus after a man who attended was tested positive in the Sudbury area.Dr. Penny Sutcliffe, … "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"PM Trudeau, Ont. Premier Ford attended same mining conference as Sudbury COVID-19 case - CTV News","Description":"PM Trudeau, Ont. Premier Ford attended same mining conference as Sudbury COVID-19 case CTV News Coronavirus update: Ontario confirms five more cases, investigating whether Sudbury case was community spread Toronto Star Sudbury man who attended Toronto confere…","Published_Date":"2020-03-11","Content":"TORONTO -- Prime Minister Justin Trudeau and Ontario Premier Doug Ford both attended the same conference as a man who tested positive for COVID-19.Ontario Public Health officials have confirmed a positive case of the new coronavirus in a Sudbury, Ont. man… "}
{"Source_Name":"Cp24.com","Author":"Chris Herhalt","Title":"Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case - CP24 Toronto's Breaking News","Description":"Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case CP24 Toronto's Breaking News Sudbury man who attended Toronto convention confirmed as Ontario’s 37th coronavirus case Global News Ontario's 36th COVID-19 patient is a Toronto man who tr…","Published_Date":"2020-03-10","Content":"Public health officials confirmed one new case of the novel coronavirus in Ontario, involving a Toronto man who recently returned to the province from Switzerland.The news brings Ontarios total case count including recoveries to 36, with five people who hav… "}
{"Source_Name":"Ctvnews.ca","Author":"Ben Cousins","Title":"Majority of Canadians call rail blockades 'unacceptable:' Nanos - CTV News","Description":"Majority of Canadians call rail blockades 'unacceptable:' Nanos CTV News Trudeau has to choose a clear path forward for The Globe and Mail Sunday Scrum: Federal response to the coronavirus outbreak CBC.ca 5 things to know on CTVNews.ca for Monday March 9, 202…","Published_Date":"2020-03-09","Content":"A majority of Canadians believe rail blockades in support of the Wetsuweten hereditary chiefs are either unacceptable or somewhat unacceptable demonstrations, according to latest survey results.According to the survey from Nanos Research, released Sunday ni… "}