{"Source_Name":"TechCrunch","Author":"Manish Singh","Title":"Leap Finance raises $5.5M to democratize financing for foreign-bound Indian students","Description":"Tens of thousands of Indians move to the United States to pursue higher education each year. But like many others who have arrived from a foreign land, they can’t secure education loans or personal loans from the banks at interest rates on par with those levi…","Published_Date":"2020-03-03","Content":"Tens of thousands of Indians move to the United States to pursue higher education each year. But like many others who have arrived from a foreign land, they cant secure education loans or personal loans from the banks at interest rates on par with those levie… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Canada to spend $1 billion combating COVID-19 spread, economic impacts - CTV News","Description":"Canada to spend $1 billion combating COVID-19 spread, economic impacts CTV News Federal government to announce supports for people, businesses hit by COVID-19 on Wednesday CBC.ca Canada releases coronavirus guidelines on when to cancel major events CTV News J…","Published_Date":"2020-03-11","Content":"OTTAWA -- The federal government is putting more than $1 billion into its plan to combat and mitigate the impacts of the outbreak of COVID-19 in Canada.Prime Minister Justin Trudeau and a handful of key cabinet ministers announced the \"comprehensive\" coro… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Exploratory talks between Ontario high school teachers’ union and government break off - The Globe and Mail","Description":"Exploratory talks between Ontario high school teachers’ union and government break off The Globe and Mail Ford government backs down on high school class sizes, e-learning ahead of more Ont. teacher strikes CTV News I'm An Ontario Teacher But I Chose To Go Wh…","Published_Date":"2020-03-04","Content":"Thousands of picketers from the four main teachers' unions march around Queen's Park during a provincewide strike in Toronto on Feb. 21, 2020. Tijana Martin\/The Globe and MailThe union representing high-school teachers has ended informal contract talks wi… "}
{"Source_Name":"The Globe And Mail","Author":"Matt Sedensky, John Leicester","Title":"WHO urges governments to pull out 'all the stops' to slow spread of coronavirus - The Globe and Mail","Description":"WHO urges governments to pull out 'all the stops' to slow spread of coronavirus The Globe and Mail Canada confirms first 'community case' of COVID-19: Here's what that means CTV News Chinese province at centre of coronavirus outbreak reports no new cases outs…","Published_Date":"2020-03-05","Content":"Iraqi medical staff check a passenger's temperature upon arriving at Najaf airport, on March 5, 2020.ALAA AL-MARJANI\/ReutersOn Friday, health columnist Andre Picard will take reader questions during a live Facebook Q&amp;A. Email your coronavirus question… "}
{"Source_Name":"Globalnews.ca","Author":"Kirby Bourne","Title":"Premier Jason Kenney defends Alberta’s ‘war room’ on 630 CHED amid opposition - Global News","Description":"Premier Jason Kenney defends Alberta’s ‘war room’ on 630 CHED amid opposition Global News Alberta Parks Closures, Privatizations Announced By Kenney Govt. HuffPost Canada Alberta unions put pressure on UCP government with new campaign Global News If Alberta t…","Published_Date":"2020-03-04","Content":"Appearing on 630 CHED Mornings with Chelsea Bird and Shaye Ganam on Wednesday, Premier Jason Kenney defended the Canadian Energy Centre, saying it’s still early in the project and Albertans can expect to see more from the new endeavor after they get fully sta… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Canadian health officials warn schools of potentially critical role in slowing coronavirus spread - The Globe and Mail","Description":"Canadian health officials warn schools of potentially critical role in slowing coronavirus spread The Globe and Mail B.C. identifies 3 more cases of COVID-19, bringing total to 12 CBC.ca Two new caronavirus cases in Ontario, bringing total to 20 Toronto Sun C…","Published_Date":"2020-03-04","Content":"Theresa Tam, Canadas chief public health officer, seen here in Ottawa on Feb. 3, 2020, has also warned Canadians to prepare for the possibility that schools may need to close. BLAIR GABLE\/ReutersFrom stocking up on hand sanitizer and wipes to cancelling o… "}
{"Source_Name":"The Hindu","Author":"Special Correspondent","Title":"CII meeting showcases ease of doing business with Canada","Description":"Canada sees a huge opportunity to associate with Vizag in education: Consul","Published_Date":"2020-03-03","Content":"A programme held jointly by the Confederation of Indian Industry (CII) and the Indo-Canadian Business Chamber to promote Brand Canada evoked an encouraging response on Tuesday. A Canadian delegation led by Cyril Borle, Consul and Trade Commissioner, Mumbai,… "}
{"Source_Name":"CBC News","Author":null,"Title":"COVID-19: Here's what's happening around the world Tuesday - CBC.ca","Description":"COVID-19: Here's what's happening around the world Tuesday CBC.ca While other countries battle mushrooming coronavirus outbreaks, China claims victory is 'not far' The Globe and Mail Coronavirus: China orders travellers quarantined amid outbreak BBC News LILL…","Published_Date":"2020-03-03","Content":"The latest:All travellers entering Beijing from the virus hotspots of South Korea, Japan, Iran and Italy will have to be quarantined for 14 days, the deputy secretary general of the Beijing Municipal Government, Chen Bei, said on Tuesday.Shanghai earlier … "}
{"Source_Name":"Globalnews.ca","Author":"Staff","Title":"Alberta premier says frustrating coronavirus stifling oil and gas economy - Global News","Description":"Alberta premier says frustrating coronavirus stifling oil and gas economy Global News View Full coverage on Google News","Published_Date":"2020-03-02","Content":"Alberta Premier Jason Kenney says it’s difficult to watch global oil prices fall due to reduced demand tied to the novel coronavirus outbreak at the same time his government refocuses its efforts on job creation.“I won’t hide it: it frustrates me that I thi… "}
{"Source_Name":"Entrepreneur.com","Author":"The Oracles","Title":"Why Fitness Entrepreneur Jonathan Goodman Chose a Life of Exploration Over a Bigger Business &#8212 and How It Paid Off","Description":"To build a business on your terms, you can't compare yourself to others.","Published_Date":"2020-03-09","Content":"Opinions expressed by Entrepreneur contributors are their own.In this series called Member Showcase, we publish interviews with members of The Oracles. This interview is with Jonathan Goodman, founder of the Personal Trainer Development Center, a remote edu… "}
{"Source_Name":"Openculture.com","Author":"Josh Jones","Title":"The Summerhill School, the Radical Educational Experiment That Let Students Learn What, When, and How They Want (1966)","Description":"Among the political and social revolutions of the 1960s, the movement to democratize education is of central historical importance. Parents and politicians were entrenched in battles over integrating local schools years after 1954’s Brown v. Board of Educatio…","Published_Date":"2020-03-09","Content":"Among the political and social revolutions of the 1960s, the movement to democratize education is of central historical importance. Parents and politicians were entrenched in battles over integrating local schools years after 1954s Brown v. Board of Education… "}
{"Source_Name":"Calgaryherald.com","Author":null,"Title":"Some families asked to self-isolate in Calgary as schools prepare for COVID-19 - Calgary Herald","Description":"Some families asked to self-isolate in Calgary as schools prepare for COVID-19 Calgary Herald COVID-19 pandemic: How Calgary universities and schools are preparing CBC.ca View Full coverage on Google News","Published_Date":"2020-03-11","Content":"With spring break, Easter holidays and rising cases of COVID-19 looming, Calgary public and separate schools have not yet announced plans to monitor the personal travel of staff and students, even as some public school families have already been asked to self… "}
{"Source_Name":"Thepointsguy.com","Author":"Jason Steele","Title":"Planning Your Honeymoon With American Express Membership Rewards Points","Description":"We’ve partnered with American Express to bring you personal finance news, advice and more. Check out Credit Intel, Amex’s financial education center, for more personal finance content. Any offers or benefits mentioned below are subject to change at any time, …","Published_Date":"2020-03-11","Content":"Weve partnered with American Express to bring you personal finance news, advice and more. Check out Credit Intel, Amexs financial education center, for more personal finance content.Any offers or benefits mentioned below are subject to change at any time, a… "}
{"Source_Name":"Al Jazeera English","Author":"Brandi Morin","Title":"'Our hearts bled': Covering the Wet'suwet'en crisis in Canada","Description":"A journalist reflects on what weeks of protests mean for the land's Indigenous - and how it goes beyond just a pipeline.","Published_Date":"2020-03-04","Content":"Alberta, Canada - The past month has been strained, emotional, tense. Covering the Wet'suwet'en crisis as an Indigenous journalist has been a challenge.In British Columbia, the hereditary chiefs of the Wet'suwet'en tribe are opposing the construction of a n… "}
{"Source_Name":"CBC News","Author":"The Canadian Press","Title":"Canadians worried about child care, education and housing affordability, Morneau told","Description":"Finance Minister Bill Morneau was told weeks into the Liberals' second mandate that Canadians are most worried about affordability in areas where governments have a lot of power over prices — particularly child care.","Published_Date":"2020-03-08","Content":"Finance Minister Bill Morneau was told weeks into the Liberals' second mandate that Canadians are most worried about affordability in areas where governments have a lot of power over prices particularly child care.The Canadian Press obtained the November pr… "}
{"Source_Name":"Nature.com","Author":null,"Title":"Relating Natural Language Aptitude to Differences in Learning Programming","Description":"Relating Natural Language Aptitude to Individual Differences in Learning Programming Languages","Published_Date":"2020-03-03","Content":"1.Cheryan, S., Ziegler, S. A., Montoya, A. K. &amp; Jiang, L. Why are some STEM fields more gender balanced than others? Psychol. Bull.143, 135 (2017).2.Jenkins, T. On the difficulty of learning to program. Proceedings of the 3rd Annua… "}
{"Source_Name":"Nature.com","Author":"Andy Tay","Title":"Make scientific meetings a welcoming place for patient partners","Description":"As science increasingly looks to co-produce research with patients, how can conference organizers help to accommodate non-scientists at academic meetings?","Published_Date":"2020-03-11","Content":"Participants attend a panel at the 50th World Economic Forum in Davos, Switzerland, in 2019.Credit: Thierry Falise\/LightRocket\/GettyIn 2019, the Patient-Centred Outcomes Research Institute was established in Washington DC to better involve patients in evalu… "}
{"Source_Name":"Nature.com","Author":"Andy Tay","Title":"Make scientific meetings a welcoming place for patient partners","Description":"As science increasingly looks to co-produce research with patients, how can conference organizers help to accommodate non-scientists at academic meetings?","Published_Date":"2020-03-11","Content":"Participants attend a panel at the 50th World Economic Forum in Davos, Switzerland, in 2019.Credit: Thierry Falise\/LightRocket\/GettyIn 2019, the Patient-Centred Outcomes Research Institute was established in Washington DC to better involve patients in evalu… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Sustainability goes mainstream for business education - The Globe and Mail","Description":"More business schools are embedding sustainability themes into courses and research","Published_Date":"2020-03-10","Content":"David Dunne, director of MBA Programs at the University of Victorias Gustavson School of Business, speaks to students in a classroom on campus.University of Victoria photo servicesUntil recently, Canadian business schools typically covered climate change,… "}
{"Source_Name":"Yahoo.com","Author":"Manish Singh","Title":"Leap Finance raises $5.5M to democratize financing for foreign-bound Indian students","Description":"The reason why these students -- or anyone else moving to a different country -- have to abide by a higher interest rate is because they don’t have a credit score with any local credit bureau. An Indian student studying in the U.S., for instance, borrows mone…","Published_Date":"2020-03-03","Content":"Tens of thousands of Indians move to the United States to pursue higher education each year. But like many others who have arrived from a foreign land, they cant secure education loans or personal loans from the banks at interest rates on par with those levie… "}
{"Source_Name":"Huffpost.com","Author":"AP","Title":"Cruise Ship Circles Off California Coast After 21 Test Positive For Coronavirus","Description":"The Grand Princess, with thousands of people aboard, was forbidden to dock in San Francisco over fears of COVID-19.","Published_Date":"2020-03-07","Content":"SAN FRANCISCO (AP) Thousands of people were confined Saturday to a cruise ship circling in international waters off the San Francisco Bay Area, after 21 passengers and crew members tested positive for the new coronavirus.The Grand Princess was forbidden to … "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"What happens if a case of coronavirus emerges at a Canadian school?","Description":"No cases of the coronavirus have yet emerged in elementary or secondary schools in Canada, but it's certainly possible that a student or teacher could become infected. CBC News looks at the ramifications if a case of COVID-19 materializes in a Canadian school.","Published_Date":"2020-03-08","Content":"In Canada, no cases of the coronavirus have yet emerged in elementary or secondary schools, but the virus has still impacted the lives of students.A number of school boards have cancelled class trips abroad and it's certainly possible that a student, or tea… "}
{"Source_Name":"CBC News","Author":"Sakshi Shetty,Kassandra Neranjan","Title":"How the Trudeau government is failing the world's most vulnerable despite its 'feminist' aid policy","Description":"Canada's Feminist International Assistance Policy is aimed at supporting the economic, political, and social empowerment of women and girls, but the government is falling short of the mark when it comes to addressing the Rohingya genocide and refugee crisis.","Published_Date":"2020-03-08","Content":"This column is an opinion by Sakshi Shetty and Kassandra Neranjan. Shetty is a University of Toronto alumni, and a researcher on gender and global health who is working with social enterprises in Toronto. Neranjan is a BCL\/JD candidate at the McGill Faculty o… "}
{"Source_Name":"Yahoo.com","Author":"Michael Daly","Title":"The Immigrant Racing To Deliver a Coronavirus Vaccine Never Would Have Made It to Trump’s America","Description":"President Trump was getting inaugurated later that week, so he was understandably absent when Bill Gates issued a prescient warning at the 2017 World Economic Summit in Davos, Switzerland.“Ebola and Zika showed that the world is tragically unprepared to detec…","Published_Date":"2020-03-04","Content":"President Trump was getting inaugurated later that week, so he was understandably absent when Bill Gates issued a prescient warning at the 2017 World Economic Summit in Davos, Switzerland.Ebola and Zika showed that the world is tragically unprepared to dete… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"China Online Education Group to Report Fourth Quarter and Full Year 2019 Financial Results on Monday, March 9, 2020","Description":"China Online Education Group (\"51Talk\", or the \"Company\") (NYSE: COE), a leading online education platform in China, with core expertise in English education, today announced that it will report its fourth quarter and full year 2019 unaudited financial result…","Published_Date":"2020-03-02","Content":"Earnings Call Scheduled for 8:00 a.m. ET on March 9, 2020BEIJING, March 2, 2020 \/PRNewswire\/ -- China Online Education Group (\"51Talk\", or the \"Company\") (NYSE: COE), a leading online education platform in China, with core expertise in English education, to… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"Consortium of Long Term Global Investors Enters into Exclusive Negotiations to Acquire Galileo Global Education","Description":"PARIS & LONDON--(BUSINESS WIRE)--Galileo Global Education (“Galileo” or the “Company”), a leading international provider of higher education and Europe’s largest higher education group, today announced that Providence Equity Partners (“Providence”), a majorit…","Published_Date":"2020-03-06","Content":"PARIS &amp; LONDON--(BUSINESS WIRE)--Galileo Global Education (Galileo or the Company), a leading international provider of higher education and Europes largest higher education group, today announced that Providence Equity Partners (Providence), a majority s… "}
{"Source_Name":"People.com","Author":"Benjamin VanHoose","Title":"Queen Elizabeth Makes Subtle Nod to Meghan Markle and Prince Harry in New Speech Amid Royal Exit","Description":"Queen Elizabeth is touting diversity in her latest speech. After Meghan Markle and Prince Harry returned to the U.K. at the request of the Queen, the monarch gave a subtle nod to the Duke and Duchess of Sussex in a new speech to celebrate Commonwealth Day. Re…","Published_Date":"2020-03-07","Content":"Queen Elizabeth is touting diversity in her latest speech.After Meghan Markle and Prince Harryreturned to the U.K. at the request of the Queen, the monarch gave a subtle nod to the Duke and Duchess of Sussex in a new speech to celebrate Commonwealth Day.R… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Namaste Adds US Based Ignite International Brands Ltd. to CannMart.com","Description":"Namaste Technologies Inc. (\"Namaste\" or the \"Company\") (TSXV: N) (FRANKFURT: M5BQ) (OTCMKTS: NXTTF), a leading platform for cannabis products, accessories, and education, today announced that its wholly owned subsidiary, CannMart Inc. (\"CannMart\"), has execut…","Published_Date":"2020-03-02","Content":"~Ignite and CannMart announce the launch of Ignite Branded Cannabis and Cannabis 2.0 offerings and accessories in the Canadian marketplace~TORONTO, March 2, 2020 \/PRNewswire\/ - Namaste Technologies Inc. (\"Namaste\" or the \"Company\") (TSXV: N) (FRANKFURT: M5B… "}
{"Source_Name":"People.com","Author":"Erin Hill","Title":"Meghan Markle Celebrates International Women's Day with a Surprise School Assembly!","Description":"Like she has in the past, Meghan Markle is celebrating International Women’s Day in a big way! The Duchess of Sussex, who is back in the U.K. for a final round of royal engagements, visited Robert Clack School in the town of Dagenham in east London on Friday …","Published_Date":"2020-03-07","Content":"Like she has in the past, Meghan Markle is celebrating International Women’s Day in a big way!The Duchess of Sussex, who is back in the U.K. for a final round of royal engagements, visited Robert Clack School in the town of Dagenham in east London on Friday… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"Robotics Education & Competition (REC) Foundation 2020 Online Challenges Winners Announced","Description":"DALLAS--(BUSINESS WIRE)--The Robotics Education & Competition (REC) Foundation announce the winners of the 2020 Online Challenges.","Published_Date":"2020-03-04","Content":"DALLAS--(BUSINESS WIRE)--The Robotics Education &amp; Competition (REC) Foundation is pleased to announce the winners of the 2020 Online Challenges, which encourage students to take what theyve learned through our programs and competitions and apply it to are… "}
{"Source_Name":"Phys.org","Author":"Shannon Ward","Title":"How a child's first language includes more than words","Description":"This International Mother Language Day (Feb. 21), Canadians celebrated their multilingual heritage by recognizing flexible uses of languages. According to UNESCO, \"Mother tongue or mother language refers to a child's first language, the language learned in th…","Published_Date":"2020-03-03","Content":"This International Mother Language Day (Feb. 21), Canadians celebrated their multilingual heritage by recognizing flexible uses of languages. According to UNESCO, \"Mother tongue or mother language refers to a child's first language, the language learned in th… "}
{"Source_Name":"Tncontentexchange.com","Author":"CompTIA","Title":"CompTIA Names Leaders for Emerging Technology Community - Cherokee Tribune Ledger News","Description":"DOWNERS GROVE, Ill., March 5, 2020 \/PRNewswire\/ -- CompTIA, the leading trade association for the global information technology (IT) industry, said today that 13 influential business leaders will serve as","Published_Date":"2020-03-05","Content":"DOWNERS GROVE, Ill., March 5, 2020 \/PRNewswire\/ -- CompTIA, the leading trade association for the global information technology (IT) industry, said today that 13 influential business leaders will serve as executive council members for its Emerging Technology … "}
{"Source_Name":"Cleveland.com","Author":"Rich Exner, cleveland.com","Title":"Most people in the U.S. boycott businesses based on social, political views, multi-country study finds - cleveland.com","Description":"The younger people are, the more likely they have been to boycott a company based on political or social values, a poll finds.","Published_Date":"2020-03-10","Content":"BEREA, Ohio - Younger adults and those who have attended college are more likely than others to refuse to purchase from a business based on political or social values, according to a four-country study conducted by researchers at Baldwin Wallace University an… "}
{"Source_Name":"Thechronicleherald.ca","Author":"Stuart Peddle","Title":"Nova Scotia won't add more students to tech pilot project - TheChronicleHerald.ca","Description":"This story has been re-edited for clarification.\r\n\r\nHALIFAX - A pilot project to give as many as 80 Nova Scotia students a leg up on tech careers will not accept more students after the current cohort moves through.\r\n\r\nThe Technology","Published_Date":"2020-03-05","Content":"This story has been re-edited for clarification.HALIFAX - A pilot project to give as many as 80 Nova Scotia students a leg up on tech careers will not accept more students after the current cohort moves through.The Technology Advantage Program, which was … "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Persolvent and CBORD Partner to Offer New Payment Technology for Campus-Based Organizations","Description":"Persolvent, an award-winning payment technology company, recently announced a partnership with CBORD, the leader in higher education and healthcare campus technology solutions. The partnership was first revealed to customers during CBORD's annual users group …","Published_Date":"2020-03-04","Content":"Partnership offers modern commerce experience for higher education and healthcare campusesST. PAUL, Minn., March 4, 2020 \/PRNewswire\/ -- Persolvent, an award-winning payment technology company, recently announced a partnership with CBORD, the leader in high… "}
{"Source_Name":"Complex.com","Author":"Alex Nino Gheciu, Alex Narvaez","Title":"How The Weeknd's HXOUSE Incubator Is Putting Canadian Creatives On","Description":"La Mar Taylor & Ahmed Ismail talk about The Weeknd's early days, their HXOUSE incubator, and how Canada is failing its young creatives.","Published_Date":"2020-03-03","Content":"Long before he was a motherfuckin’ starboy, The Weeknd and his XO camp literally had to steal food to keep their dreams alive. That was one of many nuggets revealed last Friday during In-HXOUSE Conversations, the latest in a panel series by HXOUSE, XO Recor… "}
{"Source_Name":"Goodmenproject.com","Author":"QUOI Media Group","Title":"Opioids Are Killing Canadians in the Thousands","Description":"“I wasn’t born to be a drug addict,” said a brave member of the audience at our recent Open Caucus meeting in the Senate on the Opioid Crisis in Canada. The post Opioids Are Killing Canadians in the Thousands appeared first on The Good Men Project.","Published_Date":"2020-03-11","Content":"—By Senator Jane Cordy and Senator Raymonde GagnéWe need to care moreI wasnt born to be a drug addict, said a brave member of the audience at our recent Open Caucus meeting in the Senate on the Opioid Crisis in Canada. He told us of his struggle with drug… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Okayama University e-Bulletin: Towards an International Hub for Educational Sustainable Development (ESD)","Description":"This issue includes a feature on 'Towards an International Hub for ESD: International Conference on Education for Sustainable Development is held at Okayama University'. Other contents include news on 'Two students from Okayama University participated in 'One…","Published_Date":"2020-03-09","Content":"OKAYAMA, Japan, March 9, 2020 \/PRNewswire\/ -- This issue includes a feature on 'Towards an International Hub for ESD: International Conference on Education for Sustainable Development is held at Okayama University'. Other contents include news on 'Two student… "}
{"Source_Name":"Mentalfloss.com","Author":"Ellen Gutoskey","Title":"49 Notable Columbia University Alumni","Description":"Columbia University, Manhattan's Ivy League institution, boasts Alexander Hamilton, Barack Obama, and even Alicia Keys (sort of) among its former students.","Published_Date":"2020-03-05","Content":"Undeclared undergrads are a dime a dozen, but the majority of incoming freshmenalong with most graduate studentshave a firm idea of where their professional futures lie. And its not always in a traditional occupation. From beer to bagpipes and pot to pop cult… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"The International Union of Operating Engineers and Built Robotics Announce Strategic Partnership","Description":"The International Union of Operating Engineers (IUOE), representing over 400,000 members across the United States and Canada who work as heavy equipment operators, mechanics, surveyors, welders, drivers, and stationary engineers, and Built Robotics, provider …","Published_Date":"2020-03-10","Content":"HOUSTON, March 10, 2020 \/PRNewswire\/ -- The International Union of Operating Engineers (IUOE), representing over 400,000 members across the United States and Canada who work as heavy equipment operators, mechanics, surveyors, welders, drivers, and stationary … "}
{"Source_Name":"Globalresearch.ca","Author":"Yves Engler","Title":"Trudeau Enables Corporate Canada to Exploit Ethiopia’s Minerals","Description":"The Federal government wants Canadian corporations to profit from Ethiopia’s minerals. During his recent trip to the Horn of Africa country Prime Minister Justin Trudeau announced negotiations on a Foreign Investment Promotion and Protection Agreement (FIPA).…","Published_Date":"2020-03-02","Content":"The Federal government wants Canadian corporations to profit from Ethiopias minerals.During his recent trip to the Horn of Africa country Prime Minister Justin Trudeau announced negotiations on a Foreign Investment Promotion and Protection Agreement (FIPA).… "}
{"Source_Name":"Bloomberg","Author":null,"Title":"Travel Companies Pull Forecasts; Italy Extends Ban: Virus Update","Description":"Italian Prime Minister Giuseppe Conte said he’ll move to extend restrictive measures on travel -- currently in force in the north -- throughout the rest of the country in a bid to limit the spread of the coronavirus after the number of cases soared by 25%. Ca…","Published_Date":"2020-03-09","Content":"Italian Prime Minister Giuseppe Conte said he’ll move to extend restrictive measures on travel -- currently in force in the north -- throughout the rest of the country in a bid to limit the spread of the coronavirus after the number of cases soared by 25%. Ca… "}
{"Source_Name":"People.com","Author":"Helen Murphy","Title":"Meghan Markle Urges Male Students to Make Sure Women 'Are Feeling Valued and Safe' in Speech","Description":"In her inspiring International Women’s Day speech at a U.K. school, Meghan Markle urged young men to do their part in achieving gender equality. On Friday, the Duchess of Sussex, who is back in the U.K. for a final round of royal engagements, visited Robert C…","Published_Date":"2020-03-07","Content":"In her inspiring International Women’s Day speech at a U.K. school, Meghan Markle urged young men to do their part in achieving gender equality.On Friday, the Duchess of Sussex, who is back in the U.K. for a final round of royal engagements, visited Robert … "}
{"Source_Name":"Forbes.com","Author":"Willy Shih, Contributor, Willy Shih, Contributor https:\/\/www.forbes.com\/sites\/willyshih\/","Title":"COVID-19, Shortage Gaming, And The Toilet Paper Supply Chain","Description":"Retail shortages in products like toilet paper are a nightmare for product managers, supply chain managers, and manufacturers.","Published_Date":"2020-03-04","Content":"An overnight report from a friend in Australia about shortages of toilet paper compels me to write about the supply chain for this product. Apparently retail shortages have hit Hong Kong, Japan, and Singapore, as well as Australia. This shortage gaming in pap… "}
{"Source_Name":"Vancouversun.com","Author":"Derrick Penner","Title":"Wet'suwet'en deal: We ask the experts","Description":"\"With respect to the Coastal GasLink Pipeline, the LNG Canada completion plant in Kitimat — all of those issues are fully permitted and fully underway,\" Premier John Horgan.","Published_Date":"2020-03-03","Content":"Premier John Horgan remained adamant on Monday that the agreement between the province, federal government and Wet’suwet’en First Nation over Aboriginal rights and title won’t affect the $6.6-billion Coastal GasLink project.The two levels of government and … "}
{"Source_Name":"Macleans.ca","Author":"Michael Fraiman","Title":"Stop taking cruises, Canada","Description":"Politics Insider for Mar. 9: The latest on COVID-19, the new Ontario Liberal leader and a probably plan to ban conversion therapy. The post Stop taking cruises, Canada appeared first on Macleans.ca.","Published_Date":"2020-03-09","Content":"Politics Insider for Mar. 9: The latest on COVID-19, the new Ontario Liberal leader and a probably plan to ban conversion therapy.Welcome to a sneak peek of the Macleans Politics Insider newsletter. Sign up to get it delivered straight to your inbox.The big… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Anjela Salyer Named to Professional Builder's 40 Under 40 Class of 2020","Description":"Professional Builder magazine unveiled its annual 2020 40 Under 40 list of rising stars in the home building industry and Anjela Salyer, Vice President Division Manager for the Tucson Division is among the honorees profiled in the March 2020 issue.","Published_Date":"2020-03-09","Content":"Vice President and Division Manager for Mattamy Tucson named to prestigious list of leaders by Professional BuilderTUCSON, AZ, March 9, 2020\/PRNewswire\/ - Professional Builder magazine unveiled its annual 2020 40 Under 40 list of rising stars in the home bu… "}
{"Source_Name":"People.com","Author":"Conchita Margaret Widjojo","Title":"How Meghan Markle Spent Her Last Day as a Working Royal in the U.K.","Description":"Meghan Markle made the most of her last day as a senior working royal in the U.K. Before attending the Commonwealth Service on Monday with her husband Prince Harry, the Duchess of Sussex attended a meeting at Buckingham Palace with the Association of Commonwe…","Published_Date":"2020-03-11","Content":"Meghan Markle made the most of her last day as a senior working royal in the U.K.Before attending the Commonwealth Service on Monday with her husband Prince Harry, the Duchess of Sussex attended a meeting at Buckingham Palace with the Association of Commonw… "}
{"Source_Name":"Decanter.com","Author":"Natalie Earl","Title":"DWWA judge profile: Bree Stock MW","Description":"Bree Stock is a judge at the 2020 Decanter World Wine Awards (DWWA) Bree Stock MW, DWWA Judge Bree Stock MW Bree is Australian-born with nearly two decades of international experience in the wine industry in Canada, the US and Australia. Her wine career began…","Published_Date":"2020-03-05","Content":"Bree Stock is a judge at the 2020 Decanter World Wine Awards (DWWA)Bree is Australian-born with nearly two decades of international experience in the wine industry in Canada, the US and Australia. Her wine career began in Canada with sommelier and buying ro… "}
{"Source_Name":"Qz.com","Author":"Jenny Anderson","Title":"Coronavirus didn’t stop this Hong Kong school from hosting a virtual sports day","Description":"Teachers at Hong Kong Academy are having to get creative.","Published_Date":"2020-03-08","Content":"The livestream starts with the familiar blare of dramatic music and a burst of colors on screen, similar to the opening frames on ESPN or SkySports. Behind a desk sit two men, one a sports coach in a suit, the other a teacher dressed in athletic attire. Both … "}
{"Source_Name":"Bostonglobe.com","Author":"Caroline Enos","Title":"Mount Washington Observatory records highest wind speed of the season","Description":"Tom Padham, a weather observer and education specialist at the observatory, said gusts peaked at 133 mphCQ around 9 a.m. Wednesday. A video posted to Twitter showed one of the observatory’s interns tumbling to the ground as the winds pushed against her.","Published_Date":"2020-03-05","Content":"As winds tore down wires and damaged property in parts of southern New England Wednesday, researchers at the Mount Washington Observatory in New Hampshire recorded the highest wind speed to whip against the mountain so far this winter. Tom Padham, a weather… "}
{"Source_Name":"Qz.com","Author":"Olivia Goldhill","Title":"Psychedelic therapy is on the cusp of legalization—and plagued with sexual abuse allegations","Description":"A participant in a clinical trial on MDMA therapy accused her unlicensed therapist of sexual assault. Was it a one-off event or an institutional failing?","Published_Date":"2020-03-03","Content":"Over the past five years, scientific interest in psychedelics has boomed, with clinical trials on MDMA leading the way. Now the drug is on the cusp of becoming legal medicine. Early results testing MDMA combined with talk therapy as treatment for post-traumat… "}
{"Source_Name":"Al Jazeera English","Author":"Alasdair Fotheringham","Title":"Brexit-voting ex-pats in Spain wake up to a future of change","Description":"The penny is dropping - change is on its way for Brexit-voting 'Brits abroad'.","Published_Date":"2020-03-05","Content":"Madrid, Spain - It's been a fraught start to negotiations between the European Union and the United Kingdom as talks on their post-Brexit trade deal kicked off this week. Deep-rooted differences over fishing rights have again emerged as a potential major st… "}
{"Source_Name":"Thestar.com","Author":"Robert Benzie - Queen's Park Bureau Chief","Title":"Delegates of Ontario Liberals to choose a new leader","Description":"Follow the Star’s live coverage of the Ontario Liberal leadership election","Published_Date":"2020-03-07","Content":"10:06 a.m. — Former education minister and Scarborough-Guildwood MPP Mitzie Hunter — one of two leadership candidates with a seat in the legislature — took the stage after a children’s choir from her riding performed two songs.Saying Liberals have “punched … "}
{"Source_Name":"Firstpost.com","Author":"Sammitha Sreevathsa","Title":"With its emphasis on training rather than education, ‘learning’ in classical dance requires an urgent and critical rethink","Description":"Learning in classical dance is conceptualised more as training than an education. A student is taught to effectively embody an aesthetic through physical training, with little reflection on what it means to do so historically, socially or politically. The pos…","Published_Date":"2020-03-05","Content":"With an interest in generating accessible writings that makes the connection between the larger social and political landscape of the country and its performing arts more evident, this monthly column is an attempt to un-bracket the dance discourse from its co… "}
{"Source_Name":"Dailyhive.com","Author":"Clarrie Feinstein","Title":"8 women in Toronto making big moves in the tech scene | Venture - Daily Hive","Description":"8 women in Toronto making big moves in the tech scene | Venture Daily Hive","Published_Date":"2020-03-03","Content":"There is general awareness in the tech industry that companies need to improve gender equality and parity in the workplace.According to SAP Canada, a software company, studies show that an increasing number of women in Canada feel the negative reputation of… "}
{"Source_Name":"Theconversation.com","Author":"Shannon D. M. Moore, Assistant professor of social studies education, Department of Curriculum Teaching and Learning, Faculty of Education, University of Manitoba, Melanie D. Janzen, Associate professor, Faculty of Education, University of Manitoba","Title":"A largely female teaching force is standing up for public education","Description":"Neoliberal governments are getting away with cutting public funding to education —  by framing education as women's work that needs a strong managerial hand.","Published_Date":"2020-03-03","Content":"Striking school teachers protest outside a speech by Ontario Education Minister Stephen Lecce in Toronto on Feb. 12, 2020. THE CANADIAN PRESS\/Frank Gunn Across Canada, issues related to education are regularly making headlines. Ontario teachers have been on r… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Physical Identity and Access Management Market Worth $1,535 Million by 2025 - Exclusive Report by MarketsandMarkets™","Description":"According to the new market research report \"Physical Identity and Access Management Market by Component, Service, Organization Size, Vertical (BFSI, IT and ITeS, Telecom, Energy and Utilities, Transportation, Healthcare, Government and Defense, and Education…","Published_Date":"2020-03-10","Content":"CHICAGO, March 10, 2020 \/PRNewswire\/ -- According to the new market research report \"Physical Identity and Access Management Market by Component, Service, Organization Size, Vertical (BFSI, IT and ITeS, Telecom, Energy and Utilities, Transportation, Healthcar… "}
{"Source_Name":"Rawstory.com","Author":"The Conversation","Title":"Why so few young Americans vote","Description":"The United States has one of the lowest rates of youth voter turnout in the world. The gap between 18- to 29-year-olds and those over 60, a common measuring stick, is more than twice as large here than it is in comparable democracies, like Canada and Germany.…","Published_Date":"2020-03-11","Content":"The United States has one of the lowest rates of youth voter turnout in the world. The gap between 18- to 29-year-olds and those over 60, a common measuring stick, is more than twice as large here than it is in comparable democracies, like Canada and Germany.… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Employment Screening Services Market to Reach $7.64 Bn, Globally, by 2026 at 8.3% CAGR: Allied Market Research","Description":"Allied Market Research published a report, titled, \"Employment Screening Services Market by Service (Criminal Background Checks, Education & Employment Verification, Credit History Checks, Drug & Health Screening, and Others), and Application (Banking & Finan…","Published_Date":"2020-03-10","Content":"Rise in focus on improved quality of workforce, better regulatory compliance, and numerous advantages offered by employment screening services fuel the growth of the global employment screening services marketPORTLAND, Oregon, March 10, 2020 \/PRNewswire\/ --… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Global Digital Pathology Market to Reach $1.39 Billion by 2026: AMR","Description":"Allied Market Research published a report, titled, \"Digital Pathology Market by Product (Scanners, Software, and Storage & Communication Systems), Application (Teleconsultation, Disease Diagnosis, Drug Discovery, and Training & Education), and End User (Educa…","Published_Date":"2020-03-09","Content":"Surge in demand for disease diagnosis, ease provided in consultation, and digitalization in the medical industry are factors that drive the growth of the global pathology marketPORTLAND, Oregon, March 9, 2020 \/PRNewswire\/ -- Allied Market Research published… "}
{"Source_Name":"Bostonherald.com","Author":"Associated Press","Title":"The Latest: Air Canada suspends flights to and from Italy","Description":"The Latest on the coronavirus outbreak sweeping the globe (all times local):","Published_Date":"2020-03-10","Content":"By The Associated PressThe Latest on the coronavirus outbreak sweeping the globe (all times local):Air Canada is suspending flights to and from Italy.The airline’s last flight to Rome is scheduled to take off from Toronto on Tuesday, with the final retu… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Hub International Acquires Ontario-Based LSM Insurance Services","Description":"Hub International Limited (Hub), a leading global insurance brokerage, announced today that it has acquired LSM Insurance Services Ltd. (LSM). Terms of the transaction were not disclosed.","Published_Date":"2020-03-05","Content":"CHICAGO, March 5, 2020 \/PRNewswire\/ -- Hub International Limited (Hub), a leading global insurance brokerage, announced today that it has acquired LSM Insurance Services Ltd. (LSM). Terms of the transaction were not disclosed.Hub International Logo (PRNew… "}
{"Source_Name":"Indianexpress.com","Author":"Express Web Desk","Title":"Coronavirus update March 11: Another patient tests positive in Jaipur, 62 positive cases in India","Description":"Coronavirus update March 11: According to state health authorities, the number of cases in India is 61. Across the globe, over 4,000 deaths due to the virus have been reported.","Published_Date":"2020-03-11","Content":"The number of cases in the country jumped after positive cases were reported from Karnataka, Kerala, and Maharashtra (Express photo\/Tashi Tobgyal)Another positive case was confirmed in Rajasthan Wednesday, taking the total number of infections reported in the… "}
{"Source_Name":"Fool.com","Author":"newsfeedback@fool.com (Neha Chamaria)","Title":"3 Great Stocks That Could Help You Send Your Kids to College","Description":"Three stalwarts in three incredible industries with massive potential: Look no further than these stocks to build a fund for your child's college.","Published_Date":"2020-03-02","Content":"Statistics reveal that the total student debt in the U.S. has ballooned to a staggering $1.5 trillion. That means among all of the financial goals you might set and works toward today to secure your future, building a fund for your children's college is of pa… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"PCG Strengthens Technology Consulting Practice","Description":"BOSTON--(BUSINESS WIRE)-- #informationtechnology--Public Consulting Group, Inc. (PCG) is moving to strengthen and grow its Technology Consulting practice in the mid-Atlantic and southeastern U.S., naming long-time project management expert Sylvia H. Mitchem a…","Published_Date":"2020-03-11","Content":"BOSTON--(BUSINESS WIRE)--Public Consulting Group, Inc. (PCG) is moving to strengthen and grow its Technology Consulting practice in the mid-Atlantic and southeastern U.S., naming long-time project management expert Sylvia H. Mitchem as a Director for the grou… "}
{"Source_Name":"Theconversation.com","Author":"Howard Ramos, Professor of Sociology, Dalhousie University, Emma Kay, PhD Student, Department of Sociology and Social Anthropology, Dalhousie University","Title":"Affordable housing: It's not just a big city problem anymore","Description":"In Atlantic Canada, leaders must avoid the mistakes made in the country’s largest cities where people are being pushed out due to high housing prices.","Published_Date":"2020-03-04","Content":"People in Atlantic Canada cities, including Charlottetown, are nervous about rising house prices as young people return and immigration fuels economic growth. (Shutterstock) Awareness of affordability issues and the crunch to find suitable housing has made na… "}
{"Source_Name":"Seekingalpha.com","Author":"Capital Ideas","Title":"Graham Holdings Moves Back Into Buy Territory","Description":"Along with much of the stock market, shares of Graham Holdings are currently well off their highs.The company has compiled an impressive collection of businesses with good economics in broadcasting, education, manufacturing, and health care among others.The m…","Published_Date":"2020-03-09","Content":"This article was highlighted for PRO subscribers, Seeking Alpha's service for professional investors. Find out how you can get the best content on Seeking Alpha here.After reaching nearly $750 per share this past summer, Graham Holdings (GHC) has found itse… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"VCA Second Annual Impact Report Continues Legacy Of Animal Care","Description":"VCA, a leading provider of pet health care services delivered through over 1,000 veterinary hospitals in the U.S., Canada, and Japan, has released its second-ever impact report highlighting its progressive initiatives towards the animal health industry over t…","Published_Date":"2020-03-10","Content":"Report shows that VCA makes positive impact through giving, leading and innovatingLOS ANGELES, March 10, 2020 \/PRNewswire\/ -- VCA, a leading provider of pet health care services delivered through over 1,000 veterinary hospitals in the U.S., Canada, and Japa… "}
{"Source_Name":"Stamfordadvocate.com","Author":"Paul Schott","Title":"Tech-repair chain uBreakiFix opens Stamford store - The Advocate","Description":"Technology-repair chain uBreakiFix has opened a store in the Bull's Head section of the city, further expanding the fast-growing company's presence in southwestern Connecticut.","Published_Date":"2020-03-06","Content":"<ul>From left, UBreakiFix Stamford store owners Steven Gardner and Chris Laraia and Stamford Mayor David Martin attend a grand opening at the store at 123 High Ridge Road on Thursday, March 5, 2020.From left, UBreakiFix Stamford store owners Steven Gard… "}
{"Source_Name":"Buffalonews.com","Author":null,"Title":"Business travel is grounded by coronavirus outbreak - Buffalo News","Description":"Business travel is taking a hit from the coronavirus outbreak. Companies are clamping down on employees taking business trips. A growing ...","Published_Date":"2020-03-07","Content":"Business travel is taking a hit from the coronavirus outbreak.Companies are clamping down on employees taking business trips. A growing number of trade shows and conferences are getting canceled or postponed amid health concerns about mass gatherings of peo… "}
{"Source_Name":"Al Jazeera English","Author":"Emily Fishbein","Title":"â€˜Stuckâ€™: Hope fades for refugees in Malaysia as US closes door","Description":"The US has slashed the number of refugees it now accepts for resettlement and many are left with nowhere to go.","Published_Date":"2020-03-08","Content":"Kuala Lumpur, Malaysia - In December, Saw Kaw Lar received an unexpected call. \"Your case for going to America was withdrawn,\" the refugee from Myanmars Karen minority recalled hearing. \"If there are other countries for you, we will tell you.\" In an insta… "}
{"Source_Name":"Snopes.com","Author":"Alex Kasprak","Title":"Did an Infectious Disease Specialist Write ‘I Am Not Scared of COVID-19’?","Description":"Readers inquired about a viral Facebook post amid an outbreak of the new coronavirus in 2020.","Published_Date":"2020-03-09","Content":"On March 6, 2020, a Facebook post by Dr. Abdu Sharkawy, internal medicine and infectious diseases consultant with Torontos University Health Network and an assistant professor at University of Toronto, went viral, garnering over 1.3 million shares at the time… "}
{"Source_Name":"People.com","Author":"Claudia Harmata","Title":"Meghan Markle Opens Up About How She's Celebrating International Women's Day in the U.K.","Description":"Meghan Markle is opening up about celebrating International Women’s day in the United Kingdom. The Duchess of Sussex, who is back in the U.K. for a final round of royal engagements, visited the Robert Clack Upper School in the town of Dagenham in east London …","Published_Date":"2020-03-08","Content":"Meghan Markle is opening up about celebrating International Women’s day in the United Kingdom.The Duchess of Sussex, who is back in the U.K. for a final round of royal engagements, visited the Robert Clack Upper School in the town of Dagenham in east London… "}
{"Source_Name":"The Times of India","Author":"ET CONTRIBUTORS","Title":"Modi govt may be having a problem of plenty","Description":"Modi govt may be having a problem of plentyThe central government in India has far too many ministries. In early 2018, India had 53 ministries.","Published_Date":"2020-03-11","Content":"By Arvind PanagariyaChoosing the right policies, programmes and projects is only half of the story. The precise translation of broad policies into concrete laws, rules and regulations, and the effective delivery of programmes and projects depends on the imple… "}
{"Source_Name":"Ascd.org","Author":"ASCD Guest Blogger","Title":"Coronavirus and the importance of an “All Hazards” approach to school safety planning","Description":"Amy Klinger (@DrAmyKlinger) is a nationally recognized expert on school safety and crisis management. She is cofounder, along with her daughter Amanda Klinger, of the Educator’s School Safety Network, which provides training, resources, and technical assistan…","Published_Date":"2020-03-11","Content":"Amy Klinger (@DrAmyKlinger) is a nationally recognized expert on school safety and crisis management. She is cofounder, along with her daughter Amanda Klinger, of the Educator’s School Safety Network, which provides training, resources, and technical assistan… "}
{"Source_Name":"CBC News","Author":"Kate Kyle,Tara Carman","Title":"The long journey to safety: Northern women travel farthest to access domestic violence shelters","Description":"Rates of intimate partner violence in the North are among the highest in the country, and yet there are only 14 shelters total across all three territories.","Published_Date":"2020-03-05","Content":"This story is part of Stopping Domestic Violence, a CBC News series looking at the crisis of intimate partner violence in Canada and what can be done to end it.It was the first and only time Ann Kasook attempted to run away.She still feels shaken when she… "}
{"Source_Name":"Sputniknews.com","Author":null,"Title":"Conservative MPs Set to Rebel Against Boris Johnson Over Huawei Having Its Fingers in UK’s 5G Pie","Description":"The United States has been putting pressure on its allies - the UK and Canada - not to allow Huawei to take part in the construction of their 5G phone networks. The British government approved Huawei’s involvement in January but capped its share at 35 percent.","Published_Date":"2020-03-10","Content":"The United States has been putting pressure on its allies - the UK and Canada - not to allow Huawei to take part in the construction of their 5G phone networks. The British government approved Huaweis involvement in January but capped its share at 35 percent.… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"MTFX Group Launches PayMyMedicalCare, Expanding Its Innovative International Payments Platform Into Healthcare","Description":"MTFX Group, a leader in corporate foreign exchange and global payments, today announced its launch of PayMyMedicalCare (PMMC), a new industry vertical within the MTFX Group's set of solutions, enabling the company to expand its footprint into international he…","Published_Date":"2020-03-03","Content":"MTFX Group announced today the launch of PayMyMedicalCare (PMMC), a new vertical within the company, expanding its innovative cross-border payments technology into healthcare for the first time across North AmericaTORONTO and JERSEY CITY, N.J., March 3, 202… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"“Say Cheese!” Snap a Photo and Help Reliant Support Rodeo Scholarships","Description":"HOUSTON--(BUSINESS WIRE)-- #RODEOHOUSTON--It’s officially rodeo season in Houston and Reliant is encouraging smiles, snaps and selfies at the Houston Livestock Show and RodeoTM to support scholarships for Texas youth. As a longtime Heritage Partner, Reliant’s…","Published_Date":"2020-03-03","Content":"HOUSTON--(BUSINESS WIRE)--Its officially rodeo season in Houston and Reliant is encouraging smiles, snaps and selfies at the Houston Livestock Show and RodeoTM to support scholarships for Texas youth. As a longtime Heritage Partner, Reliants new interactive p… "}
{"Source_Name":"Patheos.com","Author":"Val Wilde","Title":"Christian College “Exploited and Controlled” Teen Students, Rules Ontario Judge","Description":"One mental health expert said the school had \"characteristics of a destructive cult.\"","Published_Date":"2020-03-05","Content":"Former students at a now-shuttered private boarding school in Eastern Ontario have won a class-action lawsuit against the administration that abused them over the course of decades.Ontario Superior Court Justice Janet Leiper said the school’s practices crea… "}
{"Source_Name":"Blogto.com","Author":"Mira Miller","Title":"Centennial College in Toronto unveils plan for new building and it's breathtaking","Description":"Centennial College is expanding their Progress Campus in Scarborough, and new renderings of the project reveal a beautiful design that honours the college’s commitment to Truth and Reconciliation. The school held a design competition for its A-Block expansion…","Published_Date":"2020-03-06","Content":"Centennial College is expanding their Progress Campus in Scarborough, and new renderings of the project reveal a beautiful design that honours the colleges commitment to Truth and Reconciliation.The school held a design competition for its A-Block expansion… "}
{"Source_Name":"Rawstory.com","Author":"The Conversation","Title":"How I ended up in conversion therapy — and why it should be criminalized","Description":"The Trudeau government introduced legislation this week to amend the Criminal Code to ban conversion therapy, a controversial practice that aims to change the sexual orientation, gender identity or expression of LGBTQ+ people. The move marks the first concret…","Published_Date":"2020-03-11","Content":"The Trudeau government introduced legislation this week to amend the Criminal Code to ban conversion therapy, a controversial practice that aims to change the sexual orientation, gender identity or expression of LGBTQ+ people.The move marks the first concre… "}
{"Source_Name":"Outsideonline.com","Author":"Graham Averill","Title":"Will Gadd Can't Name His Favorite Sport—and That's OK","Description":"The ice climber, kayaker, and paraglider continues to explore uncharted territories into his fifties","Published_Date":"2020-03-06","Content":"Will Gadd is stoked to visit North Carolina. The 52-year-old world-class ice climber travels all over the globe to send the tallest, gnarliest frozen lines imaginable—and sure, North Carolina is not typically considered one of those destinations, but Gadd doe… "}
{"Source_Name":"USA Today","Author":"USA TODAY, From USA TODAY Network and wire reports, USA TODAY","Title":"Golden Gate bison, prisoner paintings, dining with dogs: News from around our 50 states","Description":"Florida lawmakers worry about 'phony baloney' support animals, wine named for official with drunken driving arrest in North Dakota, and more","Published_Date":"2020-03-05","Content":"AlabamaAlabama is slated to kill Nathaniel Woods via lethal injection on Thursday, March 5. (Photo: Alabama Department of Corrections)Mobile: The son of civil rights leader Martin Luther King Jr., as well as family members of a condemned inmate, is aski… "}
{"Source_Name":"Nysenewstimes.com","Author":null,"Title":"IoT In Education Market Research Technology Outlook 2019-2025 - News Times","Description":"IoT In Education Market Research Technology Outlook 2019-2025 News Times","Published_Date":"2020-03-09","Content":"IoT In EducationThe IoT In Education Market recently Published Global Market research study with more than 100 industry informative desk and Figures spread through Pages and easy to understand detailed TOC on “IoT In Education Market” The report provides in… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"Tyler Technologies Named an Atlanta Top Workplace for 2020","Description":"DULUTH, Ga.--(BUSINESS WIRE)---- $TYL #tylertech--Tyler Technologies was named an Atlanta top workplace for 2020 by The Atlanta Journal-Constitution.","Published_Date":"2020-03-05","Content":"DULUTH, Ga.--(BUSINESS WIRE)--Tyler Technologies, Inc. (NYSE: TYL) announced today that it has been awarded a Top Workplaces 2020 award by The Atlanta Journal-Constitution. This is Tylers first time to be recognized on this list. With nearly 200 employees, th… "}
{"Source_Name":"Moneycontrol.com","Author":null,"Title":"89% educated Indian women believe ambitions are important: Survey","Description":"Women in India have always been driven, and the report attests that given a chance they have the confidence to nurture their ambitions and lead the world by setting an example.","Published_Date":"2020-03-03","Content":"As much as 89 per cent working women believe that it is important to have ambitions compared to the global average of 59 per cent, according to a study. Indian women led the findings on the importance of having ambition (89 per cent) followed by Mexico (82 pe… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"The Kids Are Back! Amazon Prime Video to Bring Back The Kids in the Hall With New Episodes as First Canadian Amazon Original Series","Description":"TORONTO--(BUSINESS WIRE)--(Nasdaq:AMZN) – Amazon today announced that the critically-acclaimed sketch comedy series, The Kids in the Hall, will be making a comeback on Prime Video. With the return of all of the original “Kids,” the 8-episode Amazon Original s…","Published_Date":"2020-03-05","Content":"TORONTO--(BUSINESS WIRE)--(Nasdaq:AMZN) Amazon today announced that the critically-acclaimed sketch comedy series, The Kids in the Hall, will be making a comeback on Prime Video. With the return of all of the original Kids, the 8-episode Amazon Original serie… "}
{"Source_Name":"Bostonherald.com","Author":"Associated Press","Title":"The Latest: Canada records its 1st death from new virus","Description":"ROME (AP) — The Latest on the coronavirus epidemic sweeping the globe (all times local):","Published_Date":"2020-03-09","Content":"ROME (AP) — The Latest on the coronavirus epidemic sweeping the globe (all times local):7:50 p.m.Canadian health officials say a man has died of the new virus at a seniors care home in North Vancouver in what is believed to be the first COVID-19 death in … "}
{"Source_Name":"Insidehighered.com","Author":"Joshua Kim","Title":"The 2020 EDUCAUSE Horizon Report Teaching and Learning Edition","Description":"Blog: Learning Innovation The 2020 Horizon Report: Teaching and Learning Edition, is noteworthy given how much the publication has improved in comparison to previous efforts. The team that EDUCAUSE gathered to create the Horizon Report has pulled off a diffic…","Published_Date":"2020-03-04","Content":"The 2020 Horizon Report: Teaching and Learning Edition, is noteworthy given how much the publication has improved in comparison to previous efforts.The team that EDUCAUSE gathered to create the Horizon Report has pulled off a difficult trick. They built on … "}
{"Source_Name":"Eurekalert.org","Author":null,"Title":"A PLOS Medicine special issue devoted to refugee and migrant health","Description":"This week, the open-access journal PLOS Medicine launches its latest special issue, focused on research and commentary about the health of refugees and migrants.","Published_Date":"2020-03-03","Content":"This week, the open-access journal PLOS Medicine launches its latest Special Issue, focused on research and commentary about the health of refugees and migrants. As discussed in a recent Editorial in the journal, in recent years there has been a large incre… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Mohegan Gaming & Entertainment (MGE) Appoints Mark Rosa as Senior Vice President and Chief Information Officer","Description":"Mohegan Gaming & Entertainment (MGE), a master developer of awe-inspiring integrated entertainment resorts (IER) worldwide, today announces the newest member of its executive leadership team with a strategic promotion to further sustain and enhance the brand'…","Published_Date":"2020-03-04","Content":"New CIO to further support U.S. innovation and international growth plans for MGE integrated resort propertiesUNCASVILLE, Conn., March 4, 2020 \/PRNewswire\/ -- Mohegan Gaming &amp; Entertainment (MGE), a master developer of awe-inspiring integrated entertain… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Wendy's Honors 11 Company Employees for Community Engagement Efforts","Description":"Today, The Wendy's Company named 11 employees Community Ambassadors for their commitment to supporting and bettering their local communities through volunteerism. Through Wendy's Community Ambassador Grant Program, each individual will receive a $2,500 grant …","Published_Date":"2020-03-10","Content":"Jonathan Todd named Community Ambassador of the Year for supporting Dreams on HorsebackDUBLIN, Ohio, March 10, 2020 \/PRNewswire\/ -- Today, The Wendy's Company named 11 employees Community Ambassadors for their commitment to supporting and bettering their lo… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Mohegan Gaming & Entertainment (MGE) Appoints Mark Rosa as Senior Vice President and Chief Information Officer","Description":"Mohegan Gaming & Entertainment (MGE), a master developer of awe-inspiring integrated entertainment resorts (IER) worldwide, today announces the newest member of its executive leadership team with a strategic promotion to further sustain and enhance the brand'…","Published_Date":"2020-03-04","Content":"New CIO to further support U.S. innovation and international growth plans for MGE integrated resort propertiesUNCASVILLE, Connecticut, March 5, 2020 \/PRNewswire\/ -- Mohegan Gaming &amp; Entertainment (MGE), a master developer of awe-inspiring integrated ent… "}
{"Source_Name":"Dailymail.co.uk","Author":"By Mark Duell for MailOnline","Title":"What happens after Megxit? Q&A Prince Harry and Meghan's life after they step down as senior royals","Description":"'Megxit Day' on March 31 is the day Prince Harry and Meghan Markle cease to be senior royals as they walk away from the British royal family. Here's all you need to know.","Published_Date":"2020-03-09","Content":"Prince Harry and Meghan Markle's decision to step down as working royals sent shock waves around the world. But what will actually happen after 'Megxit'? Here MailOnline answers your questions on how things will change for the couple on March 31.  What wi… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"PCG Leads School Violence Threat Assessment Panel at SXSW EDU March 9","Description":"AUSTIN, Texas--(BUSINESS WIRE)-- #PCGatSXSW--Following a spate of tragic, deadly U.S. school shootings, what are today’s best practices for school administrators to identify students at highest risk for violence and provide monitoring and intervention? “Behav…","Published_Date":"2020-03-05","Content":"AUSTIN, Texas--(BUSINESS WIRE)--Following a spate of tragic, deadly U.S. school shootings, what are todays best practices for school administrators to identify students at highest risk for violence and provide monitoring and intervention?Behavioral Threat A… "}
{"Source_Name":"Usmagazine.com","Author":"Dory Jackson","Title":"How Meghan Markle Closed Out Her Final Royal Engagement","Description":"The end of an era. Meghan Markle’s life as a royal has officially changed course after concluding her final engagement under her senior position — and she gave an inside look at this momentous occasion before putting this chapter behind her. In a new Harper’s…","Published_Date":"2020-03-11","Content":"The end of an era. Meghan Markles life as a royal has officially changed course after concluding her final engagement under her senior position and she gave an inside look at this momentous occasion before putting this chapter behind her.Stars React to Prin… "}
{"Source_Name":"Welivesecurity.com","Author":"Gabrielle Ladouceur Despins","Title":"Fraud Prevention Month: How to protect yourself from scams","Description":"ESET Chief Security Evangelist Tony Anscombe sat down with us to share his insights on how to avoid falling prey to online fraud The post Fraud Prevention Month: How to protect yourself from scams appeared first on WeLiveSecurity","Published_Date":"2020-03-04","Content":"ESET Chief Security Evangelist Tony Anscombe sat down with us to share his insights on how to avoid falling prey to online fraudAre you aware of some of the most common tactics that con artists can use to steal your data, identity and money? The digital era… "}
{"Source_Name":"Financial Post","Author":"Kevin Carmichael","Title":"Bank of Canada’s hand likely forced by Federal Reserve’s emergency rate cut","Description":"Kevin Carmichael: If the G7's game plan is coordinated stimulus, then the Bank of Canada is up next","Published_Date":"2020-03-03","Content":"COVID-19 has the world’s central banks back in crisis mode.Jerome Powell, chair of the U.S. Federal Reserve, watched stocks drop for less than half an hour at the start of trading on March 3 before pulling the trigger on an emergency interest-rate cut of ha… "}