{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Ont. hospital to set up special COVID-19 clinic to ease busy emergency rooms - CTV News","Description":"As hospitals and health care facilities across Canada prepare to handle the spread of coronavirus seen around the world, some doctors are worried about a potential flood of patients hitting emergency rooms.","Published_Date":"2020-03-05","Content":"TORONTO -- As hospitals and health care facilities across Canada prepare to handle the spread of coronavirus seen around the world, some doctors are worried about a potential flood of patients hitting emergency rooms.Dr. Jeff Powis, the medical director o… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Sustainability goes mainstream for business education - The Globe and Mail","Description":"More business schools are embedding sustainability themes into courses and research","Published_Date":"2020-03-10","Content":"David Dunne, director of MBA Programs at the University of Victorias Gustavson School of Business, speaks to students in a classroom on campus.University of Victoria photo servicesUntil recently, Canadian business schools typically covered climate change,… "}
{"Source_Name":"Acs.org","Author":"nobody@acs.org(\"Linda Wang\"), Linda Wang","Title":"Scientists' favorite DIY lab equipment, and making lab trash live on","Description":"","Published_Date":"2020-03-07","Content":"Sharing science hacksMany scientists will go out of their way to save a few bucks, especially when it comes to improvising with makeshift lab equipment. So when Jacquelyn Gill, an associate professor of paleoecology and plant ecology at the University of Ma… "}
{"Source_Name":"Eurekalert.org","Author":null,"Title":"A PLOS Medicine special issue devoted to refugee and migrant health","Description":"This week, the open-access journal PLOS Medicine launches its latest special issue, focused on research and commentary about the health of refugees and migrants.","Published_Date":"2020-03-03","Content":"This week, the open-access journal PLOS Medicine launches its latest Special Issue, focused on research and commentary about the health of refugees and migrants. As discussed in a recent Editorial in the journal, in recent years there has been a large incre… "}
{"Source_Name":"CBC News","Author":"Alex Cooke","Title":"Dalhousie researchers get $1.9M to study coronavirus","Description":"Three researchers at Dalhousie University are getting federal funding to research different aspects of the novel coronavirus.","Published_Date":"2020-03-09","Content":"Three researchers at Dalhousie University in Halifax have been awarded a total of $1.9 million to help research the coronavirus and its wider societal impacts.The research areas include developing a device to gauge the severity of the illness, examining the… "}
{"Source_Name":"CBC News","Author":"Adam Stanley","Title":"Carleton claims 15th U Sports men's basketball title with victory over Dalhousie","Description":"The Carleton Ravens are once again the Canadian university men's basketball champions.","Published_Date":"2020-03-09","Content":"The Carleton Ravens are once again the Canadian university men's basketball champions.The No. 1 Ravens defeated the No. 2 Dalhousie Tigers 74-65 in Ottawa on Sunday night to win their second straight U Sports men's national title.Carleton has won nine of … "}
{"Source_Name":"Yahoo.com","Author":"The Canadian Press","Title":"Ottawa Gee-Gees hope to take advantage of home court at nationals","Description":"OTTAWA — Even though the Ottawa Gee-Gees had a guaranteed spot in the national university men's basketball championship this season, coach James Derouin didn't change his approach.For the first time, the men's and women's national U Sports championships are b…","Published_Date":"2020-03-05","Content":"OTTAWA Even though the Ottawa Gee-Gees had a guaranteed spot in the national university men's basketball championship this season, coach James Derouin didn't change his approach.For the first time, the men's and women's national U Sports championships are b… "}
{"Source_Name":"Ctvnews.ca","Author":"Ryan Flanagan","Title":"How do I know if I have COVID-19? A guide to symptoms - CTV News","Description":"CTVNews.ca explains the common symptoms of COVID-19, how the disease spreads, and what anyone who fears they may have been infected should do.","Published_Date":"2020-03-02","Content":"TORONTO -- Last Monday, the head of Iran's counter-coronavirus task force told reporters that the country's COVID-19 situation was \"almost stable.\"One day later, he tested positive for the virus himself.While Iraj Harirchi's message may have been questi… "}
{"Source_Name":"CBC News","Author":"Franca G. Mignacca","Title":"These Quebec professors are trying to develop a coronavirus vaccine","Description":"Researchers at two Quebec universities are working together in hopes of developing a new vaccine that could prevent COVID-19 and similar outbreaks.","Published_Date":"2020-03-07","Content":"Researchers at two Quebec universities are working together in hopes of developing a new vaccine that could prevent COVID-19 and similar outbreaks. On Friday, the federal government announced it would be providing $27 million in grants to 47 Canadian resear… "}
{"Source_Name":"Eurekalert.org","Author":null,"Title":"VIDO-InterVac-led research team at USask awarded almost $1M to fight new coronavirus","Description":"( University of Saskatchewan ) A University of Saskatchewan research team and collaborating scientists from across Canada have been awarded almost $1 million over two years to develop animal models and test vaccine candidates for effectiveness and safety agai…","Published_Date":"2020-03-06","Content":"IMAGE: Darryl Falzarano at VIDO-InterVac view more Credit: Debra MarshallA University of Saskatchewan research team and collaborating scientists from across the country have been awarded almost $1 million over two years to develop animal models and test… "}
{"Source_Name":"Dw.com","Author":"Deutsche Welle (www.dw.com)","Title":"Are cities Europe's new biodiversity hotspots?","Description":"While rummaging through part of Amsterdam's city park, citizen scientists discovered new insect species. Their aim was to show that even in Earth's busiest places, biodiversity is still underexplored.","Published_Date":"2020-03-04","Content":"Vondelpark, Amsterdam's public urban park in the southwest of the city, is anything but a remote place. Even on a weekday, it's full of people taking a stroll, playing soccer or chatting with friends on the neatly mowed grass.There are also countless people… "}
{"Source_Name":"Thestar.com","Author":null,"Title":"Carleton repeats as U Sports men's basketball champions with win over Dalhousie","Description":"The No. 1 Ravens defeated the No. 2 Dalhousie Tigers 74-65 in Ottawa on Sunday night to win their second straight U Sports men’s national title.","Published_Date":"2020-03-09","Content":"OTTAWA—The Carleton Ravens are once again the Canadian university men’s basketball champions.The No. 1 Ravens defeated the No. 2 Dalhousie Tigers 74-65 in Ottawa on Sunday night to win their second straight U Sports men’s national title.Carleton has won n… "}
{"Source_Name":"Tabletmag.com","Author":"David Zvi Kalman","Title":"Shul in the Time of Coronavirus","Description":"In the early 1990s, some forgotten soul on the internet coined the term “ meatspace ” to refer to the offline area that most of us think of as “the real world.” The term has always been only half a joke: It’s funny to think about the real world as secondary t…","Published_Date":"2020-03-11","Content":"In the early 1990s, some forgotten soul on the internet coined the term meatspace to refer to the offline area that most of us think of as the real world. The term has always been only half a joke: Its funny to think about the real world as secondary to cyber… "}
{"Source_Name":"CBC News","Author":"Jesse Campigotto","Title":"It's time for Canada's version of March Madness","Description":"They don’t have nearly the caché of the American ones, but Canada’s national university basketball championships still deliver some quality hoops. Here are some things to know about this year's U Sports Final 8 tournaments.","Published_Date":"2020-03-04","Content":"They don't have nearly the caché of the American ones, but Canada's national university basketball championships still deliver some quality hoops. And they tip off tomorrow. So here are some things to know about the U Sports Final 8 tournaments:For the firs… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"'He spoke very fondly of it': Son seeks traces of his father's years in Halifax","Description":"A Zimbabwe man is searching for sound recordings and photographs his late father may have left in Nova Scotia so that his own children can hear and see the grandfather they never knew.","Published_Date":"2020-03-02","Content":"A man from Zimbabwe is searching for sound recordings and photographs his late father might have left in Nova Scotia so that his own children can hear and see the grandfather they never knew.Munyaradzi Mufambisi's father, Eric, earned his master of educatio… "}
{"Source_Name":"Theconversation.com","Author":"Howard Ramos, Professor of Sociology, Dalhousie University, Emma Kay, PhD Student, Department of Sociology and Social Anthropology, Dalhousie University","Title":"Affordable housing: It's not just a big city problem anymore","Description":"In Atlantic Canada, leaders must avoid the mistakes made in the country’s largest cities where people are being pushed out due to high housing prices.","Published_Date":"2020-03-04","Content":"People in Atlantic Canada cities, including Charlottetown, are nervous about rising house prices as young people return and immigration fuels economic growth. (Shutterstock) Awareness of affordability issues and the crunch to find suitable housing has made na… "}
{"Source_Name":"Thestar.com","Author":"Adam Stanley - The Canadian Press","Title":"Ottawa Gee-Gees hope to take advantage of home court at nationals","Description":"The seventh-seeded Gee-Gees, the only club to beat top-ranked Carleton this season, face the No. 2 Dalhousie Tigers in one of four quarterfinals Thursday.","Published_Date":"2020-03-05","Content":"OTTAWA—Even though the Ottawa Gee-Gees had a guaranteed spot in the national university men’s basketball championship this season, coach James Derouin didn’t change his approach.For the first time, the men’s and women’s national U Sports championships are b… "}
{"Source_Name":"Thestar.com","Author":"Joan Bryden - The Canadian Press","Title":"Justice Minister David Lametti sows uncertainty over meaning of foreseeable death in assisted dying bill","Description":"Some experts say they became alarmed when Lametti, during opening debate on the bill last week, offered his view that reasonable foreseeability means a death that is expected “in the relatively near-term” or “over a relatively short period of time.”","Published_Date":"2020-03-03","Content":"OTTAWA—Dr. Ellen Wiebe has helped 260 intolerably suffering Canadians end their lives over the past four years, including a few who likely would have lived up to another decade on their own.The current federal law, passed in 2016, allows medical assistance … "}
{"Source_Name":"CBC News","Author":"Robyn Simon","Title":"Lost passport prevented N.S. student from visiting Wuhan just before coronavirus outbreak","Description":"Ziwa Yu was supposed to join her family in Wuhan, China, for Chinese New Year, but then Canada Post lost her passport. The loss has now created some complications for her.","Published_Date":"2020-03-11","Content":"A lost passport has turned into a blessing in disguise for a former Dalhousie University student from Wuhan, China.Ziwa Yu started her master's degree in nursing about two years ago in Halifax. She wanted to stay and work in the province after graduating la… "}
{"Source_Name":"Thewire.in","Author":null,"Title":"The Barbarity of False Equivalence - The Wire","Description":"The Barbarity of False Equivalence The Wire Harish Salve's arguments expose fault lines in 'unconstitutionality' of CAA; narrative against Act built... Firstpost Delhi riots: Violence that killed 53 in Indian capital ‘was anti-Muslim pogrom’, says top expert …","Published_Date":"2020-03-08","Content":"There could not be a more grisly method, even when it involves no violence, to cover up ghastly crimes committed by a people than to indulge in the fallacy of false equivalence. In this fallacy, two incomparable things are compared and declared to be equal be… "}
{"Source_Name":"Thestar.com","Author":"The Canadian Press","Title":"Nova Scotia holds two byelections as governing Liberals hold slim majority","Description":"The contests will be held in the ridings of Truro-Bible Hill-Millbrook-Salmon River and Cape Breton Centre, which includes the community of New Waterford and surrounding areas.","Published_Date":"2020-03-10","Content":"HALIFAX—Voters go to the polls Tuesday in a pair of Nova Scotia byelections as the governing Liberals try to build on their slim majority in the 51-seat legislature.The contests will be held in the ridings of Truro-Bible Hill-Millbrook-Salmon River and Cape… "}
{"Source_Name":"CBC News","Author":"Taryn Grant","Title":"Open race in Truro-area byelection to fill former NDP seat","Description":"Voters in Truro-Bible Hill-Millbrook-Salmon River will elect a new MLA Tuesday in the riding's first open race in a decade.","Published_Date":"2020-03-09","Content":"Voters in Truro-Bible Hill-Millbrook-Salmon River are set to choose a new MLA Tuesday, filling a seat that's been empty for the past six months.Lenore Zann took the seat for the NDP in 2009 and held it for two subsequent elections before departing for the f… "}
{"Source_Name":"Thestar.com","Author":"The Canadian Press","Title":"Ravens reach U sports men's basketball semifinal for 18th straight season","Description":"The No. 1 Ravens defeated the Dinos 82-66 on Friday to reach the semifinal stage of the tournament for an 18th straight season.","Published_Date":"2020-03-06","Content":"OTTAWA—Calgary Dinos head coach Dan Vanhooren knew exactly what his team needed to do to beat the Carleton Ravens in the U Sports men’s basketball championship quarterfinal.The only problem is that it was almost an unobtainable goal.“In truth, we would ha… "}
{"Source_Name":"Ottawacitizen.com","Author":"Christina Spencer, Ottawa Citizen","Title":"Charlebois: Coronavirus, Corona beer and risk-averse consumers","Description":"A recent survey suggested that 38 per cent of Americans are not drinking Corona beer due to the ongoing Covid-19 outbreak, formerly known as the coronavirus. There is obviously no link between the beer and the virus itself, but the survey suggests that a ment…","Published_Date":"2020-03-02","Content":"A recent survey suggested that 38 per cent of Americans are not drinking Corona beer due to the ongoing Covid-19 outbreak, formerly known as the coronavirus. There is obviously no link between the beer and the virus itself, but the survey suggests that a ment… "}
{"Source_Name":"Ottawacitizen.com","Author":"Paul Welch","Title":"Around the House: From Saskatchewan to Sunset Strip","Description":"At just 1,700 square feet, Matthew Rosenberg’s home may be one of the more modestly-sized properties in the affluent Hollywood Hills neighbourhood. But as with many small treasures, its restrained beauty shines through. The one-storey structure, built in 1961…","Published_Date":"2020-03-10","Content":"At just 1,700 square feet, Matthew Rosenberg’s home may be one of the more modestly-sized properties in the affluent Hollywood Hills neighbourhood. But as with many small treasures, its restrained beauty shines through.The one-storey structure, built in 196… "}
{"Source_Name":"Jagranjosh.com","Author":null,"Title":"SSC CHSL Previous Year Paper: 17th March 2018 Question Paper with Answer Key","Description":"SSC CHSL Previous Year Paper 17th March 2018 with Answer Key: Get the SSC CHSL 17 th March 2018 Question Paper with answers. Here you will get all the questions asked from four sections - General Awareness, Quantitative Aptitude, Reasoning & English Language.…","Published_Date":"2020-03-04","Content":"SSC CHSL Tier-1 2019-20 Exam will be conducted in online mode from 16th to 27th March 2020 across different Exam Centres. To score high marks, candidates must practice SSC CHSL Previous Year Papers. So for the ease of the candidates, we have provided the SSC … "}
{"Source_Name":"Utexas.edu","Author":"john","Title":"Applied Category Theory 2020","Description":"The big annual conference on applied category theory, ACT2020, is happening July 6--10 at MIT in Cambridge Massachusetts.","Published_Date":"2020-03-03","Content":"Here’s the big annual conference on applied category theory: ACT2020, 2020 July 6-10, MIT, Cambridge Massachusetts. Organized by Brendan Fong and David Spivak. This happens right after the applied category theory school, which will be held in the same locatio… "}
{"Source_Name":"Nationalpost.com","Author":"Laura Brehaut","Title":"Demand for meat rising despite deluge of plant-based alternatives, report finds","Description":"Meanwhile, plant-based alternatives account for just one per cent of all retail meat sales","Published_Date":"2020-03-10","Content":"Impossible Burgers at Disney Parks. Beyond Meat breakfast sandwiches at Starbucks. The proprietary Plantiful burger at Wendy’s. Another day, another plant-based product rollout, or so it would seem. Add the frequency of cattle rancher counterattacks targeting… "}
{"Source_Name":"CBC News","Author":null,"Title":"'There certainly still are barriers': Book to shine light on shortage of female MLAs in N.S. history","Description":"Two Dalhousie University students are bringing to light a shortage of female representation in Nova Scotia's Legislative Assembly with a new book, which explores the stories of the province's few female elected officials.","Published_Date":"2020-03-06","Content":"Two Dalhousie University students are shining a light on female representation, or the lack of it, in Nova Scotia's Legislative Assembly in a new book exploring the stories of women elected in the province's history.Only 50 of the 800 members in the legisla… "}
{"Source_Name":"Calgaryherald.com","Author":"Amanda Stephenson","Title":"Alberta farmers see another plant-based opportunity in oat milk","Description":"Retail sales of oat milk is soaring in the U.S., surpassing almond milk as the fastest-growing non-dairy alternative to milk","Published_Date":"2020-03-02","Content":"Jessica McCarrel clearly remembers the first time she made a latte with oat milk, the new non-dairy milk alternative currently taking North America by storm.“I got really excited,” says McCarrel, owner of Kaffeeklatsch, a mobile coffee catering company in C… "}
{"Source_Name":"Bhphotovideo.com","Author":"Jill Waterman","Title":"NASA Astronaut Kathryn Sullivan’s Pioneering Adventures in Space","Description":"Dr. Kathryn Sullivan has an elite status among groundbreaking American women. In January 1978, she was selected by NASA as part of the first astronaut class to include females. \"All six of us in that first batch of women felt a self-imposed pressure,\" Sulliva…","Published_Date":"2020-03-05","Content":"Dr. Kathryn Sullivan has an elite status among groundbreaking American women. In January 1978, she was selected by NASA as part of the first astronaut class to include females. \"All six of us in that first batch of women felt a self-imposed pressure,\" Sulliva… "}