{"Source_Name":"Sportsnet.ca","Author":"Gare Joyce","Title":"How the 1971 Stanley Cup defined (and obscured) Henri Richard’s legacy - Sportsnet.ca","Description":"How the 1971 Stanley Cup defined (and obscured) Henri Richard’s legacy Sportsnet.ca Henri Richard dead at 84 CBC News Montreal Canadiens great Henri Richard has died CTV News Remembering Canadiens Legend Henri Richard SPORTSNET From the Archives: Robbers left…","Published_Date":"2020-03-06","Content":"It might figure as only a line or two in his obituaries today, but Henri Richard was the centre of a controversy that ranks as probably the most misinterpreted in the long, storied history of the Montreal Canadiens.First and foremost, the obituaries will me… "}
{"Source_Name":"Canadianinquirer.net","Author":null,"Title":"BC declares COVID-19 outbreak at care home as vulnerable residents infected - Philippine Canadian Inquirer","Description":"BC declares COVID-19 outbreak at care home as vulnerable residents infected Philippine Canadian Inquirer View Full coverage on Google News","Published_Date":"2020-03-08","Content":"Chief provincial health officer Dr. Bonnie Henry said the two cases of COVID-19 follow an earlier diagnosis of a care worker at the Lynn Valley Care Centre, making them especially concerning as examples of community transmission. (File photo: Lynn Valley Care… "}
{"Source_Name":"Comoxvalleyrecord.com","Author":"The Canadian Press","Title":"Officials weigh COVID-19 infection control against risk of isolation at nursing homes - Comox Valley Record","Description":"Officials weigh COVID-19 infection control against risk of isolation at nursing homes Comox Valley Record","Published_Date":"2020-03-10","Content":"Public health officials are urging people take extra infection control steps around older Canadians most at risk of developing COVID-19 complications, with the death of a Vancouver senior providing fresh imperative for vigilance in long-term care facilities.… "}
{"Source_Name":"Globalnews.ca","Author":"Cassandra Szklarski","Title":"Coronavirus: B.C. senior’s death raises questions about isolation risk at nursing homes - Global News","Description":"Coronavirus: B.C. senior’s death raises questions about isolation risk at nursing homes Global News Appointments needed to access Nova Scotia COVID-19 assessment sites CBC.ca COVID-19 death prompts new control measures for Canada's seniors' homes CP24 Toronto…","Published_Date":"2020-03-10","Content":"Public health officials are urging people take extra infection control steps around older Canadians most at risk of developing COVID-19 complications, with the death of a Vancouver senior providing fresh imperative for vigilance in long-term care facilities.… "}
{"Source_Name":"Thenorthernview.com","Author":"The Canadian Press","Title":"Officials weigh COVID-19 infection control against risk of isolation at nursing homes - Prince Rupert Northern View","Description":"Officials weigh COVID-19 infection control against risk of isolation at nursing homes Prince Rupert Northern View","Published_Date":"2020-03-10","Content":"Public health officials are urging people take extra infection control steps around older Canadians most at risk of developing COVID-19 complications, with the death of a Vancouver senior providing fresh imperative for vigilance in long-term care facilities.… "}
{"Source_Name":"Torrentfreak.com","Author":"Andy","Title":"Man Who Leaked Pre-Release Movies Online Sentenced to 27 Months Prison","Description":"A UK man who leaked pre-release movies online has been sentenced to 27 months in prison after pleading to one count of conspiracy to defraud. Malik Luqman Farooq of Halifax was part of a group that obtained copies of movies from a post-production company in t…","Published_Date":"2020-03-09","Content":"While the vast majority of movies eventually appear online in pirated form, when they do so before their theatrical release dates there is always controversy.These exclusive release windows are aggressively protected by the studios and when people breach th… "}
{"Source_Name":"Deadline.com","Author":"Denise Petski","Title":"Emily Hampshire To Star In Epix Drama Based On Stephen King’s ‘Jerusalem’s Lot’","Description":"EXCLUSIVE: Schitt’s Creek‘s Emily Hampshire is set as the female lead opposite Adrien Brody in Chapelwaite, Epix’s previously untitled drama series based on Stephen King’s short story Jerusalem’s Lot. Chapelwaite is set to begin production in Halifax, Nova Sc…","Published_Date":"2020-03-03","Content":"EXCLUSIVE: Schitt’s Creek‘s Emily Hampshire is set as the female lead opposite Adrien Brody in Chapelwaite,Epix’s previously untitled drama series based on Stephen King’s short story Jerusalem’s Lot.Chapelwaite is set to begin production in Halifax, Nova Scot… "}
{"Source_Name":"BBC News","Author":"https:\/\/www.facebook.com\/bbcnews","Title":"Coronavirus: Halifax call centre at Belfast Gasworks closed","Description":"A Halifax call centre in Belfast Gasworks as been temporarily closed, says Lloyds Banking Group.","Published_Date":"2020-03-10","Content":"A Halifax call centre in Belfast Gasworks has been temporarily closed over coronavirus, Lloyds Banking Group has said.Lloyds said it will \"allow for the appropriate areas of the site to be cleaned, after a colleague based there was diagnosed with Covid-19\".… "}
{"Source_Name":"Mobilesyrup.com","Author":"Aisha Malik","Title":"Telus launches new mobile health clinic on wheels in Halifax","Description":"Telus has launched a new mobile health clinic on wheels in Halifax, Nova Scotia to provide healthcare to local citizens in need. The national carrier says that the clinic is going to provide essential primary medical and mental health care to underserved citi…","Published_Date":"2020-03-03","Content":"Telus has launched a new mobile health clinic on wheels in Halifax, Nova Scotia to provide healthcare to local citizens in need.The national carrier says that the clinic is going to provide essential primary medical and mental health care to underserved cit… "}
{"Source_Name":"Thechronicleherald.ca","Author":"Stuart Peddle","Title":"Nova Scotia won't add more students to tech pilot project - TheChronicleHerald.ca","Description":"This story has been re-edited for clarification.\r\n\r\nHALIFAX - A pilot project to give as many as 80 Nova Scotia students a leg up on tech careers will not accept more students after the current cohort moves through.\r\n\r\nThe Technology","Published_Date":"2020-03-05","Content":"This story has been re-edited for clarification.HALIFAX - A pilot project to give as many as 80 Nova Scotia students a leg up on tech careers will not accept more students after the current cohort moves through.The Technology Advantage Program, which was … "}
{"Source_Name":"Dailymail.co.uk","Author":"By Stephanie Linning For Mailonline","Title":"Last Tango In Halifax viewers are left heartbroken after 'horrible' Ruth","Description":"Caroline (Sarah Lancashire) had invited new colleague Ruth (Lu Corfield) over for dinner, hoping there might be something more than friendship between them.","Published_Date":"2020-03-02","Content":"Last Tango In Halifax viewers were left devastated by Ruth's 'judgmental' and 'unkind' reaction to Caroline coming out as gay on last night's episode. Caroline (Sarah Lancashire) had invited new colleague Ruth (Lu Corfield) over for dinner, hoping there mig… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"More than a pipe dream: How turning on your tap could create electricity","Description":"In this week's issue of our environment newsletter, we examine the concept of 'in-pipe hydro' and visualize just how many people worldwide live in cities.","Published_Date":"2020-03-05","Content":"Hello, people! This is our weekly newsletter on all things environmental, where we highlight trends and solutions that are moving us to a more sustainable world. (Sign up here to get it in your inbox every Thursday.)This week:<ul>'In-pipe power' gener… "}
{"Source_Name":"Mobilesyrup.com","Author":"Aisha Malik","Title":"Two Canadians successfully complete coast-to-coast trip in a Tesla","Description":"Two Canadians who planned to drive from the west coast to the east coast in a Tesla in roughly three days have successfully completed their journey. The pair started their journey in Tsawwassen, B.C. on March 4th and ended their trip in Halifax, Nova Scotia a…","Published_Date":"2020-03-08","Content":"Non"}
{"Source_Name":"Fox Sports","Author":"AP","Title":"Fasel tells AP: Women's world hockey championships canceled","Description":"The women’s world hockey championships in Canada have been canceled because of the new coronavirus","Published_Date":"2020-03-07","Content":"The women’s world hockey championships in Canada have been canceled because of the new coronavirus.International Ice Hockey Federation President René Fasel told The Associated Press the decision was made by conference call Saturday. The two-week tournament … "}
{"Source_Name":"Fxstreet.com","Author":"FXStreet Team","Title":"United Kingdom Halifax House Prices (YoY\/3m)) registered at 2.8%, below expectations (4%) in February","Description":"United Kingdom Halifax House Prices (YoY\/3m)) registered at 2.8%, below expectations (4%) in February","Published_Date":"2020-03-06","Content":"Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.Trading foreign exchange on margin carries a high level of risk and may not be… "}
{"Source_Name":"Fxstreet.com","Author":"FXStreet Team","Title":"United Kingdom Halifax House Prices (MoM) registered at 0.3% above expectations (0.2%) in February","Description":"United Kingdom Halifax House Prices (MoM) registered at 0.3% above expectations (0.2%) in February","Published_Date":"2020-03-06","Content":"Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer.Trading foreign exchange on margin carries a high level of risk and may not be… "}
{"Source_Name":"CBC News","Author":"The Canadian Press","Title":"Coronavirus-stricken Grand Princess cleared to dock in Oakland, Calif.","Description":"The captain of a cruise ship hit by the new coronavirus has informed the passengers, which include 237 Canadians, that the vessel is now headed to the port of Oakland, Calif.","Published_Date":"2020-03-08","Content":"The captain of a cruise ship hit by the new coronavirus has informed the passengers, which include 237 Canadians, that the vessel is now headed to the port of Oakland, Calif.In a ship-board address Saturday night, Grand Princess Capt. John Smith said the ve… "}
{"Source_Name":"Vice News","Author":"Mack Lamoureux, Josh Visser","Title":"Coronavirus Will Make This a Very Hard Year for Sports Fans","Description":"Teams are playing in front of empty stadiums in Europe. What does that mean for the NBA, MLB, NHL, and other major sports leagues and events?","Published_Date":"2020-03-10","Content":"This article originally appeared on VICE Canada.On Sunday, soccer superstar Christian Ronaldo lost control of a cross at the top of the six-yard box that teammate Aaron Ramsey picked up and swiftly buried into the goal, sealing Juventus' victory 2-0 over In… "}
{"Source_Name":"BBC News","Author":"https:\/\/www.facebook.com\/bbcnews","Title":"Jordan Sinnott death: Man, 22, admits affray","Description":"Non-league footballer Jordan Sinnott was found unconscious during a night out in Retford in January.","Published_Date":"2020-03-02","Content":"Image copyrightGetty Images\/Chris BrunskillImage caption Jordan Sinnott started his career at Huddersfield TownA man has pleaded guilty to affray in connection with the death of a non-league footballer who was found unconscious during a night out.Jordan… "}
{"Source_Name":"Secretflying.com","Author":"Admin","Title":"Halifax, Canada to San Juan, Puerto Rico for only $335 CAD roundtrip","Description":"Cheap flights from Halifax, Canada to San Juan, Puerto Rico for only $335 CAD roundtrip with United Airlines.","Published_Date":"2020-03-07","Content":"All the information on this page is accurate at the time of publication.If you are viewing this deal at a later date, the price and availability may no longer be as advertised.To ensure you never miss a Secret Flying deal again, download our FREE smartphone… "}
{"Source_Name":"Channelnewsasia.com","Author":"CNA","Title":"Ice hockey - Women's world championship cancelled over coronavirus outbreak","Description":"The women's world ice hockey championship set for this month in Halifax and Truro, Nova Scotia, has been cancelled over concerns about the coronavirus outbreak, the International Ice Hockey Federation (IIHF) said on Saturday.","Published_Date":"2020-03-07","Content":"REUTERS: The women's world ice hockey championship set for this month in Halifax and Truro, Nova Scotia, has been cancelled over concerns about the coronavirus outbreak, the International Ice Hockey Federation (IIHF) said on Saturday.\"Due to the ongoing spr… "}
{"Source_Name":"CBC News","Author":"Teresa Wright","Title":"Trudeau urges patience as Wet'suwet'en mull over proposed land and title deal","Description":"Prime Minister Justin Trudeau says he knows people are impatient for a resolution to tensions involving a disputed natural gas pipeline in northern British Columbia, but time is needed to respect the traditions of the Wet'suwet'en people.","Published_Date":"2020-03-03","Content":"Prime Minister Justin Trudeau says he knows people are impatient for a resolution to tensions involving a disputed natural gas pipeline in northern British Columbia, but time is needed to respect the traditions of the Wet'suwet'en people.Speaking to reporte… "}
{"Source_Name":"Globalnews.ca","Author":"aliciadraus","Title":"Halifax prepares for spread of COVID-19 - Global News","Description":"\"We started a few months ago actually, reviewing our plans for a pandemic response,\" said HRM's assistant chief of community risk reduction, Erica Fleck.","Published_Date":"2020-03-05","Content":"Two new cases of COVID-19 were confirmed in Ontario on Thursday bringing the total number of cases in Canada to 36. So far not a single case has been confirmed in Nova Scotia, but the Halifax Regional Municipality says they have been making preparations in ca… "}
{"Source_Name":"Fox Sports","Author":"AP","Title":"Hockey body tells AP women's worlds in Canada are canceled","Description":"The women’s world hockey championships in Canada have been canceled because of the new coronavirus","Published_Date":"2020-03-07","Content":"The women’s world hockey championships in Canada were canceled Saturday because of the new coronavirus.International Ice Hockey Federation President René Fasel told The Associated Press the decision was made by conference call. The two-week tournament was s… "}
{"Source_Name":"Theblaze.com","Author":"Carlos Garcia","Title":"News station's good deed turns into a social media disaster when they omit one crucial detail","Description":"A local news station's attempt at a good deed completely backfired on them in a social media disaster because they omitted one crucial fact of the story. ABC 13 News in Lynchburg, Virginia, tweeted about the \"AWESOME\" gift that they granted to a woman who had…","Published_Date":"2020-03-03","Content":"A local news station's attempt at a good deed completely backfired on them in a social media disaster because they omitted one crucial fact of the story. ABC 13 News in Lynchburg, Virginia, tweeted about the \"AWESOME\" gift that they granted to a woman who h… "}
{"Source_Name":"CBC News","Author":null,"Title":"Trudeau in Halifax LIVE","Description":"cbcnews_25 Prime Minister Justin Trudeau will take questions after an announcement in Halifax.","Published_Date":"2020-03-03","Content":"Non"}
{"Source_Name":"BBC News","Author":null,"Title":"FC Halifax Town v Sutton United","Description":"Live coverage of Tuesday's National League game between FC Halifax Town and Sutton United.","Published_Date":"2020-03-03","Content":"Non"}
{"Source_Name":"Businesswire.com","Author":null,"Title":"Dillon Consulting Limited Acquires F.C. O’Neill, Scriven & Assoc’s Limited","Description":"HALIFAX, Nova Scotia--(BUSINESS WIRE)--Dillon Consulting Limited is pleased to announce that it has acquired F.C. O’Neill, Scriven & Assoc’s Limited, a Nova Scotia based consulting engineering and design firm that specializes in mechanical & electrical buildi…","Published_Date":"2020-03-02","Content":"HALIFAX, Nova Scotia--(BUSINESS WIRE)--Dillon Consulting Limited is pleased to announce that it has acquired F.C. ONeill, Scriven &amp; Assocs Limited, a Nova Scotia based consulting engineering and design firm that specializes in mechanical &amp; electrical … "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"Bluedrop Announces Results of Annual and Special Meeting of Shareholders","Description":"ST. JOHN’S, Newfoundland and Labrador--(BUSINESS WIRE)--Bluedrop Performance Learning (\"Bluedrop\" or the \"Corporation\") (TSX-V: BPLI) is pleased to announce that the shareholders have voted in favour of all items brought before them at the Corporation's annua…","Published_Date":"2020-03-10","Content":"ST. JOHNS, Newfoundland and Labrador--(BUSINESS WIRE)--Bluedrop Performance Learning (\"Bluedrop\" or the \"Corporation\") (TSX-V: BPLI) is pleased to announce that the shareholders have voted in favour of all items brought before them at the Corporation's annual… "}
{"Source_Name":"Japantoday.com","Author":null,"Title":"Women’s world Ice hockey championships in Canada canceled due to virus","Description":"The women’s world hockey championships in Canada were canceled Saturday because of public health concerns over the spread of the new coronavirus. The two-week tournament was set to open March 31, with venues in Halifax and Truro, Nova Scotia. René Fasel, pres…","Published_Date":"2020-03-07","Content":"The womens world hockey championships in Canada were canceled Saturday because of public health concerns over the spread of the new coronavirus.The two-week tournament was set to open March 31, with venues in Halifax and Truro, Nova Scotia.René Fasel, pre… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Trudeau announces investment created to help young Canadians find jobs - CTV News","Description":"Prime Minister Justin Trudeau was in Halifax on Tuesday making an announcement about the high-rate of unemployment among young Canadians, and how he plans to help the issue.","Published_Date":"2020-03-03","Content":"HALIFAX -- A group of new Canadians in Nova Scotia got a surprise visit during the prime minister's visit on Tuesday.Forty-five people, representing 13 different countries, were at the citizenship ceremony on Tuesday where Prime Minister Justin Trudeau no… "}
{"Source_Name":"Thepointsguy.com","Author":"Mike Arnot","Title":"This is why you can’t fly to LaGuardia from Toronto’s convenient island airport","Description":"Porter Airlines is a godsend for travel to Toronto from New York, Boston or Chicago. Its main hub, Billy Bishop Toronto City Airport or YTZ, is on an island adjacent to downtown Toronto. But the airport experience in New York isn’t quite as pleasant as the vi…","Published_Date":"2020-03-10","Content":"Porter Airlines is a godsend for travel to Toronto from New York, Boston or Chicago. Its main hub, Billy Bishop Toronto City Airport or YTZ, is on an island adjacent to downtown Toronto.But the airport experience in New York isn’t quite as pleasant as the v… "}
{"Source_Name":"Bostonglobe.com","Author":"Johanna Seltz","Title":"Grants will help region’s firefighters clean their gear","Description":"The state has awarded $420,000 to 75 communities to buy machines that clean smoke and toxic chemicals from firefighting gear.","Published_Date":"2020-03-11","Content":"Firefighters in 75 communities including Braintree, Bridgewater, Carver, Duxbury, Halifax, Hingham, Kingston, Rockland, Scituate, and Whitman will be a little safer thanks to $420,000 in grants awarded by the state to buy machines that clean smoke and toxic c… "}
{"Source_Name":"Bostonherald.com","Author":"Marisa Ingemi","Title":"Canceled Women’s Worlds decreases already-shortened schedule for some elite players","Description":"No matter the circumstances, the Women's World Championships being cancelled this year would be bad for hockey. That it's happening during one of the lighter schedules ever for some elite players, though, makes it an even tougher pill to swallow. Hockey Canad…","Published_Date":"2020-03-08","Content":"No matter the circumstances, the Women’s World Championships being canceled this year is bad for hockey.That it’s happening during one of the lighter schedules ever for some elite players, though, makes it an even tougher pill to swallow.Hockey Canada and… "}
{"Source_Name":"Bostonglobe.com","Author":"Diane Bair, Pamela Wright","Title":"Tails and tides along the Nova Scotia coastline","Description":"The Nova Scotia Lobster Trail has seemingly endless ways to enjoy crustaceans, with 44 official stops including restaurants, cafes, seafood stores, and boat tours.","Published_Date":"2020-03-02","Content":"We left the tanks of crustaceans behind and walked out into the sunshine, where we enjoyed lobster-in-the-rough at a picnic table overlooking the harbor, watching the infamous tide rush in.How many ways can you eat a crustacean? How about lobster beignets a… "}
{"Source_Name":"Capebretonpost.com","Author":"Darrell Cole","Title":"Business and community leaders, cartoonist and author among Mount Allison's honorary recipients - Cape Breton Post","Description":"Sackville, N.B. university announces Michael de Adder, Margaret Fancy, Scott McCain, Robert M. Oglivie and Beth Powning will receive honorary degrees on May 11","Published_Date":"2020-03-04","Content":"SACKVILLE, N.B. – An award-winning editorial cartoonist, two of Canada’s leading business people, a successful author and photographer and a well known member of the university community will honorary degree recipients during Mount Allison convocation in May.… "}
{"Source_Name":"Espn.com","Author":null,"Title":"Fans can get refunds for women's hockey worlds","Description":"Hockey Canada clarified its ticket policy for the canceled IIHF women's world hockey championships and said fans can get refunds if they desite.","Published_Date":"2020-03-09","Content":"Hockey Canada has clarified its ticket policy for the IIHF women's world hockey championships in Nova Scotia, which were cancelled on Saturday due to the threat of the coronavirus (COVID-19).Initial reports indicated that Hockey Canada would not provide ref… "}
{"Source_Name":"CBC News","Author":"Jason Viau","Title":"'I feel I'm in a big prison': Canadian couple unable to fly home to Lebanon due to U.S. ban","Description":"Feeling trapped in Canada with no way of visiting his family back in Lebanon, Salam Al Sayed Ali of Windsor, Ont. said his problems all began when the U.S. denied him entry. Now, he can't board planes that fly over American soil, even for mere minutes.","Published_Date":"2020-03-02","Content":"Salam Al Sayed Ali feels trapped in Canada, unable to visit family in Lebanon after being placed on a U.S. no fly list, which he says is unfair and unexplained.Last month, Al Sayed Ali of Windsor, Ont. purchased $1,500 worth of plane tickets that would even… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Nova Scotia opens COVID-19 assessment centres across the province - CTV News","Description":"Nova Scotia opens COVID-19 assessment centres across the province CTV News Appointments needed to access Nova Scotia COVID-19 assessment sites CBC.ca Chutzpah galore Halifax Examiner Out-of-country travel, seniors homes targeted in Nova Scotia's Covid-19 camp…","Published_Date":"2020-03-10","Content":"HALIFAX -- The Nova Scotia Health Authority has opened eight COVID-19 assessment centres across the province.There are no confirmed cases of COVID-19 in Nova Scotia at this time, but health officials are taking precautions.The NSHA says the dedicated as… "}
{"Source_Name":"Smartcanucks.ca","Author":"Mr Busy","Title":"Via Rail Canada Discount Tuesday Offers: Big Savings Today!","Description":"Via Rail Canada has a new list of deals where you can save on select train tickets across the country from Vancouver to Halifax! Keep in mind that you’re also permitted to take one stop-over at no extra charge, making this a possible two-in-one trip! Take adv…","Published_Date":"2020-03-10","Content":"Via Rail Canada has a new list of deals where you can save on select train tickets across the country from Vancouver to Halifax! Keep in mind that youre also permitted to take one stop-over at no extra charge, making this a possible two-in-one trip! Take adva… "}
{"Source_Name":"Independent","Author":"Kate Hughes, Kate Hughes","Title":"Mortgage approvals soar as buyers return to market 'in their droves'","Description":"Buyers herald more settled 2020 with race to bargains before market catches up","Published_Date":"2020-03-03","Content":"Almost 71,000 mortgage applications were approved in January alone, the latest official figures show, as estate agents herald the best market conditions since the EU Referendum. Mortgage approvals for house purchases easily exceeded the most recent forecast… "}
{"Source_Name":"Smartcanucks.ca","Author":"Mr Busy","Title":"Via Rail Canada Discount Tuesday Offers: Big Savings Today!","Description":"Via Rail Canada has a new list of deals where you can save on select train tickets across the country from Vancouver to Halifax! Keep in mind that you’re also permitted to take one stop-over at no extra charge, making this a possible two-in-one trip! Take adv…","Published_Date":"2020-03-03","Content":"Via Rail Canada has a new list of deals where you can save on select train tickets across the country from Vancouver to Halifax! Keep in mind that youre also permitted to take one stop-over at no extra charge, making this a possible two-in-one trip! Take adva… "}
{"Source_Name":"Smartcanucks.ca","Author":"Mr Busy","Title":"IKEA Canada Family Membership Exclusive Sale Of Month March","Description":"IKEA Canada has new local deals every month, exclusive for family membership holders (which is FREE to get). Visit IKEA Store near you and enjoy this month offers: IKEA Boucherville IKEA Burlington IKEA Calgary IKEA Coquitlam IKEA Edmonton IKEA Etobicoke IKEA…","Published_Date":"2020-03-02","Content":"IKEA Canada has new local deals every month, exclusive for family membership holders (which is FREE to get).Visit IKEA Store near you and enjoy this month offers:IKEA Canada Family Membership Exclusive Sale Of Month is valid until March 31, 2020.Click h… "}
{"Source_Name":"Espn.com","Author":null,"Title":"Women's hockey worlds nixed over virus fears","Description":"The threat of the coronavirus has led the IIHF to cancel the women's world championship. The event had been scheduled to take place March 31-April 10 in Canada.","Published_Date":"2020-03-07","Content":"The IIHF World Women's Championship has been cancelled due to the threat of coronavirus.The decision to cancel the tournament was made by conference call on Saturday, IIHF president Rene Fasel told the Associated Press.The tournament was scheduled to take… "}
{"Source_Name":"Seattletimes.com","Author":"ANDREA RODRIGUEZ","Title":"Scientists meet in Havana on diplomats’ mystery illnesses","Description":"HAVANA (AP) — Some scientists who gathered Monday for a two-day conference on the mysterious illnesses suffered by U.S. and Canadian diplomats in Havana said they suspected pesticides as a possible culprit, although results remained inconclusive. The dozens o…","Published_Date":"2020-03-02","Content":"HAVANA (AP) Some scientists who gathered Monday for a two-day conference on the mysterious illnesses suffered by U.S. and Canadian diplomats in Havana said they suspected pesticides as a possible culprit, although results remained inconclusive. The dozens o… "}
{"Source_Name":"Dailymail.co.uk","Author":"By Stephanie Linning For Mailonline","Title":"Fans praise Nicola Walker as she stars in The Split and Last Tango In Halifax at the same time","Description":"Nicola Walker, originally from London, is dazzling fans as sheep farmer Gillian in Sunday night's Last Tango In Halifax and as power lawyer Hannah Stern in The Split, which continued last night.","Published_Date":"2020-03-03","Content":"With two hit BBC shows airing back-to-back and a third set to start later this year, there is no doubt Nicola Walker is having a major TV moment.The 49-year-old actress, originally from London, is dazzling fans as sheep farmer Gillian in Sunday night's Last… "}
{"Source_Name":"Bostonglobe.com","Author":null,"Title":"Bird sightings from the Mass Audubon Society","Description":"Bird sightings from the Mass Audubon Society.","Published_Date":"2020-03-07","Content":"Recent bird sightings as reported to the Mass Audubon Society:Greater Boston: A dickcisselcontinued to be seen at Rumney Marsh Reservation. Strong numbers of American woodcocks have moved into urban areas of the city, including the Rose Kennedy Greenway, th… "}
{"Source_Name":"Nationalpost.com","Author":"The Canadian Press","Title":"Trudeau urges patience as Wet'suwet'en mull over proposed land and title deal","Description":"He said his government has been focused on trying to find a solution, but added that current tensions stem from centuries of marginalizing Indigenous Peoples in Canada.","Published_Date":"2020-03-03","Content":"OTTAWA — Prime Minister Justin Trudeau says he knows people are impatient for a resolution to tensions involving a disputed natural gas pipeline in northern British Columbia, but time is needed to respect the traditions of the Wet’suwet’en people.Speaking t… "}
{"Source_Name":"Bleedingcool.com","Author":"Ray Flook","Title":"\"Chapelwaite\": \"Schitt's Creek\" Star Emily Hampshire Joins EPIX's Stephen King\/\"Jerusalem's Lot\" Series Adapt","Description":"Been awhile since we had some news to report on EPIX's upcoming drama based on Stephen King's 1978 short story \"Jerusalem's Lot\". In fact, it was a little over two months ago when we learned the project received a straight-to-series order, with Adrien Brody (…","Published_Date":"2020-03-04","Content":"Been awhile since we had some news to report on EPIX's upcoming drama based on Stephen King's 1978 short story \"Jerusalem's Lot\". In fact, it was a little over two months ago when we learned the project received a straight-to-series order, with Adrien Brody (… "}
{"Source_Name":"Theconversation.com","Author":"Howard Ramos, Professor of Sociology, Dalhousie University, Emma Kay, PhD Student, Department of Sociology and Social Anthropology, Dalhousie University","Title":"Affordable housing: It's not just a big city problem anymore","Description":"In Atlantic Canada, leaders must avoid the mistakes made in the country’s largest cities where people are being pushed out due to high housing prices.","Published_Date":"2020-03-04","Content":"People in Atlantic Canada cities, including Charlottetown, are nervous about rising house prices as young people return and immigration fuels economic growth. (Shutterstock) Awareness of affordability issues and the crunch to find suitable housing has made na… "}
{"Source_Name":"Financial Post","Author":"Reuters","Title":"Justin Trudeau opens door to possible aid for Canadian companies hit by virus","Description":"Ottawa open to the idea of helping firms which are suffering economic damage from a coronavirus outbreak","Published_Date":"2020-03-03","Content":"OTTAWA — The Canadian government is open to the idea of helping firms which are suffering economic damage from a coronavirus outbreak, Prime Minister Justin Trudeau said on Tuesday, but did not give details.“There will be impacts on Canadian businesses, on … "}
{"Source_Name":"Reuters","Author":"Steve Keating","Title":"Ice hockey: Women's world championship canceled over coronavirus outbreak","Description":"The women's world ice hockey championship set for this month in Halifax and Truro, Nova Scotia, has been canceled over concerns about the coronavirus outbreak, the International Ice Hockey Federation (IIHF) said on Saturday.","Published_Date":"2020-03-07","Content":"(Reuters) - The women’s world ice hockey championship set for this month in Halifax and Truro, Nova Scotia, has been canceled over concerns about the coronavirus outbreak, the International Ice Hockey Federation (IIHF) said on Saturday. “Due to the ongoing … "}
{"Source_Name":"Doctorwhonews.net","Author":"Marcus","Title":"The Timeless Children: Overnight Viewing Figures","Description":"The Timeless Children, was watched by 3.78 million viewers in the UK yesterday according to unofficial overnight figures.","Published_Date":"2020-03-02","Content":"Doctor Who The Timeless Children, was watched by 3.78 million viewers in the UK yesterday according to unofficial overnight figures. The rating, representing 19.8% of the total viewing audience made Doctor Who the 7th most popular show on British Television y… "}
{"Source_Name":"Thechronicleherald.ca","Author":"Heather Laura Clarke","Title":"Transitioning out of your business can be ‘rewarding’ or ‘traumatizing’ - TheChronicleHerald.ca","Description":"Dr. Lesley Steele and her husband became “accidental entrepreneurs” at a young age, and she jokes that she’s still not sure how they convinced the bank to lend them the money.\r\n\r\nIt was 1999 when the brand-new veterinarian purchased","Published_Date":"2020-03-04","Content":"Dr. Lesley Steele and her husband became “accidental entrepreneurs” at a young age, and she jokes that she’s still not sure how they convinced the bank to lend them the money.It was 1999 when the brand-new veterinarian purchased her first business — Eastern… "}
{"Source_Name":"Ufc.com","Author":null,"Title":"UFC Returns To Saskatoon On June 20","Description":"Find out more about UFC's return to Saskatoon on June 20","Published_Date":"2020-03-03","Content":"A special UFC FIGHT NIGHT® microsite UFC.com\/saskatoon launches today, providing registering fans with pre-sale access to tickets and event related information.We are thrilled to bring the world-famous Octagon® back to the Canadian Prairies, David Shaw, UFC… "}
{"Source_Name":"Fxstreet.com","Author":"Omkar Godbole","Title":"GBP\/USD: Ascent stalls at key hurdle despite record lows in US yields","Description":"GBP\/USD is struggling to clear resistance of the trendline falling from December and January highs on Friday despite the slide in the US treasury yiel","Published_Date":"2020-03-06","Content":"<ul>GBP\/USD is stuck at key falling trendline resistance at 1.2965. Dovish BOE expectations could keep gains in GBP under the check. <\/ul>GBP\/USD is struggling to clear resistance of the trendline falling from December and January highs on F… "}
{"Source_Name":"Thestar.com","Author":"The Canadian Press","Title":"Minor quake shakes Dartmouth, N.S., Earthquakes Canada says","Description":"Halifax police say they received several calls after people felt their homes shaking due to the magnitude 2.6 quake.","Published_Date":"2020-03-02","Content":"HALIFAX—Earthquakes Canada says a minor earthquake shook up a Dartmouth, N.S., neighbourhood on Sunday night.It says the quake was a magnitude 2.6, which is usually too weak to be felt.But Halifax police say several people called 911 to report feeling the… "}
{"Source_Name":"Yahoo.com","Author":"The Canadian Press","Title":"Canadian featherweight Gavin (Guv'nor) Tucker added to UFC card in Lincoln","Description":"Canadian featherweight Gavin (Guv'nor) Tucker will face American Billy Quarantillo at a UFC Fight Night card April 25 in Lincoln, Neb.The main event at the Pinnacle Bank Arena pits Anthony Smith, ranked third among light-heavyweight contenders, against No. 9 …","Published_Date":"2020-03-06","Content":"Canadian featherweight Gavin (Guv'nor) Tucker will face American Billy Quarantillo at a UFC Fight Night card April 25 in Lincoln, Neb.The main event at the Pinnacle Bank Arena pits Anthony Smith, ranked third among light-heavyweight contenders, against No. … "}
{"Source_Name":"Yahoo.com","Author":"Associated Press","Title":"Fasel tells AP: Women's world hockey championships canceled","Description":"The women’s world hockey championships in Canada have been canceled because of the new coronavirus.  International Ice Hockey Federation President René Fasel told The Associated Press the decision was made by conference call Saturday.  The two-week tournament…","Published_Date":"2020-03-07","Content":"The womens world hockey championships in Canada have been canceled because of the new coronavirus.International Ice Hockey Federation President René Fasel told The Associated Press the decision was made by conference call Saturday. The two-week tournament w… "}
{"Source_Name":"Bostonherald.com","Author":"Associated Press","Title":"‘It’s scary’: Virus slams women’s hockey worlds in Canada","Description":"The women’s world hockey championships in Canada were canceled Saturday because of public health concerns over the spread of the new coronavirus.","Published_Date":"2020-03-07","Content":"By JOHN WAWROWThe women’s world hockey championships in Canada were canceled Saturday because of public health concerns over the spread of the new coronavirus.The two-week tournament was set to open March 31, with venues in Halifax and Truro, Nova Scotia.… "}
{"Source_Name":"Cointelegraph.com","Author":"Cointelegraph By Felipe Erazo","Title":"Canada Funds Blockchain Firms Looking to Trace Steel","Description":"Canada’s government approves funding of two national companies to start implementing blockchain technology to trace steel","Published_Date":"2020-03-09","Content":"Canadian authorities have approved funding of two blockchain firms, Peer Ledger and Mavennet, to create a platform that enables steel traceability, reported Ledger Insights on March 9.The Innovation, Science, and Financial Development Canada (ISED), a gover… "}
{"Source_Name":"Yahoo.com","Author":"Kait Bolongaro","Title":"Trudeau Vows to Steer Canada Clear of Coronavirus Slowdown","Description":"(Bloomberg) -- Prime Minister Justin Trudeau promised his government will protect Canada’s economy from a possible slowdown due to the outbreak of coronaviru...","Published_Date":"2020-03-03","Content":"(Bloomberg) -- Prime Minister Justin Trudeau promised his government will protect Canadas economy from a possible slowdown due to the outbreak of coronavirus.The Canadian leader -- speaking Tuesday morning after Group of Seven finance ministers and central … "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"T.Y. Lin International Group Welcomes Ian MacLeod as Senior Vice President and Chief Human Resources Officer","Description":"SAN FRANCISCO--(BUSINESS WIRE)-- #civilengineering--T.Y. Lin International Group Welcomes Ian MacLeod as Senior Vice President and Chief Human Resources Officer","Published_Date":"2020-03-05","Content":"SAN FRANCISCO--(BUSINESS WIRE)--T.Y. Lin International (TYLI) Group, a globally recognized full-service infrastructure consulting firm, welcomes Ian MacLeod as Senior Vice President and Chief Human Resources Officer (CHRO). In his role, MacLeod will work with… "}
{"Source_Name":"Thestar.com","Author":"Michael Tutton - The Canadian Press","Title":"Indigenous historian suggests name change for coast guard vessel Cornwallis","Description":"A Mi’kmaw elder said the refurbishment should include a name change, as has occurred at a Halifax junior high school and a historic African Nova Scotian Baptist church.","Published_Date":"2020-03-02","Content":"HALIFAX—A prominent Indigenous historian says it’s the ideal time to drop the name Edward Cornwallis from a coast guard ship, as the federal agency announced plans on Monday to spend $12.1 million renovating the vessel.Daniel Paul, a Mi’kmaw elder and the a… "}
{"Source_Name":"CBC News","Author":"Pam Berman","Title":"Halifax Mayor Mike Savage says he'll reoffer in fall election","Description":"Mike Savage has decided to run for mayor of Halifax for the third time. He says he enjoys the job and is passionate about what's happening in the Halifax region.","Published_Date":"2020-03-11","Content":"Mike Savage has decided to run for mayor of Halifax for the third time.He said he enjoys the job and is passionate about what's happening in the city.\"By any standard, the city has done well,\" said Savage, \"We're more livable than we've ever been and we'r… "}
{"Source_Name":"Yahoo.com","Author":"CBC","Title":"Film about black hockey players sparks controversy with N.S. Sport Hall of Fame","Description":"A film funded by the National Film Board of Canada documenting the career of a young black hockey player and the history of a black hockey league in Nova Scotia has sparked a controversy with the Nova Scotia Sport Hall of Fame.Ice Breakers is a 15-minute film…","Published_Date":"2020-03-03","Content":"A film funded by the National Film Board of Canada documenting the career of a young black hockey player and the history of a black hockey league in Nova Scotia has sparked a controversy with the Nova Scotia Sport Hall of Fame.Ice Breakers is a 15-minute fi… "}
{"Source_Name":"Billboard.com","Author":"Gary Graff","Title":"Randy Bachman and Burton Cummings Are Back Together for 2020 Tour: Exclusive","Description":"Randy Bachman and Burton Cummings will share the land, or at least the stage again, this summer as the Guess Who duo hits the road for two dozen dates, mostly in their native Canada.","Published_Date":"2020-03-09","Content":"Randy Bachman and Burton Cummings will share the land, or at least the stage again, this summer as the Guess Who duo hits the road for two dozen dates, mostly in their native Canada.The trek, billed as Bachman-Cummings: Together Again Live in Concert, is th… "}
{"Source_Name":"CBC News","Author":"Catharine Tunney","Title":"RCMP denied using facial recognition technology - then said it had been using it for months","Description":"The RCMP denied using facial recognition technology as recently as January - before disclosing a few weeks later it had been using Clearview AI, a controversial app that has harvested billions of personal photos from social media, for months.","Published_Date":"2020-03-04","Content":"Just weeks after the RCMP denied using facial recognition technology, it acknowledged that it had been using Clearview AI's controversial software which has harvested billions of personal photos from social media for months.A few weeks ago, CBC Nova Scotia … "}
{"Source_Name":"CBC News","Author":"The Canadian Press","Title":"Coronavirus-stricken Grand Princess cleared to dock in Oakland, Calif.","Description":"The captain of a cruise ship hit by the new coronavirus has informed the passengers, which include 237 Canadians, that the vessel is now headed to the port of Oakland, Calif.","Published_Date":"2020-03-08","Content":"The captain of a cruise ship hit by the new coronavirus has informed the passengers, which include 237 Canadians, that the vessel is now headed to the port of Oakland, Calif.In a ship-board address Saturday night, Grand Princess Capt. John Smith said the ve… "}
{"Source_Name":"Globalnews.ca","Author":"kerribreen1","Title":"OPP confirms past use of controversial Clearview AI technology - Global News","Description":"OPP confirms past use of controversial Clearview AI technology Global News Apple bans Clearview AI's iPhone app for violating its policies MobileSyrup OPP admit using controversial facial recognition software Clearview AI CP24 Toronto's Breaking News Apple bl…","Published_Date":"2020-03-02","Content":"Ontario Provincial Police have confirmed use of the controversial facial recognition software known as Clearview AI.The police force says some officers with units investigating child sexual exploitation, human trafficking, cyber crime as well as the digital… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"Halifax police seize opioid stronger than fentanyl","Description":"Police in Halifax have seized a large amount of potent synthetic opioid which is stronger than fentanyl. People taking the drug, confirmed as isotonitazene, may need several doses of naloxone to counter an overdose.","Published_Date":"2020-03-05","Content":"Police in Halifax say they have seized a large amount of a \"highly potent\" synthetic opioid which is stronger than fentanyl.Over two weeks in February, Halifax Regional Police say investigators in the force's guns and gangs unit made a number of searches in… "}
{"Source_Name":"Nationalinterest.org","Author":"Steve Weintz","Title":"NATO Had Some Crazy Desperate Plans To Stop Russia's Submarine Fleet","Description":"Steve Weintz Security, There were hundreds of them. Key point: NATO war planners feared only nuclear escalation could check the Soviet submarine wolf packs. That is, atomic strikes on sub bases along the Russian coast. At the height of the Cold War, the Sovie…","Published_Date":"2020-03-06","Content":"Key point: NATO war planners feared only nuclear escalation could check the Soviet submarine wolf packs. That is, atomic strikes on sub bases along the Russian coast.At the height of the Cold War, the Soviet Union had so many hundreds of deadly submarines a… "}
{"Source_Name":"CBC News","Author":"Shaina Luck","Title":"Halifax police board chair backs decision to put 2 officers on admin duty","Description":"The chair of the Halifax board of police commissioners says she has confidence in the process followed by Halifax Regional Police Chief Dan Kinsella in the case of two officers who were placed on administrative duty following the arrest of a 15-year-old boy i…","Published_Date":"2020-03-10","Content":"The chair of the Halifax board of police commissioners says she has confidence in the process followed by Halifax Regional Police Chief Dan Kinsella in the case of two officers who were placed on administrative duty following the arrest of a 15-year-old boy i… "}
{"Source_Name":"Thestar.com","Author":"Michael Tutton - The Canadian Press","Title":"Sexual assault complainant asks Nova Scotia court to order probe over police errors","Description":"Carrie Low from Halifax alleges the investigation of her sexual assault case was mishandled and is seeking the reinstatement of a complaint against police that was dismissed because it arrived too late.","Published_Date":"2020-03-03","Content":"HALIFAX—A Nova Scotia woman who says the investigation of her sexual assault case was mishandled is seeking the reinstatement of a complaint against police that was dismissed because it arrived too late.Carrie Low alleges that after she was taken in a car, … "}
{"Source_Name":"CBC News","Author":null,"Title":"Crickets are on the menu at this new Halifax company","Description":"Earthproof Protein, a new company in Halifax,  wants to help you expand your palate — to crickets.","Published_Date":"2020-03-09","Content":"Non"}
{"Source_Name":"Smartcanucks.ca","Author":"Mr Busy","Title":"IKEA Canada New Weekly Offers: Save up to 70% off Select Items & More Deals","Description":"IKEA Canada has some new deals in all store locations. Each store has its own special offers so be sure to check out your local IKEA store offers! The offers are either Deal of the week, Store Event Deals, Now or Never Deals or Ikea Family Deals. Check out th…","Published_Date":"2020-03-09","Content":"IKEA Canada has some new deals in all store locations. Each store has its own special offers so be sure to check out your local IKEA store offers! The offers are either Deal of the week, Store Event Deals, Now or Never Deals or Ikea Family Deals.Check out t… "}
{"Source_Name":"Cleantechnica.com","Author":"Johnna Crider","Title":"The “Fast EV Lightning Run” Across Canada In A Tesla Model 3","Description":"The Fast EV Lightning Run is happening along Tesla's Trans-Canada Supercharger route. Tesla owners are driving coast to cost in 72 hours.","Published_Date":"2020-03-05","Content":"CarsPublished on March 5th, 2020 | by Johnna Crider0March 5th, 2020 by Johnna Crider Ian Pavelko and Trevor Page just left from Tsawwassen, BC, on an epic adventure across Canada in an EV the first of its kind. Dubbed the “Fast EV Lightning Run,” the … "}
{"Source_Name":"CBC News","Author":"Chelsea Gomez,Chris Glover,Laura Clementson","Title":"Pressure to have multiple babies putting surrogates 'at risk'","Description":"A three-month CBC investigation revealed that a lot of women who become surrogates feel internal and external pressure to have multiple babies. And experts warn that there isn't enough medical oversight of women who have babies in quick succession.","Published_Date":"2020-03-04","Content":"After Elizabeth Roberts had her two kids, the 39-year-old knew she wanted to help someone else build a family. Having watched a friend volunteer to be a surrogate, Roberts signed herself up in 2016.The Halifax nurse filled out an online application for one … "}
{"Source_Name":"CBC News","Author":"John Wawrow","Title":"IIHF cancels world women's hockey championship: AP","Description":"The two-week tournament was set to open March 31 with games to be played in Halifax and Truro, N.S.","Published_Date":"2020-03-07","Content":"The women's world hockey championships in Canada have been cancelled because of the COVID-19 outbreak.International Ice Hockey Federation President Rene Fasel told The Associated Press the decision was made by conference call Saturday. The two-week tourname… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"Teen arrested with suspected cap gun after lockdown at Lockview High","Description":"A Halifax-area high school was on lockdown for almost an hour Monday as RCMP investigated a weapons call.","Published_Date":"2020-03-02","Content":"An 18-year-old who police believe was carrying a cap gun has been arrested following a noon-hour lockdown at a Halifax-area high school.No one was hurt in the incident. RCMP were called to Lockview High School in Fall River, N.S., at 12:09 p.m. to investi… "}
{"Source_Name":"Cityam.com","Author":"Joe Curtis","Title":"UK house prices post 2.8 per cent gain in February","Description":"UK house prices rose 2.8 per cent in February compared to the same month last year, Halifax data showed today. The post UK house prices post 2.8 per cent gain in February appeared first on CityAM.","Published_Date":"2020-03-06","Content":"UK house prices rose 2.8 per cent in February compared to the same month last year, Halifax data showed today.Homes’ values increased 0.3 per cent month on month and 2.9 per cent on a quarterly basis, Halifax’s House Price Index found.That left the averag… "}
{"Source_Name":"CBC News","Author":"Shaina Luck","Title":"Minor earthquake shakes homes, alarms residents in Dartmouth","Description":"Halifax Fire spent approximately an hour searching the Waverley Road area, but said no damage and no injuries were reported.","Published_Date":"2020-03-02","Content":"Some people in the Montebello neighbourhood of Dartmouth were startled Sunday evening by a minor earthquake.Natural Resources Canada says the earthquake registered 2.6 on the Richter scale. \"It is very unlikely that an earthquake of magnitude less than 5 … "}
{"Source_Name":"Yahoo.com","Author":"The Canadian Press","Title":"Saskatoon to host UFC's first Canadian event of 2020 with June Fight Night card","Description":"Saskatoon will host the UFC's first Canadian event of 2020.The UFC announced Wednesday that the SaskTel Centre will host a Fight Night televised card on June 20.While the main event has yet to be announced, the card will include Canadians Gillian (The Savage)…","Published_Date":"2020-03-04","Content":"Saskatoon will host the UFC's first Canadian event of 2020.The UFC announced Wednesday that the SaskTel Centre will host a Fight Night televised card on June 20.While the main event has yet to be announced, the card will include Canadians Gillian (The Sav… "}
{"Source_Name":"Yahoo.com","Author":"NBC Sports","Title":"Ryan Newman, Corey LaJoie and Ryan Blaney share a happier moment","Description":"Three of the NASCAR drivers involved in the terrifying crash on the last lap of the Daytona 500 were reunited under much better circumstances Thursday. With a “Look who I found” message, a grinning Corey LaJoie posted a photo to Twitter alongside a smiling Ry…","Published_Date":"2020-03-06","Content":"Three of the NASCAR drivers involved in the terrifying crash on the last lap of the Daytona 500 were reunited under much better circumstances Thursday.With a Look who I found message, a grinning Corey LaJoieposted a photo to Twitter alongside a smiling Ryan… "}
{"Source_Name":"Nationalinterest.org","Author":"Robert Farley","Title":"How America Once Planned to Conquer and Annex Canada","Description":"Robert Farley History, Americas Woah matey. Key point: America had tried to seize Canada in the War of 1812 and failed. However, it took a long time for Washington's imperial dreams towards its norther neighbor to end. The end of a war only rarely settles the…","Published_Date":"2020-03-11","Content":"Key point: America had tried to seize Canada in the War of 1812 and failed. However, it took a long time for Washington's imperial dreams towards its norther neighbor to end.The end of a war only rarely settles the central questions that started the conflic… "}
{"Source_Name":"CBC News","Author":"Elizabeth McMillan","Title":"Halifax police chief making 'irrational' decisions about members, union says","Description":"The union that represents Halifax police officers says the force's new chief is spreading unrest among the rank and file with \"knee-jerk, irrational\" decisions following his placement of two officers on desk duty after the recent arrest of a Bedford teen.","Published_Date":"2020-03-02","Content":"The union that represents Halifax police officers says the force's new chief is spreading unrest among the rank and file with \"knee-jerk, irrational\" decisions following his placement of two officers on desk duty after the arrest of a Bedford teen.In a Feb.… "}
{"Source_Name":"CBC News","Author":"Brooklyn Currie","Title":"Cancellation of Texas festival throws wrench in plans for Halifax booking company","Description":"A Halifax-based booking company is scrambling to halt more than a dozen shows after the South by Southwest music festival was cancelled over concerns about COVID-19.","Published_Date":"2020-03-08","Content":"A Halifax-based booking company is scrambling to halt more than a dozen shows after the South by Southwest music festival was cancelled over concerns about COVID-19.As a pilot project this year, Side Door partnered with SXSW to organize tours for eight ba… "}
{"Source_Name":"Yahoo.com","Author":"The Canadian Press","Title":"Nova Scotian Darling hopes to lead Fightin' Blue Hens to March Madness","Description":"Nate Darling was only allowed to shoot hoops in his driveway between certain times while growing up in Halifax.The neighbours didn't take kindly to the rhythmic \"thunk\" of the ball at all hours.\"My mom says that the neighbours would set rules for when I was a…","Published_Date":"2020-03-07","Content":"Nate Darling was only allowed to shoot hoops in his driveway between certain times while growing up in Halifax.The neighbours didn't take kindly to the rhythmic \"thunk\" of the ball at all hours.\"My mom says that the neighbours would set rules for when I w… "}
{"Source_Name":"CBC News","Author":"David Burke","Title":"'We see a lot of hams': Halifax airport travellers sure like their illegal pork","Description":"People coming into Canada's airports regularly bring restricted foods with them, but for some reason, travellers arriving at the Halifax airport often carry pork products.","Published_Date":"2020-03-10","Content":"Many Nova Scotians and others travelling through the Halifax airport may not realize the tasty souvenir in their luggage isn't allowed in Canada.That's because some meat products from countries other than the United States can contain dangerous diseases or … "}
{"Source_Name":"CBC News","Author":"Aly Thomson","Title":"Fashion show to flaunt collaboration, diversity in Halifax industry","Description":"The fashion industry is known as cut-throat, but in Halifax the opposite is true. Six designers are set to showcase their work on Monday as part of a fashion show at the restaurant The Mercantile Social celebrating diversity and collaboration in Halifax's fas…","Published_Date":"2020-03-05","Content":"The fashion industry is known as cut-throat, but in Halifax the opposite is true.Six designers are set to showcase their work on Monday as part of a fashion show at the restaurant The Mercantile Social celebrating diversity and collaboration in Halifax's fa… "}
{"Source_Name":"CBC News","Author":null,"Title":"Halifax mayor's campaign aims to prevent spread of COVID-19","Description":"Hands-Free Halifax is a social media campaign that was started by Mayor Mike Savage to get people to think about handshake alternatives like elbow bumps and foot taps.","Published_Date":"2020-03-10","Content":"Non"}
{"Source_Name":"CBC News","Author":"Elizabeth McMillan","Title":"Baby agaves carry on legacy of Halifax's most famous plant","Description":"Little agaves are sprouting in some Nova Scotia homes, tiny legacies of the Halifax Public Garden’s famous succulent that gained an affectionate following nearly two years ago.","Published_Date":"2020-03-08","Content":"Little agave plants are sprouting up in some Nova Scotia homes, the enduring legacy of the Halifax Public Garden's famous succulent that gained an affectionate following nearly two years ago.Colleen Farrell was among those who stopped into the downtown gard… "}
{"Source_Name":"Road.cc","Author":"Alex Bowden","Title":"Campaigners ‘delighted’ after Transport Secretary says he’ll stop Queensbury Tunnel from being filled in – but he seems unconvinced by plans for a cycle route","Description":"Minister floats light rail line idea as an alternative to proposed cycleway","Published_Date":"2020-03-06","Content":"The Secretary of State for Transport, Grant Shapps, has backed a plan to reopen the disused Queensbury Tunnel in West Yorkshire. Campaigners want to see the tunnel become part of a cycle route connecting Bradford and Halifax and have been fighting Highways En… "}
{"Source_Name":"Usmagazine.com","Author":"Mariah Cooper","Title":"Ryan Newman: It's a 'Miracle' That I Survived Daytona 500 Wreck","Description":"Counting his blessings. Ryan Newman feels that “the angels aligned” to help him survive his Daytona 500 wreck in February, which resulted in a head injury. “[It’s] still humbling to watch it and know that I’m sitting here without a headache, which is amazing,…","Published_Date":"2020-03-11","Content":"Counting his blessings. Ryan Newman feels that the angels aligned to help him survive his Daytona 500 wreck in February, which resulted in a head injury.Celebrity Injuries"}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Most VIA Rail Trains Resume Normal Service","Description":"VIA Rail Canada (VIA Rail) announces that as of Saturday, March 7, most of its trains will resume service on their normal schedule.","Published_Date":"2020-03-04","Content":"Please note that certain dates have been updated.MONTRÉAL, March 4, 2020 \/PRNewswire\/ - VIA Rail Canada (VIA Rail) announces that as of Saturday, March 7, most of its trains will resume service on their normal schedule.As of this Saturday, all services be… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"HUB International Acquires The Benefits Consulting Practice Of Morneau Shepell Inc.","Description":"HUB International Limited (Hub), a leading global insurance brokerage, and Morneau Shepell Inc. (TSX: MSI) (Morneau Shepell), a North American leader in integrated HR solutions, announced today the sale of Morneau Shepell's benefits consulting practice to Hub.","Published_Date":"2020-03-02","Content":"Morneau Shepell Doubles Down on Areas of Growth and Market Leadership; Hub to Round Out Canadian Employee Benefits Solution with Extensive Actuarial ServicesCHICAGO and TORONTO, March 2, 2020 \/PRNewswire\/ -- HUB International Limited (Hub), a leading glob… "}
{"Source_Name":"Yahoo.com","Author":"PR Newswire","Title":"Brooks Rehabilitation Looks to the Future of Patient Care with SONIFI Health Technology","Description":"Building on its 50-year reputation for world-class rehabilitation services, Brooks Rehabilitation continues to elevate patient experience and patient outcomes through a new partnership with interactive patient engagement platform provider SONIFI Health.","Published_Date":"2020-03-03","Content":"JACKSONVILLE, Fla., March 3, 2020 \/PRNewswire\/ -- Building on its 50-year reputation for world-class rehabilitation services, Brooks Rehabilitation continues to elevate patient experience and patient outcomes through a new partnership with interactive patient… "}
{"Source_Name":"Rlsbb.ru","Author":"Lisa","Title":"Last Tango in Halifax S05E03 720p HDTV x264-ORGANiC","Description":"Season 5, Episode 03 – There’s chaos at the bungalow as work begins to strip out the old kitchen. Alan’s new supermarket job brings an unexpected challenge in the form of Harrison, and an overburdened Celia is called upon to travel by bus. Links: HOMEPAGE – T…","Published_Date":"2020-03-08","Content":"Non"}
{"Source_Name":"CBC News","Author":"Elizabeth McMillan","Title":"4 members of Dartmouth family to be sentenced for pimping-related charges","Description":"​​​​​​​Four members of a Dartmouth, N.S., family who have pleaded guilty to pimping-related offences involving young women are scheduled to appear in Halifax provincial court Wednesday afternoon for a sentencing hearing.","Published_Date":"2020-03-11","Content":"Four members of a Dartmouth, N.S., family who have pleaded guilty to pimping-related offences involving young women are scheduled to appear in Halifax provincial court Wednesday afternoon for a sentencing hearing.Leslie Gray, 27, his brother Justin Gray, 26… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"Flooding at QEII impacts cardiology clinics, diagnostics","Description":"Flooding at the QEII's Halifax Infirmary cardiology clinics and diagnostics Friday has affected those clinic areas. Repairs have begun but it could take several weeks to complete the work.","Published_Date":"2020-03-07","Content":"Flooding at the QEII's Halifax Infirmary cardiology clinics and diagnostics Friday has affected those clinic areas.Repairs have begun but it could take several weeks to complete the work.Those with upcoming appointments may be contacted by the Nova Scotia… "}