{"Source_Name":"Businesswire.com","Author":null,"Title":"Ideal Potency of Edible Products 5MGs of THC or Less, Organigram Consumer Research Survey Concludes","Description":"MONCTON, New Brunswick--(BUSINESS WIRE)---- $OGI--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the “Company” or “Organigram”), a leading licensed producer of cannabis, has released summary findings gathered in a re…","Published_Date":"2020-03-10","Content":"MONCTON, New Brunswick--(BUSINESS WIRE)--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the Company or Organigram), a leading licensed producer of cannabis, has released summary findings gathered in a research projec… "}
{"Source_Name":"Businesswire.com","Author":null,"Title":"Organigram Expands Leadership Team with the Appointment of Chief Strategy Officer and Newly Appointed Chief Financial Officer","Description":"MONCTON, New Brunswick--(BUSINESS WIRE)---- $OGI--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the “Company” or “Organigram”), a leading licensed producer of cannabis, is pleased to announce that effective today Pa…","Published_Date":"2020-03-04","Content":"MONCTON, New Brunswick--(BUSINESS WIRE)--Organigram Holdings Inc. (NASDAQ: OGI) (TSX: OGI), the parent company of Organigram Inc. (the Company or Organigram), a leading licensed producer of cannabis, is pleased to announce that effective today Paolo De Luca, … "}
{"Source_Name":"Fool.com","Author":"newsfeedback@fool.com (Sean Williams)","Title":"5 Marijuana Stocks That Can Make Money During a Recession","Description":"These pot stocks can deliver the green in any economic environment.","Published_Date":"2020-03-05","Content":"Last week, the stock market turned in its worst performance in more than 11 years. When the curtain closed, the 123-year-old Dow Jones Industrial Average, technology-laden Nasdaq Composite, and benchmark S&amp;P 500, declined by 12.4%, 10.5%, and 11.5%, respe… "}
{"Source_Name":"Fool.com","Author":"newsfeedback@fool.com (Sean Williams)","Title":"This Pot Stock Looks to Be the Only Clear Winner in Canada","Description":"Pretty much all Canadian marijuana growers, save for this company, look to be dumpster fires.","Published_Date":"2020-03-09","Content":"At this time last year, marijuana stocks were the hottest thing since sliced bread. At the end of the first quarter of 2019, more than a dozen cannabis stocks wound up rising by at least 70% in a three-month stretch, fueled by Canada's imminent release of der… "}
{"Source_Name":"Ufc.com","Author":null,"Title":"UFC Returns To Saskatoon On June 20","Description":"Find out more about UFC's return to Saskatoon on June 20","Published_Date":"2020-03-03","Content":"A special UFC FIGHT NIGHT® microsite UFC.com\/saskatoon launches today, providing registering fans with pre-sale access to tickets and event related information.We are thrilled to bring the world-famous Octagon® back to the Canadian Prairies, David Shaw, UFC… "}
{"Source_Name":"Billboard.com","Author":"Gary Graff","Title":"Randy Bachman and Burton Cummings Are Back Together for 2020 Tour: Exclusive","Description":"Randy Bachman and Burton Cummings will share the land, or at least the stage again, this summer as the Guess Who duo hits the road for two dozen dates, mostly in their native Canada.","Published_Date":"2020-03-09","Content":"Randy Bachman and Burton Cummings will share the land, or at least the stage again, this summer as the Guess Who duo hits the road for two dozen dates, mostly in their native Canada.The trek, billed as Bachman-Cummings: Together Again Live in Concert, is th… "}
{"Source_Name":"Yahoo.com","Author":"The Canadian Press","Title":"Saskatoon to host UFC's first Canadian event of 2020 with June Fight Night card","Description":"Saskatoon will host the UFC's first Canadian event of 2020.The UFC announced Wednesday that the SaskTel Centre will host a Fight Night televised card on June 20.While the main event has yet to be announced, the card will include Canadians Gillian (The Savage)…","Published_Date":"2020-03-04","Content":"Saskatoon will host the UFC's first Canadian event of 2020.The UFC announced Wednesday that the SaskTel Centre will host a Fight Night televised card on June 20.While the main event has yet to be announced, the card will include Canadians Gillian (The Sav… "}
{"Source_Name":"CBC News","Author":"Jordan Gill","Title":"Consumers, legal cannabis industry gather at Moncton trade show","Description":"Cannabis at the Coliseum was expected to draw over 2,000 people to the Moncton Coliseum","Published_Date":"2020-03-08","Content":"Cannabis lovers were in heaven on Saturday in Moncton.Cannabis at the Coliseum was expected to draw over 2,000 people to the Moncton Coliseum.The show was the first of its kind in Canada, a consumer show where cannabis could be purchased on site.The wee… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"Moncton-born Michael de Adder receives award for editorial cartoons","Description":"A cartoonist from Moncton has won a prestigious U.S. award for excellence in editorial cartooning.","Published_Date":"2020-03-05","Content":"An artist from Moncton has won a prestigious American award for excellence in editorial cartooning on Wednesday. Cartoonist Michael de Adder is this year's winner of the Herblock Prize, which was created in 2004 to support editorial cartooning \"as an essent… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"Moncton RCMP investigate separate weapons incidents","Description":"Police in Moncton are investigating separate incidents involving weapons in a three-day span.","Published_Date":"2020-03-03","Content":"Police in Moncton are investigating separate incidents involving weapons in a three-day span.Codiac RCMP announced Tuesday three people have been charged in connection with an armed robbery Saturday at a home on Botsford Street.A 27-year-old man armed wit… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"Moncton mother wants students returning from Europe to self-quarantine","Description":"A Moncton-area mother says high school students returning from Europe this week should be told to self-quarantine as a precaution against COVID-19.","Published_Date":"2020-03-09","Content":"A Moncton-area mother says high school students returning from Europe this week should be told to self-quarantine as a precaution against COVID-19.About 50 Bernice MacNaughton High School students and chaperons departed Feb. 28 to visit Germany, Austria, Sw… "}
{"Source_Name":"CBC News","Author":"Shane Magee","Title":"Moncton affordable housing group undeterred by lack of provincial backing in budget","Description":"A group seeking to build more affordable housing in Moncton says it is undeterred that the $6 million it is seeking from the provincial government wasn't included in the New Brunswick budget released Tuesday.","Published_Date":"2020-03-11","Content":"A group seeking to build more affordable housing in Moncton says it is undeterred that the $6 million it is seeking from the provincial government wasn't included in the New Brunswick budget released Tuesday.The new group was launched to serve as a \"housing… "}
{"Source_Name":"CBC News","Author":"Tori Weldon","Title":"House of Nazareth backtracks on amount homeless will pay for place at shelter","Description":"House of Nazareth officials held a news conference on Thursday to backtrack on the fees they intend to charge people staying at the emergency shelter in Moncton, but they also chastized the critics of the plan.","Published_Date":"2020-03-05","Content":"House of Nazareth officials held a news conference Thursday to backtrack on the fees they intend to charge people staying at the emergency shelter in Moncton and to chastise critics of their plan.Jean Dubé, House of Nazareth executive director, and Nicolas … "}
{"Source_Name":"CBC News","Author":"Tori Weldon","Title":"Affordable and accessible apartments being built, renovated in Moncton","Description":"Six new accessible and affordable apartments are being built in the MacDonald Centre for independent living, and the existing 34 apartments are being renovated with some help from Ottawa's affordable housing strategy.","Published_Date":"2020-03-02","Content":"An announcement on Monday that six new affordable and accessible apartments are being built and 34 more renovated was welcome news at Moncton's MacDonald Centre for Independent Living.The $1.4 million comes from Ottawa's affordable housing strategy.More t… "}
{"Source_Name":"Yahoo.com","Author":"Rotoworld","Title":"Mavrik Bourque looking like a first rounder","Description":"McKeen's Hockey looks at Quebec prospect Mavrik Bourque as well as some over-aged juniors in the Prospects Report (Courtesy of the QMJHL)","Published_Date":"2020-03-03","Content":"As the dust settles from the flurry of activity around the trade deadline, as of March 1st, NHL teams will quietly turn their attention to overage prospects from the CHL that are available to sign to entry level contracts. In this weeks column, Brock Otten pr… "}
{"Source_Name":"CBC News","Author":"Shane Magee","Title":"Prominent lawyer who represented New Brunswick government faces nudity charge","Description":"A lawyer who represented the provincial government on recent high-profile cases and has served as president of the province’s law society is facing three criminal charges.","Published_Date":"2020-03-06","Content":"A lawyer who represented the provincial government on several high-profile cases and served as president of the province's law society is facing criminal charges after consuming mushrooms.Christian Michaud, 48, of Ammon was charged Feb. 21 and is set to app… "}
{"Source_Name":"CBC News","Author":"Hadeel Ibrahim","Title":"Clinic 554 turns down 30 transgender patients because of uncertain future","Description":"A gap in services has been getting wider since Clinic 554 in Fredericton was put up for sale. The short list of doctors comfortable with prescribing hormone therapy for transgender patients became even shorter when Dr. Adrian Edgar stopped taking on new trans…","Published_Date":"2020-03-05","Content":"Karen Woolley was ready to start hormone therapy to physically transition to a woman. She walked into Clinic 554 in Fredericton to see if it received her doctor's referral, but the person at the desk said the clinic had stopped taking patients indefinitely.… "}
{"Source_Name":"Thestar.com","Author":null,"Title":"Moncton Wildcats best Rimouski Oceanic 3-1","Description":"","Published_Date":"2020-03-02","Content":"COLISÉE FINANCIÈRE SUN LIFE, RIMOUSKI, QC Alexander Khovanov had three assists leading the Moncton Wildcats to a 3-1 victory over the Rimouski Océanic in QMJHL action. Jared McIsaac scored two goals for the Wildcats.The first period ended in a 1-1 tie, with… "}
{"Source_Name":"CBC News","Author":"Jacques Poitras","Title":"Discourse on health-care reform too politically charged, says former Horizon board member","Description":"A former member of the Horizon Health Network board says New Brunswickers need to take a hard look at the health-care system and what he says was a sincere attempt to reform it by the Higgs government.","Published_Date":"2020-03-04","Content":"A former member of the Horizon Health Network board says New Brunswickers need to take a hard look at the health-care system and what he says was a sincere attempt to reform it by the Higgs government.Moncton businessman Luigi Rocca says he's worried that t… "}
{"Source_Name":"CBC News","Author":"Sarah Morin","Title":"Snow and freezing rain cancels classes across most of province","Description":"Most schools across the province are closed Tuesday because prolonged periods of snow and freezing rain are expected throughout the day and into Wednesday.","Published_Date":"2020-03-10","Content":"Freezing rain and snow has forced most schools across the province to close Tuesday.Prolonged periods of snow and freezing rain are expected throughout the day and into Wednesday, according to Environment Canada. Northern areas of the province could see u… "}
{"Source_Name":"CBC News","Author":"Elizabeth Fraser","Title":"Health officials in province await outstanding COVID-19 test results","Description":"The province’s acting chief medical officer of health says there are still some outstanding tests that remain for coronavirus in New Brunswick.","Published_Date":"2020-03-05","Content":"The province's acting chief medical officer of health says officials are still awaiting the results of some tests for coronavirus in New Brunswick, but no cases have been confirmed so far.There have been four cases where people have been tested and cleared … "}
{"Source_Name":"Theconversation.com","Author":"Howard Ramos, Professor of Sociology, Dalhousie University, Emma Kay, PhD Student, Department of Sociology and Social Anthropology, Dalhousie University","Title":"Affordable housing: It's not just a big city problem anymore","Description":"In Atlantic Canada, leaders must avoid the mistakes made in the country’s largest cities where people are being pushed out due to high housing prices.","Published_Date":"2020-03-04","Content":"People in Atlantic Canada cities, including Charlottetown, are nervous about rising house prices as young people return and immigration fuels economic growth. (Shutterstock) Awareness of affordability issues and the crunch to find suitable housing has made na… "}
{"Source_Name":"Thestar.com","Author":null,"Title":"Moncton Wildcats clip Acadie-Bathurst Titan 3-2","Description":"","Published_Date":"2020-03-06","Content":"CENTRE RÉGIONAL K.C. IRVING, ACADIE-BATHURST, NB Jeremy McKenna had a goal and an assist leading the Moncton Wildcats to a 3-2 victory over the Acadie-Bathurst Titan in QMJHL action. Tristan Bérubé made 38 saves for the Titan.The Wildcats led 2-1 at the e… "}
{"Source_Name":"CBC News","Author":"Meghan Grant","Title":"Verdict expected in case of MRU student charged in naked, magic mushroom-fulled attack","Description":"A Calgary judge is set to deliver a decision in a complicated case involving a man who was high on mushrooms when he attacked a 68-year-old woman after breaking into her home while naked.","Published_Date":"2020-03-03","Content":"A Calgary judge is set to deliver a decision in a complicated case involving a man who was high on mushrooms when he attacked a 68-year-old woman after breaking into her home while naked.Matthew Brown was a Mount Royal University student when he broke into … "}
{"Source_Name":"CBC News","Author":"Connell Smith","Title":"Workforce report details city of Saint John's employee costs","Description":"The City of Saint John has publicly released a workforce report in the midst of contentious contract negotiations with its three main labour unions.","Published_Date":"2020-03-10","Content":"The City of Saint John has publicly released a workforce report in the midst of contentious contract negotiations with its three main labour unions.Contracts for outside workers, firefighters and police expired at the end of 2019. City negotiators have ti… "}
{"Source_Name":"CBC News","Author":"Gail Harding","Title":"Favourite bus driver gets kidney donation from former bus student","Description":"After waiting almost two years, Miramichi school bus driver Pat Jepson is counting the hours until he receives a new kidney Thursday from Natalie Woods.","Published_Date":"2020-03-09","Content":"After waiting almost two years, Miramichi school bus driver Pat Jepson is counting the hours until he receives a new kidney Thursday.The woman donating her kidney to him is Natalie Woods, also from Miramichi, a former passenger on his bus. Woods says Jepson… "}
{"Source_Name":"CBC News","Author":"Sarah Morin","Title":"Oromocto launches glass recycling pilot project","Description":"The Town of Oromocto launched a four-month pilot project for disposing glass food jars to prevent the recyclable material from ending up in landfills.","Published_Date":"2020-03-11","Content":"The Town of Oromocto has launched a four-month pilot project for disposing of glass food jars to prevent the recyclable material from ending up in landfills. Rayan Environmental Solutions, a glass recycling company based in Moncton, was looking to expand it… "}
{"Source_Name":"CBC News","Author":"Connell Smith","Title":"Workforce report details City of Saint John's employee costs","Description":"The City of Saint John has publicly released a workforce report in the midst of contentious contract negotiations with its three main labour unions.","Published_Date":"2020-03-10","Content":"The City of Saint John has publicly released a workforce report in the midst of contentious contract negotiations with its three main labour unions.Contracts for outside workers, firefighters and police expired at the end of 2019. City negotiators have ti… "}
{"Source_Name":"CBC News","Author":"CBC News","Title":"Minister mum on qualifications of new head of public library service","Description":"Department of Post-Secondary Education, Training and Labour Minister Trevor Holder is defending the controversial appointment of Kevin Cormier as executive director of the New Brunswick Public Library Service.","Published_Date":"2020-03-04","Content":"Department of Post-Secondary Education, Training and Labour Minister Trevor Holder is defending the controversial appointment of Kevin Cormier as executive director of the New Brunswick Public Library Service.But he won't say why Cormier was hired or what m… "}
{"Source_Name":"Thestar.com","Author":"The Canadian Press","Title":"Here’s a quick glance at unemployment rates for February, by Canadian city","Description":"OTTAWA - The national unemployment rate was 5.6 per cent in February. Statistics Canada also released seasonally adjusted, three-month moving average ...","Published_Date":"2020-03-06","Content":"OTTAWA - The national unemployment rate was 5.6 per cent in February. Statistics Canada also released seasonally adjusted, three-month moving average unemployment rates for major cities. It cautions, however, that the figures may fluctuate widely because they… "}
{"Source_Name":"CBC News","Author":"Elizabeth Fraser","Title":"New Brunswickers asked to weigh in on primary health services in their area","Description":"The New Brunswick Health Council is calling on citizens to express their thoughts on health-care services in its Primary Health Survey.","Published_Date":"2020-03-02","Content":"The New Brunswick Health Council is calling on citizens to express their thoughts on health-care services in its Primary Health Survey. In a telephone survey, thousands of residents will be asked about their experience involving primary health-care, which i… "}
{"Source_Name":"CBC News","Author":"Shane Fowler","Title":"New Brunswick's little chapel on wheels","Description":"The air in the tires is a little low, and the paint a bit chipped, but the lights are on at the transport-truck-turned-mobile-chapel whenever a trucker needs some guidance.","Published_Date":"2020-03-06","Content":"The air in the tires is a little low, and the paint a bit chipped, but the lights are on at the transport-truck-turned-mobile-chapel whenever a trucker needs some guidance. For two decades, the 1976 W-Model Ford transport truck has been tucked away behind t… "}
{"Source_Name":"CBC News","Author":"Elizabeth Fraser","Title":"N.B. coronavirus roundup: International travellers barred from long-term care homes","Description":"As the coronavirus outbreak was deemed a pandemic Wednesday by the World Health Organization, and New Brunswick reported its first presumptive case, provincial efforts continued to try to prevent the spread. Here is a roundup of the day's related developments.","Published_Date":"2020-03-11","Content":"As the coronavirus outbreak was deemed a pandemic Wednesday by the World Health Organization, and New Brunswick reported its first presumptive case, provincial efforts continued to try to prevent the spread.Here is a roundup of the day's related development… "}
{"Source_Name":"CBC News","Author":"Gail Harding","Title":"'Tireless advocate of sport' Carl \"Dutchie\" Schell remembered by judo community","Description":"Carl \"Dutchie\" Schell of Saint John is being remembered by former students and friends not only for his love of the sport of judo but for all he did to develop it throughout the province.","Published_Date":"2020-03-02","Content":"Carl \"Dutchie\" Schell of Saint John is being remembered by former students and friends, not only for his love of the sport of judo, but for all he did to develop it throughout the province. Schell died Friday at the age of 95. He is described in his obituar… "}
{"Source_Name":"CBC News","Author":"Elizabeth Fraser","Title":"Sussex students embark on school trip to Italy despite COVID-19 outbreak","Description":"A New Brunswick mayor says he isn't overly worried about a group of high school students travelling to Italy, a European country which has been hardest hit by the cornavirus in recent weeks.","Published_Date":"2020-03-04","Content":"A New Brunswick mayor says he isn't overly worried about a group of high school students travelling to Italy, a European country which has been hardest hit by the coronavirus in recent weeks. A group of close to 30 students from Sussex Regional High School … "}
{"Source_Name":"CBC News","Author":"Elizabeth Fraser","Title":"Province suspends all work-related travel to countries under travel advisories","Description":"The province has suspended all work-related travel to countries where active travel notices have been issued by the federal government due to coronavirus.","Published_Date":"2020-03-06","Content":"The province has suspended all work-related travel to countries where active travel notices have been issued by the federal government due to coronavirus. In an emailed statement to CBC News, countries listed include China, Hong Kong, Iran, Japan, northern … "}
{"Source_Name":"CBC News","Author":"Jacques Poitras","Title":"Daughter of Dennis Oland's defence lawyer was producer of CBC documentary about murder case","Description":"A co-producer of a major documentary series on the Richard Oland murder case broadcast by the CBC is the daughter of Dennis Oland’s lead defence lawyer, CBC News has learned.","Published_Date":"2020-03-06","Content":"A co-producer of a major documentary series on the Richard Oland murder case broadcast by the CBC is the daughter of Dennis Oland's lead defence lawyer, CBC News has learned.The revelation casts a new light on the unprecedented access that the documentary t… "}
{"Source_Name":"CBC News","Author":"Tori Weldon","Title":"Murray Beach Provincial Park not being privatized — yet","Description":"The Department of Tourism will not follow through on its plan to privatize the operation of Murray Beach Provincial Park this spring, citing as reasons the damage from Hurricane Dorian last fall and uncertainty over a union contract.","Published_Date":"2020-03-10","Content":"The Department of Tourism, Culture and Heritage will not follow through on its plan to privatize the operation of Murray Beach Provincial Park this spring.Last spring, the province said it would call for tenders in the fall of 2019, looking for a person or … "}
{"Source_Name":"Thestar.com","Author":"The Canadian Press","Title":"CFL announces its 2020 Touchdown Atlantic game in Halifax has been sold out","Description":"The CFL made the announcement Wednesday, a day after tickets to the July 25 game in Halifax between the Toronto Argonauts and Saskatchewan Roughriders were made available to public.","Published_Date":"2020-03-11","Content":"The CFL’s 2020 edition of Touchdown Atlantic is a sellout, with all 10,000 tickets currently available purchased.The CFL made the announcement Wednesday, a day after tickets to the July 25 game in Halifax between the Toronto Argonauts and Saskatchewan Rough… "}
{"Source_Name":"Ottawacitizen.com","Author":"Taylor Blewett","Title":"'We can't stop living': YOW air travel in the age of coronavirus","Description":"Aside from the odd face mask and a worker vigorously sanitizing the leaves of a potted plant, it looked like a typical Wednesday afternoon at the Ottawa International Airport. Earlier in the day, the World Health Organization officially declared the coronavir…","Published_Date":"2020-03-11","Content":"Aside from the odd face mask and a worker vigorously sanitizing the leaves of a potted plant, it looked like a typical Wednesday afternoon at the Ottawa International Airport.Earlier in the day, the World Health Organization officially declared the coronavi… "}
{"Source_Name":"Nationalobserver.com","Author":"Michael Tutton","Title":"Protecting wetlands and forests can reduce climate adaptation costs","Description":"As Canadian communities brace for rising risks of spring flooding related to climate change, a non-profit group has published findings suggesting preserving wetlands and forests can be key to reducing adaptation costs.","Published_Date":"2020-03-03","Content":"As Canadian communities brace for rising risks of spring flooding related to climate change, a non-profit group has published findings suggesting preserving wetlands and forests can be key to reducing adaptation costs.The Municipal Natural Assets Initiative… "}
{"Source_Name":"Downes.ca","Author":null,"Title":"My 25 Years of Ed Tech","Description":"Stephen Downes, Mar 02, 2020 Martin Weller has released his book 25 Years of Ed Tech. It's a nice read; you are encouraged to check it out. But I have to confess, on having looked at the table of contents,I realized he was also describing my career. Of course…","Published_Date":"2020-03-02","Content":"By Stephen DownesMar 02, 2020Half an HourMartin Weller has released his book 25 Years of Ed Tech today. It's a nice read; you are encouraged to check it out. But I have to confess, on having looked at the table of contents, I thought that it captured my car… "}
{"Source_Name":"Nationalpost.com","Author":"Chris Selley","Title":"Chris Selley: Most Canadians believe Canada is broken and that’s nothing to sneer at","Description":"The Fathers of Confederation might well find consensus on the word 'broken' to describe Canada, 153 years on. Surely 26 million Canadians can’t be wrong","Published_Date":"2020-03-04","Content":"If 69 per cent of Canadians think the country is “broken,” as a DART &amp; Maru\/Blue poll conducted for the National Post suggests, that means it’s not just one kind of Canadian: not just Albertans furious about their landlocked bitumen; not just Quebec natio… "}
{"Source_Name":"Globalnews.ca","Author":"csmithglobal","Title":"Moncton musician's Taiwan tour cancelled amid COVID-19 concerns","Description":"\"These new guidelines issued by the government concerning public gatherings came out and this did not really permit or allow a gathering of over 100 people.\"","Published_Date":"2020-03-06","Content":"A Moncton pianist won’t be travelling to Taiwan to perform later this month after his tour was put on hold due to COVID-19 concerns.Roger Lord, who is also a professor at Université de Moncton, admits he’s disappointed the tour had to be postponed.The nov… "}
{"Source_Name":"Ctvnews.ca","Author":"The Canadian Press","Title":"Canada added 30,300 jobs in February, unemployment rate 5.6 per cent: StatCan","Description":"The unemployment rate in Canada nudged up a tenth of a percentage point to 5.6 per cent as the economy added 30,300 net new jobs in February, Statistics Canada said Friday.","Published_Date":"2020-03-06","Content":"OTTAWA -- The unemployment rate in Canada nudged up a tenth of a percentage point to 5.6 per cent as the economy added 30,300 net new jobs in February, Statistics Canada said Friday.The agency said the gain was led by Quebec, which posted its third consec… "}
{"Source_Name":"CBC News","Author":null,"Title":"'Your journey, your way': The story of Atlantic Canada's first residential hospice","Description":"Bobby's Hospice in Saint John was the first of its kind on the East Coast, and the organization has shared expertise and advice with other residential hospices in the Maritimes over its first 10 years.","Published_Date":"2020-03-08","Content":"Mack MacKenzie vividly remembers the day the pager went off.His partner, Fred Rowe, who had nasopharyngeal cancer, was undergoing an eight-hour surgery in hopes of beating the disease.Two hours in, the pager MacKenzie was given by the surgeons sounded, a … "}
{"Source_Name":"Thesportsdaily.com","Author":"Theresa Ferries","Title":"Stalock stands tall in 3-2 win against Sharks","Description":"The Minnesota State Boys Hockey Tournament is in full swing in St. Paul so that means the Wild are going on a 3-game road trip out to California with the first one this evening in San Jose.  Minnes…","Published_Date":"2020-03-06","Content":"The Minnesota State Boys Hockey Tournament is in full swing in St. Paul so that means the Wild are going on a 3-game road trip out to California with the first one this evening in San Jose.  Minnesota earned a big regulation win over Nashville on Tuesday nigh… "}
{"Source_Name":"Thesportsdaily.com","Author":"Derek Felska","Title":"Wild Earn Important 3-1 Win Over Nashville","Description":"It was a reality check of sorts on Sunday as the Wild experienced what it was like to play a division leader again as Alex Ovechkin lit the lamp twice in the Capitals 4-3 victory over Minnesota.  I…","Published_Date":"2020-03-04","Content":"It was a reality check of sorts on Sunday as the Wild experienced what it was like to play a division leader again as Alex Ovechkin lit the lamp twice in the Capitals 4-3 victory over Minnesota.  It wasn’t a disaster but the team saw first hand how mistakes r… "}
{"Source_Name":"Thesportsdaily.com","Author":"Derek Felska","Title":"Fiala and Rask Clutch for the Wild 5-4 Overtime Win in Anaheim","Description":"Remember earlier in the season when the team had 3 and 4-day layoffs at the beginning of the season?  Remember what it was like to have 2-3 games with a few days in between?  The month of March is …","Published_Date":"2020-03-09","Content":"Remember earlier in the season when the team had 3 and 4-day layoffs at the beginning of the season?  Remember what it was like to have 2-3 games with a few days in between?  The month of March is a grind of back-to-backs and the worst kind are the ones that … "}