{"Source_Name":"BBC News","Author":null,"Title":"Curry scores 23 points in comeback game - but Warriors lose again","Description":"Stephen Curry scores 23 points in 27 minutes in his first match since October as the Golden State Warriors lose 121-113 to the Toronto Raptors.","Published_Date":"2020-03-06","Content":"Stephen Curry was the NBA's Most Valuable Player in 2015 and 2016Stephen Curry scored 23 points in 27 minutes in his first match since October as the Golden State Warriors lost 121-113 to the Toronto Raptors.The three-time NBA champion broke his left hand… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Amber Alert issued for 14-year-old boy allegedly abducted in Toronto - CTV News","Description":"Amber Alert issued for 14-year-old boy allegedly abducted in Toronto CTV News Amber Alert issued for 14-year-old boy last seen near Jane and Driftwood CityNews Toronto Amber Alert issued for 14-year-old Toronto boy police say was abducted CTV News Amber Alert…","Published_Date":"2020-03-05","Content":"TORONTO -- The Toronto Police Service has issued an Amber Alert for a missing 14-year-old boy.Police say Shammah Jolayemi was last seen at approximately 8:25 a.m. ET Wednesday after allegedly being abducted from the area of Jane Street and Driftwood Avenu… "}
{"Source_Name":"Wired","Author":"Flavie Halais","Title":"Is Your Data Being Collected? These Signs Will Tell You Where","Description":"Alphabet's Sidewalk Labs is testing icons that provide “digital transparency” when information is collected in public spaces.","Published_Date":"2020-03-04","Content":"As cities incorporate digital technologies into their landscapes, they face the challenge of informing people of the many sensors, cameras, and other smart technologies that surround them. Few people have the patience to read through the lengthy privacy notic… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Toronto man diagnosed with coronavirus used local transit for three days - The Globe and Mail","Description":"Toronto man diagnosed with coronavirus used local transit for three days The Globe and Mail Man who tested positive for coronavirus rode TTC, Mississauga transit Toronto Star Latest Coronavirus Patient Took TTC and GO Transit for Several Days While Symptomati…","Published_Date":"2020-03-06","Content":"Kirt Browne, left, and Calvin Langille, clean the subway touch points with disinfectant during a visual demo of the enhanced cleaning measures being used by the TTC at the Wilson Yard in North York on March 3, 2020. Passengers who dont show symptoms and are n… "}
{"Source_Name":"Globalnews.ca","Author":"Nick Westoll","Title":"Amber Alert issued for 14-year-old boy last seen in Toronto - Global News","Description":"Amber Alert issued for 14-year-old boy last seen in Toronto Global News Amber Alert issued for 14-year-old boy police say was abducted in Toronto CBC.ca Amber Alert issued for 14-year-old boy 680 News Amber Alert issued for 14-year-old boy Toronto police say …","Published_Date":"2020-03-05","Content":"Officials have issued an Amber Alert for a 14-year-old boy who was allegedly abducted from a home in Toronto.The alert, which was broadcast at around 12 a.m. EST on Thursday, said the boy Shammah Jolayemi was last known to be in the area of Jane Street and … "}
{"Source_Name":"Globalnews.ca","Author":"gabbyrodrigues","Title":"Sudbury man who attended Toronto convention confirmed as Ontario’s 37th coronavirus case - Global News","Description":"Sudbury man who attended Toronto convention confirmed as Ontario’s 37th coronavirus case Global News Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case CP24 Toronto's Breaking News New coronavirus case confirmed in Ontario durhamradione…","Published_Date":"2020-03-10","Content":"Health officials say that a man in his 50s who recently attended a convention in Toronto has been confirmed as the first case of COVID-19 in the Sudbury area, bringing Ontario’s total up to 37.An online statement from Public Health Sudbury &amp; Districts s… "}
{"Source_Name":"Sportsnet.ca","Author":"Chris Johnston","Title":"Maple Leafs have grounded scouts from flying to games amid COVID-19 concerns - Sportsnet.ca","Description":"Maple Leafs have grounded scouts from flying to games amid COVID-19 concerns Sportsnet.ca NHL Highlights | Lightning @ Maple Leafs 3\/10\/20 NHL Toronto-Tampa Bay game a nice playoffs teaser (if they happen) The Globe and Mail SIMMONS: Question not about Leafs:…","Published_Date":"2020-03-11","Content":"The Toronto Maple Leafs have grounded their scouts from flying to games amid growing concerns about the spread of coronavirus, Sportsnet has learned.The team initially stopped air travel for its European-based scouts when the outbreak hit there a couple wee… "}
{"Source_Name":"Reuters","Author":"Jeff Lewis","Title":"Miners avoid handshakes at Toronto meeting over coronavirus fears","Description":"Miners in Toronto for an annual industry dealmaking event slathered on hand sanitizer and avoided handshakes, while Chile's mines minister doled out masks as coronavirus concerns overshadowed buyout buzz and prompted delegates to scrap some events.","Published_Date":"2020-03-02","Content":"TORONTO (Reuters) - Miners in Toronto for an annual industry dealmaking event slathered on hand sanitizer and avoided handshakes, while Chile’s mines minister doled out masks as coronavirus concerns overshadowed buyout buzz and prompted delegates to scrap som… "}
{"Source_Name":"Ctvnews.ca","Author":"Laura Osman","Title":"Canada's top doctor says country ready with co-ordinated response to COVID-19 - CTV News","Description":"A Canadian patient newly diagnosed with COVID-19 recently travelled to Las Vegas and used public transit in Toronto for several days before he was tested for the virus, says the Toronto public health authority.","Published_Date":"2020-03-07","Content":"OTTAWA -- A Canadian patient newly diagnosed with COVID-19 recently travelled to Las Vegas and used public transit in Toronto for several days before he was tested for the virus, says the Toronto public health authority.The man, who is in his 40s, was one… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Toronto police search for suspects who abducted boy in drug-theft retribution - The Globe and Mail","Description":"Toronto police search for suspects who abducted boy in drug-theft retribution The Globe and Mail Toronto teen abducted, sought in Amber Alert reunited with parents, suspects still at large | FULL Global News Abducted 14-year-old boy was found in abandoned Bra…","Published_Date":"2020-03-06","Content":"Toronto's police chief Mark Saunders speaks during a press conference in Toronto on March 6, 2020.Cole Burston\/The Canadian PressHe left for high school on Wednesday morning and didnt return for almost 40 hours.During his absence, the wiry North York te… "}
{"Source_Name":"Financial Post","Author":null,"Title":"PDAC mining conference goers asked to monitor for coronavirus symptoms after Sudbury area man tests positive - Financial Post","Description":"PDAC mining conference goers asked to monitor for coronavirus symptoms after Sudbury area man tests positive Financial Post Sudbury man who attended Toronto conference has COVID-19: health officials CP24 Toronto's Breaking News Coronavirus update: Man from Su…","Published_Date":"2020-03-11","Content":"Anyone who attended the Prospectors &amp; Developers Association of Canada 2020 convention in Toronto is being asked to monitor themselves for symptoms of the coronavirus after a man who attended was tested positive in the Sudbury area.Dr. Penny Sutcliffe, … "}
{"Source_Name":"Torontosun.com","Author":null,"Title":"Maple Leafs' effort better but handed a goalie-dominated 1-0 shootout loss to Kings - Toronto Sun","Description":"Maple Leafs' effort better but handed a goalie-dominated 1-0 shootout loss to Kings Toronto Sun NHL Highlights | Maple Leafs @ Kings 03\/05\/20 NHL Maple Leafs’ Shanahan unwavering in his expectations, even amid tumult Sportsnet.ca Game #68 Review: Los Angeles …","Published_Date":"2020-03-06","Content":"LOS ANGELES — Time for the Maple Leafs to pick up a win in California, isn’t it?The Leafs have one shot left at departing the state with a victory after losing 1-0 in a shootout against the Los Angeles Kings on Thursday night, two nights after losing in San… "}
{"Source_Name":"Cp24.com","Author":"Chris Herhalt","Title":"Ontario confirms three new cases of COVID-19, one more patient recovers - CP24 Toronto's Breaking News","Description":"Ontario confirms three new cases of COVID-19, one more patient recovers CP24 Toronto's Breaking News Person who travelled to Vegas tests positive for coronavirus; Toronto Public Health monitoring Toronto Star Some Ontario hospitals ready to create stand-alone…","Published_Date":"2020-03-05","Content":"Non"}
{"Source_Name":"Mapleleafshotstove.com","Author":"MLHS Staff","Title":"Toronto Maple Leafs vs. Anaheim Ducks – Game #69 Preview & Projected Lines - Maple Leafs Hot Stove","Description":"Toronto Maple Leafs vs. Anaheim Ducks – Game #69 Preview & Projected Lines Maple Leafs Hot Stove Maple Leafs defenceman Cody Ceci returns to lineup vs. Ducks Sportsnet.ca Toronto Maple Leafs: Why 5v5 Production Is More Important than Power-Play Production Edi…","Published_Date":"2020-03-07","Content":"The Toronto Maple Leafs will attempt to salvage three out of a possible six points from the California road trip, but they will need an inspired effort in a tired situation tonight in Anaheim (10 p.m. ET, TSN4).The Leafs have won just one game as a tired te… "}
{"Source_Name":"Ctvnews.ca","Author":"Shawn Jeffords","Title":"Doug Ford says Ontario government travel will continue despite COVID-19 worries - CTV News","Description":"Doug Ford says Ontario government travel will continue despite COVID-19 worries CTV News COVID-19 spurs calls to reduce traffic in Toronto hospitals Global News EDITORIAL: Hallway medicine and COVID-19 Toronto Sun Toronto man who returned from Switzerland is …","Published_Date":"2020-03-10","Content":"TORONTO -- Government travel will continue despite concerns over the spread of the novel coronavirus, Ontario's premier said Tuesday, while his finance minister promised to dedicate the \"necessary resources\" to respond to the health emergency.Doug Ford sa… "}
{"Source_Name":"Globalnews.ca","Author":"mattbingley","Title":"COVID-19 spurs calls to reduce traffic in Toronto hospitals - Global News","Description":"COVID-19 spurs calls to reduce traffic in Toronto hospitals Global News FUREY: It seems the public health system really is working in Canada – for now Toronto Sun Risk of coronavirus remains low - Chirico The North Bay Nugget Toronto man who returned from Swi…","Published_Date":"2020-03-10","Content":"With the number of positive cases of COVID-19 continuing to grow, especially in the Toronto region, preparations are underway to quell the possibility of infection spread within health facilities.Canadas first positive case of COVID-19 saw the patient atten… "}
{"Source_Name":"Cp24.com","Author":"Chris Herhalt","Title":"Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case - CP24 Toronto's Breaking News","Description":"Toronto man who returned from Switzerland is Ontario's 36th COVID-19 case CP24 Toronto's Breaking News Sudbury man who attended Toronto convention confirmed as Ontario’s 37th coronavirus case Global News Ontario's 36th COVID-19 patient is a Toronto man who tr…","Published_Date":"2020-03-10","Content":"Public health officials confirmed one new case of the novel coronavirus in Ontario, involving a Toronto man who recently returned to the province from Switzerland.The news brings Ontarios total case count including recoveries to 36, with five people who hav… "}
{"Source_Name":"Www.tsn.ca","Author":"Mark Masters","Title":"Andersen: Retaliating against Killorn for Leafs net crash would have been bad move - TSN","Description":"Andersen: Retaliating against Killorn for Leafs net crash would have been bad move TSN Should the Maple Leafs have stuck up for Frederik Andersen? Sportsnet.ca A St. Patrick's Pop-Up In Toronto This Weekend Offers Limited-Edition Leafs Jerseys Narcity SIMMONS…","Published_Date":"2020-03-11","Content":"TSN Toronto reporter Mark Masters checks in daily with news and notes on the Maple Leafs. The Leafs practised at Ford Performance Centre on Wednesday ahead of Thursdays game against the Nashville Predators.Midway through the third period on Tuesday night, T… "}
{"Source_Name":"Globalnews.ca","Author":"Nick Westoll","Title":"Toronto teen abducted, sought in Amber Alert has been found safe - Global News","Description":"Toronto teen abducted, sought in Amber Alert has been found safe Global News Police believe boy abducted over stepbrother's drug debt CBC News: The National Amber Alert issued for 14-year-old Toronto boy police say was abducted CTV News Teachers of abducted T…","Published_Date":"2020-03-06","Content":"A 14-year-old Toronto boy who was the subject of a province-wide Amber Alert has been found safe.Toronto police shared the announcement on Twitter at 11:05 p.m. on Thursday. A spokesperson wrote that the teen was en route to have a medical checkup.The ann… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"NHL Highlights | Lightning @ Maple Leafs 3\/10\/20 - NHL","Description":"NHL Highlights | Lightning @ Maple Leafs 3\/10\/20 NHL Maple Leafs show hope of their potential in win over Lightning Sportsnet.ca Ferraro shares something odd he noticed between the benches about the Leafs TSN SIMMONS: Question not about Leafs: Will there even…","Published_Date":"2020-03-11","Content":"Non"}
{"Source_Name":"Bbc.com","Author":"https:\/\/www.facebook.com\/bbcnews","Title":"Toronto teen home safe after brazen abduction - BBC News","Description":"Toronto teen home safe after brazen abduction BBC News Toronto teen abducted, sought in Amber Alert reunited with parents, suspects still at large | FULL Global News Police believe boy abducted over stepbrother's drug debt CBC News: The National Abducted 14-y…","Published_Date":"2020-03-06","Content":"Image copyrightToronto Police handout Image caption Police released this image of the vehicle involved in the abductionA 14-year-old boy believed to have been abducted over his step-brother's multi-million drug debt is home with his parents, Toronto Polic… "}
{"Source_Name":"Engadget","Author":"Christine Fisher","Title":"Uber resumes self-driving car tests on San Francisco streets","Description":"Two years after Uber suspended all self-driving car tests following the death of a pedestrian, it is creeping back onto San Francisco's streets. Today, Uber Advanced Technologies Group (ATG) resumed testing its autonomous vehicles in the city, TechCrunch repo…","Published_Date":"2020-03-10","Content":"The company will reportedly limit testing to a few weeks with two Volvo XC90 vehicles. It will only test during daylight, and a safety driver and co-pilot will be present in each vehicle. Uber is clearly, and understandably, proceeding with caution.Uber ATG… "}
{"Source_Name":"Engadget","Author":"Igor Bonifacic","Title":"Amazon's 'Just Walk Out' tech is coming to airport stores in March","Description":"That didn't take long. One of the first stores in the US to feature Amazon's Just Walk Out checkout-free technology will open on March 16th, one week after the company announced it was licensing the platform to retailers. You'll find the store, a CIBO Express…","Published_Date":"2020-03-11","Content":"OTG, the company that owns and operates the CIBO Express Gourmet Markets chain, says it plans to deploy the technology at additional stores located at LaGuardia and Newark airports. The company operates approximately 100 CIBO Express locations at 10 major air… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"PM Trudeau, Ont. Premier Ford attended same mining conference as Sudbury COVID-19 case - CTV News","Description":"PM Trudeau, Ont. Premier Ford attended same mining conference as Sudbury COVID-19 case CTV News Coronavirus update: Ontario confirms five more cases, investigating whether Sudbury case was community spread Toronto Star Sudbury man who attended Toronto confere…","Published_Date":"2020-03-11","Content":"TORONTO -- Prime Minister Justin Trudeau and Ontario Premier Doug Ford both attended the same conference as a man who tested positive for COVID-19.Ontario Public Health officials have confirmed a positive case of the new coronavirus in a Sudbury, Ont. man… "}
{"Source_Name":"Cp24.com","Author":"The Canadian Press","Title":"Ontario reports three new coronavirus cases, brings province's total to 18 - CP24 Toronto's Breaking News","Description":"Ontario reports three new coronavirus cases, brings province's total to 18 CP24 Toronto's Breaking News LILLEY: Health officials reveal 4 new cases of COVID-19 Sunday in GTA Toronto Sun Coronavirus in Canada: Here’s a timeline of cases across provinces Global…","Published_Date":"2020-03-02","Content":"TORONTO - Ontario is reporting three new cases of the novel coronavirus today, bringing the total in the province to 18.The province's chief medical officer of health, Dr. David Williams, is expected to provide details about the new cases at a news conferen… "}
{"Source_Name":"Globalnews.ca","Author":"Amanda Connolly","Title":"Montreal Liberal MP in self-isolation after attending event with coronavirus patient - Global News","Description":"Montreal Liberal MP in self-isolation after attending event with coronavirus patient Global News Josh Matlow to self-isolate after contact with COVID-19 patient CityNews Toronto Quebec MP in self-isolation after attending event with possible COVID-19 exposure…","Published_Date":"2020-03-09","Content":"Montreal Liberal MP Anthony Housefather says he is in self-isolation “out of an abundance of caution” after attending an event where someone had COVID-19, the illness caused by the novel coronavirus.Housefather confirmed the move to Global News, saying he i… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Exploratory talks between Ontario high school teachers’ union and government break off - The Globe and Mail","Description":"Exploratory talks between Ontario high school teachers’ union and government break off The Globe and Mail Ford government backs down on high school class sizes, e-learning ahead of more Ont. teacher strikes CTV News I'm An Ontario Teacher But I Chose To Go Wh…","Published_Date":"2020-03-04","Content":"Thousands of picketers from the four main teachers' unions march around Queen's Park during a provincewide strike in Toronto on Feb. 21, 2020. Tijana Martin\/The Globe and MailThe union representing high-school teachers has ended informal contract talks wi… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"NHL Highlights | Maple Leafs vs. Kings – Mar. 5, 2020 - SPORTSNET","Description":"NHL Highlights | Maple Leafs vs. Kings – Mar. 5, 2020 SPORTSNET Game #68 Review: Los Angeles Kings 1 vs. Toronto Maple Leafs 0 (SO) Maple Leafs Hot Stove Maple Leafs’ Shanahan unwavering in his expectations, even amid tumult Sportsnet.ca The Maple Leafs’ firs…","Published_Date":"2020-03-06","Content":""}
{"Source_Name":"Globalnews.ca","Author":"Olivia Bowden","Title":"Do you think you have coronavirus symptoms? Here’s who to call first - Global News","Description":"Do you think you have coronavirus symptoms? Here’s who to call first Global News Losing our touch? Some alternative greetings amid coronavirus fears Toronto Star 4 more positive cases of COVID-19 discovered in Ontario CBC.ca Three new cases of COVID-19 confir…","Published_Date":"2020-03-06","Content":"As of March 6, a total of 45 confirmed cases of COVID-19 have been confirmed in Canada, with most occurring in Ontario and B.C.Health officials are continuing to grapple with the new cases and are preparing for the possibility of an outbreak similar to the … "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Tentative deal with Wet’suwet’en Nation won’t stop Coastal GasLink construction, B.C. Premier Horgan says - The Globe and Mail","Description":"Tentative deal with Wet’suwet’en Nation won’t stop Coastal GasLink construction, B.C. Premier Horgan says The Globe and Mail Wet'suwet'en chief says he'll withdraw support for pipeline if his people turn against it CBC.ca Ottawa's offer to recognize Wet'suwet…","Published_Date":"2020-03-03","Content":"Supporters of Wet'suwet'en Nation's hereditary chiefs block the Pat Bay highway as part of protests against the Coastal GasLink pipeline, in Victoria, B.C., on Feb. 26, 2020.KEVIN LIGHT\/ReutersB.C. Premier John Horgan says a weekend deal between Wetsuwete… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Classes cancelled for all Catholic schools, French-language schools in Ottawa and eastern Ontario - CTV News","Description":"Classes cancelled for all Catholic schools, French-language schools in Ottawa and eastern Ontario CTV News Ontario high-school teachers’ union shuts down informal talks with Ford government The Globe and Mail Ford government backs down on high school class si…","Published_Date":"2020-03-05","Content":"OTTAWA -- The union representing English catholic teachers in Ontario says talks with the Province ended Wednesday evening without a deal, meaning their planned, province-wide strike will go ahead.There are expected to be more talks Thursday.Classes wil… "}
{"Source_Name":"Sportsnet.ca","Author":"Luke Fox","Title":"Quick Shifts: Maple Leafs have ‘an elite goal scorer’ on the way - Sportsnet.ca","Description":"Quick Shifts: Maple Leafs have ‘an elite goal scorer’ on the way Sportsnet.ca Game #68 Review: Los Angeles Kings 1 vs. Toronto Maple Leafs 0 (SO) Maple Leafs Hot Stove Maple Leafs’ California catastrophe could haunt them down the line Sportsnet.ca Maple Leafs…","Published_Date":"2020-03-07","Content":"A quick mix of the things we gleaned from the week of hockey, serious and less so, and rolling four lines deep. EBUG-free for 14 days and counting!1. One of the highest-scoring clubs in the league has another one coming.Toronto Maple Leafs prospect Nick R… "}
{"Source_Name":"Www.tsn.ca","Author":"TSN.ca Staff","Title":"MLSE: Ticket refunds will be considered case by case - TSN","Description":"MLSE: Ticket refunds will be considered case by case TSN History of Maple Leafs players to score 50 goals in a season Sportsnet.ca Ferraro shares something odd he noticed between the benches about the Leafs TSN Toronto Maple Leafs: A Look At the Toronto Marli…","Published_Date":"2020-03-10","Content":"Customers of the Toronto Maple Leafs, Raptors and Toronto FC who have coronavirus symptoms and have been quarantined will be considered for ticket refunds on a case-by-case basis, a Maple Leaf Sports &amp; Entertainment spokesman told TSN Senior Correspondent… "}
{"Source_Name":"Ctvnews.ca","Author":"Shawn Jeffords","Title":"Elementary teachers return to bargaining table with province Wednesday - CTV News","Description":"Elementary teachers return to bargaining table with province Wednesday CTV News Ontario elementary teachers returning to bargaining table Toronto Sun Ontario elementary teachers to resume bargaining on Wednesday Global News PICKEL: The case against bigger rai…","Published_Date":"2020-03-09","Content":"TORONTO --  Ontario's elementary teachers are set to resume contract talks with the government on Wednesday, but they're warning that if bargaining doesn't produce an agreement, the union will resume job action after March break.Elementary Teachers' Fed… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Chrystia Freeland calls for ‘whole of country’ response to prevent spread of coronavirus - The Globe and Mail","Description":"Chrystia Freeland calls for ‘whole of country’ response to prevent spread of coronavirus The Globe and Mail Containment efforts will delay, not prevent, COVID-19 outbreak in Canada, Hajdu warns CBC.ca Global National: March 4, 2020 | How Canada is preparing f…","Published_Date":"2020-03-05","Content":"Deputy Prime Minister Chrystia Freeland and Health Minister Patty Hajdu, both seen here at the National Press Theatre in Ottawa on March 4, 2020, said at the news conference that all Canadians have a role to play. Justin Tang\/The Canadian PressDeputy Prim… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"NHL Highlights | Maple Leafs @ Kings 03\/05\/20 - NHL","Description":"NHL Highlights | Maple Leafs @ Kings 03\/05\/20 NHL Maple Leafs’ Shanahan unwavering in his expectations, even amid tumult Sportsnet.ca The Maple Leafs’ first shutout loss of the season — to the worst in the West, no less — exposes weakness up front Toronto Sta…","Published_Date":"2020-03-06","Content":"Extended highlights of the Toronto Maple Leafs at the Los Angeles KingsFor the latest hockey action, subscribe to our channel by clicking the big, red shiny SUBSCRIBE buttonWatch live hockey wherever you are: https:\/\/www.nhl.com\/tvBreaking news, scores,… "}
{"Source_Name":"Sudbury.com","Author":"Arron Pickard","Title":"Call ahead, HSN tells anyone who suspects they have symptoms of COVID-19 - Sudbury.com","Description":"Call ahead, HSN tells anyone who suspects they have symptoms of COVID-19 Sudbury.com Sudbury man who attended Toronto conference has COVID-19: health officials CP24 Toronto's Breaking News Ontario investigates after COVID-19 patient believed to have contracte…","Published_Date":"2020-03-11","Content":"Anyone attending Health Sciences North because they are exhibiting symptoms of COVID-19 are encouraged to call ahead, said the hospital in a news release.In that case, the caller is asked to describe their symptoms and travel history, including countries th… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"RAPTORS AT WARRIORS | FULL GAME HIGHLIGHTS | March 5, 2020 - NBA","Description":"RAPTORS AT WARRIORS | FULL GAME HIGHLIGHTS | March 5, 2020 The Toronto Raptors clinched a playoff spot as they defeated the Golden State Warriors, 121-113. S...","Published_Date":"2020-03-06","Content":"Sign in to report inappropriate content.Sign i"}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Woman who returned to Toronto from US tests positive for COVID-19 | CTV News - CTV News","Description":"Woman who returned to Toronto from US tests positive for COVID-19 | CTV News CTV News Staff and students at Rosedale-area elementary school may have been exposed to individual with COVID-19 CP24 Toronto's Breaking News Three new cases of COVID-19 confirmed in…","Published_Date":"2020-03-08","Content":"TORONTO -- Ontario health officials have confirmed four positive cases of COVID-19 on Sunday, bringing the total number of cases in the province to 32.In a news release, health officials said that the first new patient is a woman in her 60s who returned f… "}
{"Source_Name":"Torontosun.com","Author":null,"Title":"Ontario reports new COVID-19 case, patient had travelled to Las Vegas - Toronto Sun","Description":"Ontario reports new COVID-19 case, patient had travelled to Las Vegas Toronto Sun Chief medical officer of health: We're prepared for COVID-19 in Alberta, you should be too Calgary Herald Coronavirus outbreak: Alberta's first presumptive case was passenger on…","Published_Date":"2020-03-06","Content":"Health officials in Ontario say the latest case of the novel coronavirus in the province involves a patient who had recently travelled to Las Vegas.A spokeswoman for the Ministry of Health says more updates will be provided later in the day.The new case m… "}
{"Source_Name":"Sportsnet.ca","Author":"Associated Press","Title":"Espinal’s two-run homer in ninth leads Blue Jays to win over Yankees - Sportsnet.ca","Description":"Espinal’s two-run homer in ninth leads Blue Jays to win over Yankees Sportsnet.ca Jack Curry on Gerrit Cole's Performance YESNetwork Ninth-inning home run bests Yankees in 4-2 loss to Blue Jays Pinstripe Alley Blue Jays implement new policies at camp amid con…","Published_Date":"2020-03-10","Content":"TAMPA, Fla. — Santiago Espinal hit a two-run homer in the top of the ninth as the Toronto Blue Jays won their fourth straight pre-season baseball game with a 4-2 victory over the New York Yankees in Grapefruit League action Tuesday. Yankees reliever Ben Hel… "}
{"Source_Name":"Dailyhive.com","Author":"Kayla Gladysz","Title":"A gorgeous supermoon rose over Toronto last night (PHOTOS) | News - Daily Hive","Description":"A gorgeous supermoon rose over Toronto last night (PHOTOS) | News Daily Hive Super Worm Moon lights up the night sky The Weather Network 14 photos of last night's stunning 'supermoon' over Victoria (PHOTOS) victoriabuzz.com Super Worm Moon arrives in Glasgow …","Published_Date":"2020-03-11","Content":"Last nights full moon has many names — Crow Moon, Crust Moon, Sap Moon, Sugar Moon, Worm Moon, Lenten Moon, Medin Poya, a Supermoon, and Purnima — but one thing we can all agree to call it is “pretty.”As per NASA, the full supermoon that rose over Toronto o… "}
{"Source_Name":"Canoe.com","Author":null,"Title":"Prince Harry slams Trump in prank call with 'Greta Thunberg,' Russian hoaxers claim - Toronto Sun","Description":"Prince Harry slams Trump in prank call with 'Greta Thunberg,' Russian hoaxers claim Toronto Sun Meghan Markle pays stunning tribute to Princess Diana at Commonwealth Day Service India Today Prince Harry 'duped by Greta Thunberg call,' Russian pranksters say m…","Published_Date":"2020-03-11","Content":"LONDON\/MOSCOW — Russian pranksters say they duped Prince Harry into saying his new life outside the royal family is “much better” and that U.S. President Donald Trump has “blood on his hands” over climate change.Reuters was unable to verify the authenticity… "}
{"Source_Name":"Raptorshq.com","Author":"Josh Kern","Title":"Five thoughts recap: Toronto Raptors 121, Golden State Warriors 113 - RaptorsHQ","Description":"Five thoughts recap: Toronto Raptors 121, Golden State Warriors 113 RaptorsHQ NBA recap: Steph Curry returns, the Rockets lose to the Clippers | Get Up ESPN Raptors clinch playoff spot with win over Warriors TSN Curry on the hardest part of his first game bac…","Published_Date":"2020-03-06","Content":"Well, the Raptors sure caught a break at the end of that one, didnt they? Damion Lee, who had a pretty solid game in the first, oh 47.5 minutes or so, missed two free throws, a wide open three, and then turned the ball over and fouled Norman Powell all with t… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"Woman who returned to Toronto from US tests positive for COVID-19 | CTV News - CTV News","Description":"Ontario health officials have confirmed four positive cases of COVID-19 on Sunday, bringing the total number of cases in the province to 32.","Published_Date":"2020-03-09","Content":"TORONTO -- Ontario health officials have confirmed four positive cases of COVID-19 on Sunday, bringing the total number of cases in the province to 32.In a news release, health officials said that the first new patient is a woman in her 60s who returned f… "}
{"Source_Name":"Sportsnet.ca","Author":"Canadian Press","Title":"Blue Jays right-hander Matt Shoemaker looks good in spring return - Sportsnet.ca","Description":"Blue Jays right-hander Matt Shoemaker looks good in spring return Sportsnet.ca Mitch Keller's spring ERA up to 7.50, Pirates shut out by Blue Jays TribLIVE Pittsburgh Pirates Pitcher Tom Koehler Retires Rum Bunter Pitcher Tom Koehler retires ahead of Pirates …","Published_Date":"2020-03-02","Content":"DUNEDIN, Fla. — Toronto right-hander Matt Shoemaker enjoyed a strong return from a long-term knee injury, leading the Blue Jays to a 4-0 pre-season win over the Pittsburgh Pirates on Monday. Shoemaker, whose 2019 season ended April 20 when he tore his left … "}
{"Source_Name":"Slashdot.org","Author":"msmash","Title":"You Can't Fight City Hall. But Maybe You Can Fight Google.","Description":"Faced with an array of opponents for its sensor-laden city of tomorrow in Toronto, a Google sibling has drastically dialed back plans. The critics now want the tech giant to quit altogether. From a report: The announcement was big enough for Prime Minister Ju…","Published_Date":"2020-03-11","Content":"The announcement was big enough for Prime Minister Justin Trudeau to fly down to Toronto and deliver. A corporate sibling of Google had been selected to transform a largely abandoned port area in Toronto into an innovative, sensor-laden, tech-centric city of … "}
{"Source_Name":"Mashable","Author":"Nicole Gallucci","Title":"Screw it, here are a bunch of stock photos of Babybel cheese","Description":"There are only so many articles about politics and the coronavirus a person can read before having to seek refuge in something else Anything else. Some people attempt to distract themselves from the harsh realities of unsettling news by consuming news-adjacen…","Published_Date":"2020-03-10","Content":"There are only so many articles about politics and the coronavirus a person can read before having to seek refuge in something else. Anything else.Some people attempt to distract themselves from the harsh realities of unsettling news by consuming news-adjac… "}
{"Source_Name":"Www.tsn.ca","Author":"TSN.ca Staff","Title":"Raps' Gasol out tonight vs. Jazz - TSN","Description":"Raps' Gasol out tonight vs. Jazz TSN Raptors’ Nick Nurse faces tough challenges as lineup gets healthy Sportsnet.ca Powell named Eastern player of the week TSN The Raptors’ reserves have earned their spots, even if they’re just in one writer’s heart Toronto S…","Published_Date":"2020-03-09","Content":"Raptors centre Marc Gasol (injury management) is listed as out for Monday night's game in Utah on the NBA's latest injury report.Gasol, who returned to the lineup for the team's game Sunday against the Sacramento Kings, missed the Raptors' previous 15 games… "}
{"Source_Name":"Www.tsn.ca","Author":"TSN.ca Staff","Title":"Leafs G Campbell: 'Jones outplayed me' - TSN","Description":"Leafs G Campbell: 'Jones outplayed me' TSN Leafs sent back to drawing board as defence slips in loss to Sharks Sportsnet.ca Kane scores twice; Sharks snap Maple Leafs' winning streak TSN How the Maple Leafs’ Zach Hyman became the NHL’s most accurate sniper To…","Published_Date":"2020-03-04","Content":"Toronto Maple Leafs goaltender Jack Campbell put part of the blame on himself for Tuesday's 5-2 loss to the San Jose Sharks.Campbell, who was making his first start since Feb. 15, made 33 saves as the Maple Leafs were outshot 38-27.\"I just think (Sharks g… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"High Wire Daredevil Set to Cross Active Volcano - Inside Edition","Description":"High Wire Daredevil Set to Cross Active Volcano Inside Edition Nik Wallenda back on the tightrope tonight Newstalk 610 CKTB (iHeartRadio) Volcano Live! With Nik Wallenda Show Open ABC Nik Wallenda walks 1,800 feet across active volcano in Nicaragua in ABC liv…","Published_Date":"2020-03-04","Content":"Non"}
{"Source_Name":"Globalnews.ca","Author":"Meghan Collie","Title":"Coronavirus can spread on public transit. Here’s what commuters need to know - Global News","Description":"Coronavirus can spread on public transit. Here’s what commuters need to know Global News Woman showing signs of coronavirus rode from Pearson to Richmond Hill, Metrolinx says Toronto Star Coronavirus update ttc.ca Details of the COVID-19 patient's trips on TT…","Published_Date":"2020-03-09","Content":"Amid rising concerns over the rapid spread of the novel coronavirus in Canada, public health officials are reinforcing the importance of good hygiene especially for frequent public transit users.On Sunday, Metrolinx said a woman who tested positive for COVI… "}
{"Source_Name":"Cp24.com","Author":"The Canadian Press","Title":"Toronto market down in early trading to start the week, loonie edges higher - CP24 Toronto's Breaking News","Description":"Toronto market down in early trading to start the week, loonie edges higher CP24 Toronto's Breaking News North American stock markets rally to start the week higher; loonie climbs CTV News The close: TSX jumps almost 300 points, Dow up 1,300 as stocks rally a…","Published_Date":"2020-03-02","Content":"TORONTO -- Canada's main stock index edged lower in early trading as the trading week began following its worst week since the financial crisis.The S&amp;P\/TSX composite index was down 18.36 points at 16,244.69.In New York, the Dow Jones industrial averag… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"LIVE UPDATES: CTV News covers the Democratic presidential primary and Super Tuesday - CTV News","Description":"Follow CTVNews.ca's live blog following the Democratic presidential primary and Super Tuesday.","Published_Date":"2020-03-03","Content":"TORONTO -- Follow CTVNews.ca's live blog following Super Tuesday and the Democratic presidential primary.We'll keep you updated with all the results, including reports on the ground from CTV news correspondents"}
{"Source_Name":"Ctvnews.ca","Author":"Shawn Jeffords","Title":"Teachers' unions move ahead with job action despite new government offer - CTV News","Description":"Teachers' unions move ahead with job action despite new government offer CTV News \"Get back into the classroom,\" Ford tells unions Toronto Sun Two Ontario teachers' unions go ahead with strikes despite new government offer CTV News Jesse Kline: Ford governmen…","Published_Date":"2020-03-06","Content":"TORONTO -- Ontario's premier ramped up criticisms of the province's teachers on Thursday, demanding they resume regular work even as major unions forged ahead with widespread strikes.Doug Ford targetted all four major teachers' unions during debate at the… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Leafs cling on in playoff race despite disastrous road trip - The Globe and Mail","Description":"Leafs cling on in playoff race despite disastrous road trip The Globe and Mail Maple Leafs News & Rumors: Malgin, Power Rankings, Fantasy & Dubas The Hockey Writers Monday Chat: Down the home stretch with 13 games to go Pension Plan Puppets How a rising salar…","Published_Date":"2020-03-09","Content":"Toronto Maple Leafs right wing William Nylander looks on during a loss to the Anaheim Ducks on Mar 6, 2020. Toronto returns home against Tampa Bay on Tuesday after a California trip.Kirby Lee\/USA TODAY Sports via ReutersWith 13 games to go in the regular … "}
{"Source_Name":"Globalnews.ca","Author":"Simon Little","Title":"Elected Wet’suwet’en chief feels shut out of discussion over tentative deal with B.C., feds - Global News","Description":"Elected Wet’suwet’en chief feels shut out of discussion over tentative deal with B.C., feds Global News B.C. students join nationwide school walkout in support of Wet'suwet'en hereditary chiefs CBC.ca Without Indigenous consent for pipelines, experts say ther…","Published_Date":"2020-03-05","Content":"The elected chief of one of six bands within the Wet’suwet’en nation says she and other elected representatives should have been included in recent negotiations over rights and title with the provincial and federal governments.Maureen Luggi is the chief of … "}
{"Source_Name":"Ctvnews.ca","Author":"Laura Osman","Title":"Canada releases coronavirus guidelines on when to cancel major events - CTV News","Description":"Canada releases coronavirus guidelines on when to cancel major events CTV News Federal government to announce supports for people, businesses hit by COVID-19 on Wednesday CBC.ca Ottawa to release unprecedented report into foreign espionage in Canada Toronto S…","Published_Date":"2020-03-11","Content":"OTTAWA -- The Public Health Agency of Canada has posted guidelines aimed at helping event planners figure out whether to cancel mass gatherings of people as the federal government works to quell the potential spread of the novel coronavirus.The next best … "}
{"Source_Name":"Calgaryherald.com","Author":null,"Title":"'A new normal': Alberta confirms seven new COVID-19 cases, four from Calgary area - Calgary Herald","Description":"'A new normal': Alberta confirms seven new COVID-19 cases, four from Calgary area Calgary Herald 7 new cases of COVID-19 found in Alberta CTV News GUNTER: I'm not shrugging off COVID-19, but I'm sure not stockpiling toilet paper Toronto Sun Alberta cases of C…","Published_Date":"2020-03-10","Content":"Alberta’s number of confirmed coronavirus cases doubled Tuesday to 14, including four new cases in the Calgary region.The province’s chief medical officer of health Dr. Deena Hinshaw announced seven new confirmed cases of the COVID-19 virus, which continues… "}
{"Source_Name":"Globalnews.ca","Author":"embensadoun","Title":"What will it take to end blockades? Indigenous community members warn deal may not be enough - Global News","Description":"What will it take to end blockades? Indigenous community members warn deal may not be enough Global News B.C. students join nationwide school walkout in support of Wet'suwet'en hereditary chiefs CBC.ca 'We just have to keep fighting': Winnipeg students walk o…","Published_Date":"2020-03-04","Content":"Members of Canada’s Indigenous communities are warning that a new deal reached by the federal government and Wet’suwet’en hereditary chiefs may not be enough to end rail blockades that have disrupted the country’s economy.The deal is meant to put an end to … "}
{"Source_Name":"Ctvnews.ca","Author":"Carly Yoshida-Butryn","Title":"Protest shuts down major Vancouver intersection | CTV News - CTV News","Description":"Protest shuts down major Vancouver intersection | CTV News CTV News Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action Global News B.C. students join nationwide school walkout in support of Wet'suwet'en hereditary chiefs CB…","Published_Date":"2020-03-04","Content":"VANCOUVER -- A student walkout in support of the Wet'suwet'en hereditary chiefs who oppose a liquefied natural gas pipeline through their traditional territory closed the intersection of West 49th Avenue and Cambie Street in Vancouver during the afternoon r… "}
{"Source_Name":"Lethbridgenewsnow.com","Author":null,"Title":"Three new coronavirus cases in Ontario, pushing provincewide total to 23 - Lethbridge News Now","Description":"Three new coronavirus cases in Ontario, pushing provincewide total to 23 Lethbridge News Now Toronto man rode TTC, GO and MiWay before testing positive for COVID-19 CP24 Toronto's Breaking News Do you think you have coronavirus symptoms? Here’s who to call fi…","Published_Date":"2020-03-07","Content":"News from Peel region came after Ontarios chief medical officer of health announced two other new cases of the virus on Thursday.Dr. David Williams says those cases are a woman who returned to Kitchener, Ont., from Italy and a man who returned to Toronto fr… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Denver cleaning company says business is booming amid COVID-19 outbreak - Denver7 – The Denver Channel","Description":"Denver cleaning company says business is booming amid COVID-19 outbreak Denver7 – The Denver Channel 2 new COVID-19 cases announced in Ontario, bringing provincial number to 37 CBC.ca Colorado Announces 16th & 17th Coronavirus Cases CBS Denver Ontario's 36th …","Published_Date":"2020-03-11","Content":"A Denver cleaning company is seeing an increase in business amidst a concern with the spread of the coronavirus (COVID-19)"}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"North American stock markets rally to start the week higher; loonie climbs - CTV News","Description":"North American stock markets rally to start the week higher; loonie climbs CTV News At midday: TSX reverses early slide and jumps higher The Globe and Mail Toronto market down in early trading to start the week, loonie edges higher CP24 Toronto's Breaking New…","Published_Date":"2020-03-02","Content":"TORONTO -- Canada's main stock index rallied in late-morning trading as it posted a triple-digit gain to start the week following its worst losses since the financial crisis last week.The S&amp;P\/TSX composite index was up 131.20 points at 16,394.25.In … "}
{"Source_Name":"Globalnews.ca","Author":"Heather Yourex-West","Title":"Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action - Global News","Description":"Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action Global News Trudeau urges patience as Wet'suwet'en consider proposed land and title deal CBC.ca Indigenous Canadians concerned about racist backlash over Wet'suwet'en rail …","Published_Date":"2020-03-04","Content":"Gabrielle Lindstrom says the last few weeks have made her sad.The Calgary professor is an Indigenous woman and has been speaking with her students a lot about racism in recent weeks.While she doesn’t believe the tensions surrounding the Wet’suwet’en solid… "}
{"Source_Name":"Ctvnews.ca","Author":null,"Title":"2 people who tested positive for COVID-19 in Florida have died - CTV News","Description":"2 people who tested positive for COVID-19 in Florida have died CTV News 2 patients die from coronavirus in Florida, first U.S. deaths outside West Coast Global News Florida: 2 dead in the state who tested positive for virus Toronto Star Lee Co. sees first 'pr…","Published_Date":"2020-03-07","Content":"MIAMI -- Two people who tested positive for the new coronavirus have died in Florida, marking the first deaths on the East Coast attributed to the outbreak in the U.S., health officials said Friday.Helen Aguirre Ferre, a spokeswoman for Florida Gov. Ron D… "}
{"Source_Name":"CBC News","Author":null,"Title":"COVID-19: Here's what's happening around the world Tuesday - CBC.ca","Description":"COVID-19: Here's what's happening around the world Tuesday CBC.ca While other countries battle mushrooming coronavirus outbreaks, China claims victory is 'not far' The Globe and Mail Coronavirus: China orders travellers quarantined amid outbreak BBC News LILL…","Published_Date":"2020-03-03","Content":"The latest:All travellers entering Beijing from the virus hotspots of South Korea, Japan, Iran and Italy will have to be quarantined for 14 days, the deputy secretary general of the Beijing Municipal Government, Chen Bei, said on Tuesday.Shanghai earlier … "}
{"Source_Name":"Pensionplanpuppets.com","Author":"HardevLad","Title":"Leafs in Cali practice update: Sandin scratched, Rielly and Ceci coming soon - Pension Plan Puppets","Description":"Leafs in Cali practice update: Sandin scratched, Rielly and Ceci coming soon Pension Plan Puppets Why Maple Leafs' stars want to play alongside Zach Hyman Sportsnet.ca Leafs' Rielly, Ceci could return next week TSN The Maple Leafs are back on top of the wave …","Published_Date":"2020-03-02","Content":"This week, the Toronto Maple Leafs are in California for games against the San Jose Sharks, LA Kings, and Anaheim Ducks this Tuesday, Thursday, and Friday. The Leafs flew out on Sunday and had their first practice this afternoon in San Jose. Here is what we l… "}
{"Source_Name":"Ctvnews.ca","Author":"Graham Slaughter","Title":"Canada confirms first 'community case' of COVID-19: Here's what that means - CTV News","Description":"Canada confirms first 'community case' of COVID-19: Here's what that means CTV News 8 more cases of COVID-19 virus identified in B.C., including 1 of unknown origin CBC.ca Coronavirus outbreak: Canadian WHO doctor returns from China with critical COVID-19 les…","Published_Date":"2020-03-06","Content":"TORONTO -- A woman in B.C. has tested positive for COVID-19 despite not having travelled recently and having no known contact with anyone infected with the virus.Until now, all cases in Canada involved individuals who had recently travelled to countries s… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Canadian health officials warn schools of potentially critical role in slowing coronavirus spread - The Globe and Mail","Description":"Canadian health officials warn schools of potentially critical role in slowing coronavirus spread The Globe and Mail B.C. identifies 3 more cases of COVID-19, bringing total to 12 CBC.ca Two new caronavirus cases in Ontario, bringing total to 20 Toronto Sun C…","Published_Date":"2020-03-04","Content":"Theresa Tam, Canadas chief public health officer, seen here in Ottawa on Feb. 3, 2020, has also warned Canadians to prepare for the possibility that schools may need to close. BLAIR GABLE\/ReutersFrom stocking up on hand sanitizer and wipes to cancelling o… "}
{"Source_Name":"Sportsnet.ca","Author":"Associated Press","Title":"Sharks beat Maple Leafs for third straight victory - Sportsnet.ca","Description":"Sharks beat Maple Leafs for third straight victory Sportsnet.ca Leafs prospect Robertson talks trying to make the leap to the NHL TSN GOTTA SEE IT: Mitch Marner Pulls Puck Through His Own Legs Before Scoring Amazing Goal vs. Sharks SPORTSNET How the Maple Lea…","Published_Date":"2020-03-04","Content":"SAN JOSE, Calif. — Evander Kane scored two goals to give the San Jose Sharks their first three-game winning streak since November with a 5-2 victory over the Toronto Maple Leafs on Tuesday night. \"We obviously haven’t had the type of success we wanted this … "}
{"Source_Name":"Ctvnews.ca","Author":"Adam Chan","Title":"'Is this really happening?': Victoria woman aboard quarantined COVID-19 cruise ship - CTV News","Description":"'Is this really happening?': Victoria woman aboard quarantined COVID-19 cruise ship CTV News Coronavirus outbreak: U.S. health officials grapple with surge as Grand Princess waits to dock Global News First Canadian COVID-19 fatality recorded as Ottawa asks pr…","Published_Date":"2020-03-09","Content":"VICTORIA -- A Victoria woman is speaking out about her experience aboard the quarantined Grand Princess cruise ship currently being held off the coast of California due to a coronavirus outbreak on board.Melanie Sibbitt says that the experience has been \"… "}
{"Source_Name":"Bnnbloomberg.ca","Author":"Bloomberg News","Title":"Global stocks sink with crude oil in free fall - BNNBloomberg.ca","Description":"Global stocks sink with crude oil in free fall BNNBloomberg.ca Collapse in oil triggers plunge on stock markets, loonie takes a dive CTV News Collapse in oil triggers plunge on stock markets, loonie takes a dive CP24 Toronto's Breaking News Toronto stocks eye…","Published_Date":"2020-03-09","Content":"U.S. stocks plunged more than 7.5 per cent in the worst day on Wall Street since the financial crisis, as a full-blown oil price war rattled financial markets already on edge over the spreading coronavirus. Treasury yields plummeted, crude sank 20 per cent an… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Tensions Reportedly Run High at Harry and Meghan's Final Royal Reunion - Inside Edition","Description":"Tensions Reportedly Run High at Harry and Meghan's Final Royal Reunion Inside Edition Harry and Meghan’s frigid farewell from royals proves them right to run Toronto Star Prince harry has 'lost his bearings' as Meghan has 'got hold of him' Sky News Australia …","Published_Date":"2020-03-10","Content":"The Fab Four reunion is being described as a PR disaster after Meghan and Harry were given the cold shoulder at Westminster Abbey. Harry and Meghan were reportedly emotional and upset about the decision that barred them from waking in the Queens procession. T… "}
{"Source_Name":"3downnation.com","Author":null,"Title":"Rookie again: Canadian QB Brandon Bridge trading in helmet for police badge - 3downnation.com","Description":"Rookie again: Canadian QB Brandon Bridge trading in helmet for police badge 3downnation.com Canadian Bridge seemingly leaving football to pursue policing career TSN View Full coverage on Google News","Published_Date":"2020-03-06","Content":"Former CFL quarterback Brandon Bridge appears to be moving on from football.The Peel Regional Police announced on Friday that the Toronto native has joined their ranks.Big signing today: @PeelPolice welcome aboard @CFLand @NCAA standout football player Br… "}
{"Source_Name":"Globalnews.ca","Author":"dgoldfinger9","Title":"2 new COVID-19 cases confirmed in Ontario, bringing province’s total to 22 - Global News","Description":"2 new COVID-19 cases confirmed in Ontario, bringing province’s total to 22 Global News Two new coronavirus cases in Ontario, pushing provincewide total to 22 Kamloops Matters Two new cases of COVID-19 confirmed in Ontario, total rises to 22 CTV News Coronavir…","Published_Date":"2020-03-05","Content":"Two new cases of COVID-19 have been confirmed in Ontario, bringing the province’s total number to 22.Of all the cases, the first four in the province have been resolved, with each of those patients testing negative consecutively at least 24 hours apart.A … "}
{"Source_Name":"The Verge","Author":"Jay Peters","Title":"WeChat has been censoring keywords about coronavirus, study finds","Description":"China’s hugely-popular WeChat has been censoring keywords about coronavirus, according to a report published by Citizen Lab. The report also found that popular Chinese livestreaming platform YY has been censoring coronavirus content.","Published_Date":"2020-03-04","Content":"Chinese live-streaming platform YY has also been censoring coronavirus contentIllustration by Alex Castro \/ The VergeChinas most popular messaging app, Tencent-owned WeChat, has been censoring keywords about coronavirus since as early as January 1st, an a… "}
{"Source_Name":"Engadget","Author":"Jon Fingas","Title":"Canada's first 5G network goes live in four cities","Description":"You no longer need to head to the US if you want a taste of 5G in North America. After starting its rollout in January, Rogers has switched on Canada's first live 5G network in the downtown cores of Montreal, Ottawa, Toronto and Vancouver. You'll unsurprising…","Published_Date":"2020-03-06","Content":"You can expect 20 more markets to get 5G this year, Rogers said. At the same time, it'l start using low-band 600MHz access that should both widen coverage and help you stay connected to 5G indoors. It'll eventually start using 3.5GHz service as well as spectr… "}
{"Source_Name":"TechCrunch","Author":"Josh Constine","Title":"SXSW cancels its 400K-person conference due to coronavirus","Description":"SXSW has officially announced it will cancel its tech and music conference slated for March 13th to 22nd in Austin, TX due to concerns around coronavirus. “Based on the recommendation of our public health officer and our director of public health... I’ve gone…","Published_Date":"2020-03-06","Content":"SXSW has officially announced it will cancel its tech and music conference slated for March 13th to 22nd in Austin, TX due to concerns around coronavirus. “Based on the recommendation of our public health officer and our director of public health . . . I’ve g… "}
{"Source_Name":"TechCrunch","Author":"Steve O'Hear","Title":"RTP Global outs new $650M early-stage fund to back tech in US, Europe, India and South-East Asia","Description":"RTP Global, the VC firm founded by Russian entrepreneur and investor Leonid Boguslavsky, is announcing a new $650 million fund to continue backing early-stage tech startups, primarily at Series A but also some late seed deals and Series B. Of note, the VC’s l…","Published_Date":"2020-03-03","Content":"RTP Global, the VC firm founded by Russian entrepreneur and investor Leonid Boguslavsky, is announcing a new $650 million fund to continue backing early-stage tech startups, primarily at Series A but also some late seed deals and Series B.Of note, the VC’s … "}
{"Source_Name":"Cp24.com","Author":"The Canadian Press","Title":"Ontario confirms 24th case of COVID-19; patient returned from Las Vegas - CP24 Toronto's Breaking News","Description":"Ontario confirms 24th case of COVID-19; patient returned from Las Vegas CP24 Toronto's Breaking News Alberta has 1st presumptive case of coronavirus Global News Calgary-area woman likely contracted COVID-19 while aboard cruise ship Calgary Herald Alberta's fi…","Published_Date":"2020-03-06","Content":"Ontario's Ministry of Health says there is a new case of the novel coronavirus in the province.A spokeswoman with the ministry said the patient had recently travelled to Las Vegas.It is considered the province's 24th case of COVID-19.The news comes afte… "}
{"Source_Name":"BBC News","Author":null,"Title":"'I ain't playing if no fans' - LeBron James on possibility of NBA matches being staged behind closed doors","Description":"LeBron James says he would refuse to play if the Los Angeles Lakers had to stage games behind closed doors because of the coronavirus outbreak.","Published_Date":"2020-03-07","Content":"The LA Lakers clinched a spot in the NBA play-offs for the first time since 2013 with victory over the Milwaukee Bucks on FridayLeBron James says he would refuse to play if the Los Angeles Lakers had to stage games behind closed doors because of the coronav… "}
{"Source_Name":"Cheatsheet.com","Author":"Amanda Harding","Title":"Kate Middleton's Red Coat at the Commonwealth Day Service Could Send a Subtle Message to Meghan Markle - Showbiz Cheat Sheet","Description":"Kate Middleton's Red Coat at the Commonwealth Day Service Could Send a Subtle Message to Meghan Markle Showbiz Cheat Sheet Prince harry has 'lost his bearings' as Meghan has 'got hold of him' Sky News Australia Harry and Meghan’s frigid farewell from royals p…","Published_Date":"2020-03-10","Content":"Theres no way Catherine, Duchess of Cambridge could have publicly announced to Meghan, Duchess of Sussex how she felt about her. But sometimes apparel sends a subtle message without words. Is that what Kate was doing with her red jacket choice?Meghan and Ha… "}
{"Source_Name":"Business Insider","Author":"Lisa Eadicicco","Title":"The Collision tech conference has been delayed until next year over coronavirus concerns, becoming the latest major event to be canceled as the virus continues to spread","Description":"The Toronto-based Collision conference has been canceled over coronavirus concerns, coming after other tech events like Google I\/O, Facebook F8, and Mobile World Congress have been canceled. The conference will instead be held virtually this year, while the i…","Published_Date":"2020-03-06","Content":"The Toronto-based Collision tech conference has been delayed until next year over coronavirus-related fears, becoming the latest major conference cancellation to occur over the past several weeks. The conference, which takes place from June 22-25, will occur … "}
{"Source_Name":"Sportsnet.ca","Author":"Associated Press","Title":"Raptors officially clinch playoff berth with victory over Warriors - Sportsnet.ca","Description":"Raptors officially clinch playoff berth with victory over Warriors Sportsnet.ca The Raptors Spoil Steph Curry's Return | NBA on TNT NBA on TNT Raptors clinch playoff spot with win over Warriors TSN Steph Curry expresses his excitement to be back out on the co…","Published_Date":"2020-03-06","Content":"SAN FRANCISCO — Stephen Curry seemed every bit himself after a four-month layoff, save for a little long-range rust. \"He looks exactly the same to me,\" coach Steve Kerr said. Curry scored 23 points for Golden State in his anticipated return from a broken … "}
{"Source_Name":"Fubiz.net","Author":"Manon","Title":"A Pictural Dive into Critical Themes of East Asia","Description":"While holding his first solo exhibition in the Mark Christopher Galery, in Toronto at the end of last year, Peter Chan presented his new series “Ideals and Traditions” to the public. In it, the artist is exploring critical themes of East Asia, inspired by his…","Published_Date":"2020-03-09","Content":"While holding his first solo exhibition in the Mark Christopher Galery, in Toronto at the end of last year, Peter Chan presented his new series “Ideals and Traditions” to the public. In it, the artist is exploring critical themes of East Asia, inspired by his… "}
{"Source_Name":"Workable.com","Author":null,"Title":"Jerry (YC S17) Is Hiring Product Managers (Toronto, SF Bay Area, Remote)","Description":"About jerry.ai Think insurance shopping is painful and time-consuming? We thought so too. That is why we built jerry.ai to create the easiest experience for our users. Enabled by disruptive technologies, jerry.ai aims for the one-click user experi...","Published_Date":"2020-03-02","Content":"Non"}
{"Source_Name":"The Next Web","Author":"Cara Curtis","Title":"Surprise! WeChat is censoring messages about coronavirus in China","Description":"As the Chinese government responds to the coronavirus epidemic, it’s also worked to control what information on the virus is available. Since the beginning of January, WeChat — China’s most popular messaging platform — has been censoring keywords relating to …","Published_Date":"2020-03-04","Content":"As the Chinese government responds to the coronavirus epidemic, its also worked to control what information on the virus is available. Since the beginning of January, WeChat Chinas most popular messaging platform has been censoring keywords relating to the re… "}
{"Source_Name":"Comoxvalleyrecord.com","Author":"The Canadian Press","Title":"‘Incredibly thoughtful, compassionate’: B.C.’s Dr. Bonnie Henry resolves to ‘break’ COVID-19 - Comox Valley Record","Description":"‘Incredibly thoughtful, compassionate’: B.C.’s Dr. Bonnie Henry resolves to ‘break’ COVID-19 Comox Valley Record View Full coverage on Google News","Published_Date":"2020-03-08","Content":"At the end of a stark news conference during which Dr. Bonnie Henry wiped tears as she broke the news confirming diagnosis of two cases of COVID-19 transmission at a North Vancouver long-term care home, she worried she was about to frighten her parents.Brit… "}
{"Source_Name":"Interior-news.com","Author":"The Canadian Press","Title":"‘Incredibly thoughtful, compassionate’: B.C.’s Dr. Bonnie Henry resolves to ‘break’ COVID-19 - Smithers Interior News","Description":"‘Incredibly thoughtful, compassionate’: B.C.’s Dr. Bonnie Henry resolves to ‘break’ COVID-19 Smithers Interior News View Full coverage on Google News","Published_Date":"2020-03-08","Content":"At the end of a stark news conference during which Dr. Bonnie Henry wiped tears as she broke the news confirming diagnosis of two cases of COVID-19 transmission at a North Vancouver long-term care home, she worried she was about to frighten her parents.Brit… "}
{"Source_Name":"Montrealgazette.com","Author":null,"Title":"Despite draft deal in B.C., Kahnawake barricade isn't coming down just yet - Montreal Gazette","Description":"Despite draft deal in B.C., Kahnawake barricade isn't coming down just yet Montreal Gazette Kahnawake rail blockade remains in place after draft agreement reached Global News Ken Deer gives Kahnawake blockade update Montreal Gazette Kahnawake rail barricade t…","Published_Date":"2020-03-02","Content":"For the time being, Mohawk activists in Kahnawake will maintain a rail barricade that has been in place for more than three weeks — despite a proposed deal announced Sunday between Wetsuweten hereditary chiefs and federal and provincial governments to resolve… "}
{"Source_Name":"Ctvnews.ca","Author":"Jackie Dunham","Title":"Final spring forward: Yukoners to end seasonal time changes - CTV News","Description":"Final spring forward: Yukoners to end seasonal time changes CTV News Yukon to make Daylight Saving Time permanent after final time change Sunday Global News Yukon to stay on daylight time as territory scraps seasonal time change CBC.ca Yukon Will No Longer Ch…","Published_Date":"2020-03-05","Content":"TORONTO -- Yukoners will be changing their clocks for the last time this weekend after the government announced the territory will no longer participate in seasonal time changes.On Sunday, Yukon residents will adjust their clocks an hour forward for the a… "}
{"Source_Name":"Wired","Author":"Howard Markel","Title":"With Covid-19, Tech Is Making History Repeat Itself","Description":"As the coronavirus spreads, globalization and tech are amplifying every major theme of pandemics past: secrecy, scapegoating, sell-offs, and much more.","Published_Date":"2020-03-04","Content":"I have been a professional epidemic watcher for nearly 30 years. Ive researched seven centuries of pandemics. Yet ever since late January, I have been gobsmacked by the Covid-19 crisis. This surreal disbelief began with the news of China imposing a draconian … "}
{"Source_Name":"Montrealgazette.com","Author":null,"Title":"Canadiens at Lighting: Five things you should know - Montreal Gazette","Description":"Canadiens at Lighting: Five things you should know Montreal Gazette Habs' Tatar (UBI) flying back to Montreal TSN Luongo's first Panthers win | Retro Recap | Lightning vs Panthers NHL Canadiens’ Tomas Tatar returning to Montreal for further evaluation Sportsn…","Published_Date":"2020-03-05","Content":"TAMPA, Fla. — Here are five things you should know about Thursday’s game between the Canadiens (31-28-9) and the Tampa Bay Lightning (41-20-5) at Amalie Arena (7 p.m., TSN2, RDS, TSN 690 Radio, 98.5 FM).Habs on a roll: The Canadiens are on a two-game winnin… "}
{"Source_Name":"The Globe And Mail","Author":null,"Title":"Bank of Canada rate cut will put already hot real estate market 'on steroids' - The Globe and Mail","Description":"Bank of Canada rate cut will put already hot real estate market 'on steroids' The Globe and Mail Bank of Canada lowers overnight rate target to 1 ¼ percent Bank of Canada Bank of Canada cuts key interest rate target to 1.25 per cent CTV News Now is the worst …","Published_Date":"2020-03-04","Content":"A home that is sold is photographed along Runnymede Rd. in Toronto on Wednesday, March 4, 2020. Tijana Martin\/The Globe and MailThe Bank of Canadas interest-rate cut threatens to overheat the countrys booming housing markets, making it easier for home buy… "}
{"Source_Name":"Financial Post","Author":null,"Title":"Posthaste: Canadian oil prices already below US$28; Canadian Natural, Suncor and Cenovus see double-digit declines amid 'bloodshed' - Financial Post","Description":"Posthaste: Canadian oil prices already below US$28; Canadian Natural, Suncor and Cenovus see double-digit declines amid 'bloodshed' Financial Post View Full coverage on Google News","Published_Date":"2020-03-09","Content":"Good Morning!Spurned by Russia last week, Saudi Arabia has unleashed an all-out war on rival producers with plans to raise its crude oil production significantly above 10 million barrels per day in April, at a time of demand destruction.Riyadh and its OPE… "}
{"Source_Name":"Kotaku.com","Author":"Brian Ashcraft","Title":"Artist Quits Game Industry For Tattooing","Description":"For two decades, the artist known as Maggi has worked in South Korea’s game industry as an illustrator and art director. Now, she finally quit her day job and is focusing on her new love: tattoos. Read more...","Published_Date":"2020-03-03","Content":"Kotaku EastEast is your slice of Asian internet culture, bringing you the latest talking points from Japan, Korea, China and beyond. Tune in every morning from 4am to 8am.For two decades, the artist known as Maggi has worked in South Koreas game industry as… "}
{"Source_Name":"Espn.com","Author":null,"Title":"Five questions for the OWL Washington homestand","Description":"Here's what to watch for when the OWL returns to D.C. this weekend.","Published_Date":"2020-03-06","Content":"The Overwatch League is coming to D.C., with the Washington Justice hosting their second OWL homestand this Saturday and Sunday.The event will feature three top-10 teams with matches on Sunday in the No. 3 Philadelphia Fusion, No. 5 New York Excelsior and N… "}
{"Source_Name":"Ctvnews.ca","Author":"Rachel Gilmore","Title":"Tory leadership candidate's climate plan is to 'drill, drill, build pipelines' and 'adapt' - CTV News","Description":"Tory leadership candidate's climate plan is to 'drill, drill, build pipelines' and 'adapt' CTV News Conservative leadership candidate Jim Karahalios pledges to kill carbon tax, exit Paris deal CBC.ca MacKay a front-runner for Tory leadership race, but half of…","Published_Date":"2020-03-05","Content":"OTTAWA -- Conservative Leadership Candidate Jim Karahalios says his environmental plan would be to \"drill, drill, build pipelines\" and \"adapt.\"During an episode of CTV Power Play on Wednesday, host Evan Solomon asked Karahalios how he would get pipelines … "}
{"Source_Name":"Thepointsguy.com","Author":"Mike Arnot","Title":"This is why you can’t fly to LaGuardia from Toronto’s convenient island airport","Description":"Porter Airlines is a godsend for travel to Toronto from New York, Boston or Chicago. Its main hub, Billy Bishop Toronto City Airport or YTZ, is on an island adjacent to downtown Toronto. But the airport experience in New York isn’t quite as pleasant as the vi…","Published_Date":"2020-03-10","Content":"Porter Airlines is a godsend for travel to Toronto from New York, Boston or Chicago. Its main hub, Billy Bishop Toronto City Airport or YTZ, is on an island adjacent to downtown Toronto.But the airport experience in New York isn’t quite as pleasant as the v… "}