{"Source_Name":"Lifehacker.com","Author":"Micaela Heck","Title":"How to Stop Procrastinating, With Behavior Scientist BJ Fogg","Description":"Do you put things off ‘til the last minute? Are you one of the millions who tend to delay getting to your to-do list? Then you’re in luck—behavior scientist BJ Fogg joins us on this episode to talk about how to stop procrastinating thanks to his researched ap…","Published_Date":"2020-03-03","Content":"Do you put things off til the last minute? Are you one of the millions who tend to delay getting to your to-do list? Then youre in luckbehavior scientist BJ Fogg joins us on this episode to talk about how to stop procrastinating thanks to his researched appro… "}
{"Source_Name":"CNN","Author":"Francisco Guzman and Brian Ries, CNN","Title":"Bars near one university are giving women a secret way to signal if they feel unsafe","Description":"The Florida Atlantic University Student Government created posters to hang in local bars and restaurants to give women a secret way to alert bartenders if they're in danger or on an uncomfortable date.","Published_Date":"2020-03-06","Content":"Non"}
{"Source_Name":"TechCrunch","Author":"Steve O'Hear","Title":"AudioTelligence raises $8.5M Series A to bring its ‘autofocus for sound’ to voice assistants","Description":"AudioTelligence, a startup that spun out of University of Cambridge-funded CEDAR Audio, has raised $8.5 million in Series A funding for its “autofocus for sound”. Leading the round is Octopus Ventures, with participation from existing investors Cambridge Inno…","Published_Date":"2020-03-02","Content":"AudioTelligence, a startup that spun out of University of Cambridge-funded CEDAR Audio, has raised $8.5 million in Series A funding for its “autofocus for sound”.Leading the round is Octopus Ventures, with participation from existing investors Cambridge Inn… "}
{"Source_Name":"TechCrunch","Author":"Megan Rose Dickey","Title":"Inside the effort to turn startups into zebras, not unicorns","Description":"The priorities of venture capitalists don’t always align with those of startup founders and their workers. That’s why we’ve started to see more conversation and activity around cooperatives and the idea of Exiting to Community, spearheaded by Nathan Schneider…","Published_Date":"2020-03-05","Content":"The priorities of venture capitalists don’t always align with those of startup founders and their workers.That’s why we’ve started to see more conversation and activity around cooperatives and the idea of Exiting to Community, spearheaded by Nathan Schneide… "}
{"Source_Name":"TechCrunch","Author":"Danny Crichton","Title":"Stanford cancels classes in response to novel coronavirus outbreak","Description":"Following on the heels of several major cancellations of events the past few days, including the SXSW conference in Austin and the tech conference SaaStr, Stanford University, which is located in the heart of Silicon Valley in Palo Alto, California, announced…","Published_Date":"2020-03-07","Content":"Following on the heels of several major cancellations of events the past few days, including the SXSW conference in Austin and the tech conference SaaStr, Stanford University, which is located in the heart of Silicon Valley in Palo Alto, California, announced… "}
{"Source_Name":"TechCrunch","Author":"Natasha Mascarenhas","Title":"Coursedog lands $4.2 million to make class scheduling smarter","Description":"Two years ago, dormmates Justin Wenig and Nicholas Diao struggled to get into a popular computer science class at Columbia University. The duo eventually got into that class, but after the initial frustration around class scheduling, they decided “it was an o…","Published_Date":"2020-03-09","Content":"Two years ago, dormmates Justin Wenig and Nicholas Diao struggled to get into a popular computer science class at Columbia University . The duo eventually got into that class, but after the initial frustration around class scheduling, they decided it was an o… "}
{"Source_Name":"CNN","Author":"Carma Hassan and Brian Ries, CNN","Title":"Harvard wants students to move out in 5 days over coronavirus fears","Description":"Harvard University is moving to virtual classes for the rest of the school year because of the novel coronavirus outbreak and students have five days to move out of their dorms.","Published_Date":"2020-03-10","Content":"Non"}
{"Source_Name":"Gizmodo.com","Author":"Matt Novak","Title":"Here's Every New Coronavirus Case Reported in the U.S. Over the Past 24 Hours","Description":"The U.S. reported 21 new coronavirus cases during the past 24 hours, as the number of infected continues to climb. At least nine people have died from COVID-19 in the U.S., all in the state of Washington, and there are currently at least 129 cases of the dise…","Published_Date":"2020-03-04","Content":"The U.S. reported 21 new coronavirus cases during the past 24 hours, as the number of infected continues to climb. At least nine people have died from COVID-19 in the U.S., all in the state of Washington, and there are currently at least 129 cases of the dise… "}
{"Source_Name":"Gizmodo.com","Author":"Tom McKay","Title":"Encryption Flaws Leave Millions of Toyota, Kia, and Hyundai Cars Vulnerable to Key Cloning","Description":"Millions of cars with radio-enabled keys made by Toyota, Hyundai, and Kia may be vulnerable to hijacking thanks to a flaw in their encryption implementation, Wired reported this week, citing the results of a KU Leuven in Belgium and University of Birmingham s…","Published_Date":"2020-03-05","Content":"Millions of cars with radio-enabled keys made by Toyota, Hyundai, and Kia may be vulnerable to hijacking thanks to a flaw in their encryption implementation, Wired reported this week, citing the results of a KU Leuven in Belgium and University of Birmingham s… "}
{"Source_Name":"Slashdot.org","Author":"EditorDavid","Title":"University of California Students Strike To Protest Graduate Student Pay","Description":"There's more than 280,000 students in the prestigious University of California system, spread throughout 10 campuses across the state. But now \"a growing number\" of students and faculty members are walking out of classes and holding rallies, reports the Los A…","Published_Date":"2020-03-09","Content":"During widespread U.C. campus demonstrations, students filled the Janss Steps at UCLA, Sproul Plaza at U.C. Berkeley and Cheadle Hall at U.C. Santa Barbara on Thursday and other pickets unfolded on Friday. At Santa Cruz -- where the protests began three month… "}
{"Source_Name":"Lifehacker.com","Author":"Brendan Hesse","Title":"Playing This Free Game Might Help Find a Coronavirus Cure","Description":"Want to help researchers understand and find a vaccine for the coronavirus? Help them out by playing this video game. Read more...","Published_Date":"2020-03-05","Content":"Want to help researchers understand and find a vaccine for the coronavirus? Help them out by playing this video game.Foldit is a free puzzle game that tasks players with folding protein chains to change the way they behave. It was originally created by deve… "}
{"Source_Name":"Mashable","Author":"Nikolay Nikolov","Title":"By just thinking about it, amputees move robot hands with unprecedented precision","Description":"In a major breakthrough in prosthetics, researchers at the University of Michigan have been able to amplify nerve signals from residual limbs using tiny muscle grafts. The improved connection means bionic limbs pick up clearer signals from the human brain and…","Published_Date":"2020-03-10","Content":"In a major breakthrough in prosthetics, researchers at the University of Michigan have been able to amplify nerve signals from residual limbs using tiny muscle grafts. The improved connection means bionic limbs pick up clearer signals from the human brain a… "}
{"Source_Name":"Entrepreneur.com","Author":"Jessica Thomas","Title":"Where Did the Most Billionaires Go to College, and What Did They Study? (Infographic)","Description":"One U.S. university leads the pack.","Published_Date":"2020-03-10","Content":"March10, 20202 min readThe narrative of the college dropout who became an insanely successful startup founder is one that’s entrepreneurial lore. Mark Zuckerberg, Bill Gates, Steve Jobs and Theranos founder Elizabeth Holmes all dropped out of undergrad,… "}
{"Source_Name":"Gizmodo.com","Author":"Andrew Liszewski","Title":"Wearing This New Infrared Camouflage Will Keep You Hidden From a Predator's Thermal Vision","Description":"You can cover yourself from head to toe in fatigues or dark clothing, but it’s nearly impossible to hide from a thermal camera that can see the invisible infrared radiation your body emits. Or is it? Researchers from the University of San Diego have created a…","Published_Date":"2020-03-04","Content":"Gif: University of California San Diego (YouTube)You can cover yourself from head to toe in fatigues or dark clothing, but its nearly impossible to hide from a thermal camera that can see the invisible infrared radiation your body emits. Or is it? Researche… "}
{"Source_Name":"Ctvnews.ca","Author":"Andrew Weichel","Title":"Vancouver university temporarily closed over 'possible student exposure' to COVID-19 - CTV News","Description":"Vancouver university temporarily closed over 'possible student exposure' to COVID-19 CTV News University Canada West closes Vancouver campus following presumptive case of COVID-19 Global News View Full coverage on Google News","Published_Date":"2020-03-05","Content":"VANCOUVER -- A small private university in downtown Vancouver is closing its campus for three days after learning two students may have been exposed to COVID-19.University Canada West announced Thursday the students have both been placed in isolation and … "}
{"Source_Name":"Slashdot.org","Author":"msmash","Title":"Stanford, Others Switch To Online Classes Temporarily Amid Coronavirus Fears","Description":"Stanford University canceled in-person classes for the final two weeks of the quarter, switching to online instruction amid rising concern about the coronavirus outbreak. From a report: As the coronavirus first reported in China spreads in the United States, …","Published_Date":"2020-03-09","Content":"As the coronavirus first reported in China spreads in the United States, several schools have taken this step as a precaution, hoping to avoid further infections on campus. The University of Washington, which has more than 55,000 students on three campuses, a… "}
{"Source_Name":"CNN","Author":"Eric Levenson and Chris Boyette, CNN","Title":"Universities in Washington, California and New York cancel in-person classes","Description":"American universities from California to New York have canceled classes as the novel coronavirus has affected more than 100,000 people and transformed into what CNN is calling a pandemic.","Published_Date":"2020-03-09","Content":"(CNN)American universities from California to New York have canceled classes as the novel coronavirus has affected more than 100,000 people and transformed into what CNN is calling a pandemic.The cancellations have been focused in states and areas hardest h… "}
{"Source_Name":"Yahoo.com","Author":"Associated Press","Title":"VA moves to suspend new GI bill enrollment at 5 universities","Description":"The Department of Veterans Affairs is moving to bar new GI Bill students from enrolling at five universities, citing \"advertising, sales or enrollment practices that are erroneous, deceptive or misleading.” The schools were identified as the University of Pho…","Published_Date":"2020-03-09","Content":"WASHINGTON (AP) The Department of Veterans Affairs is moving to bar new GI Bill students from enrolling at five universities, citing \"advertising, sales or enrollment practices that are erroneous, deceptive or misleading.The schools were identified as the U… "}
{"Source_Name":"Wired","Author":"Megan Molteni","Title":"Kids Can Get Covid-19. They Just Don't Get That Sick","Description":"New data suggests that children aren’t immune to the new coronavirus. That could have huge implications for efforts to contain local outbreaks.","Published_Date":"2020-03-07","Content":"The data stops short of explaining why children develop a milder form of illness. But older research conducted on the SARS-CoV-2 virus genetic relative, the coronavirus that caused the 2002-2003 SARS outbreak, lends some clues. It also ravaged adults more tha… "}
{"Source_Name":"Globalnews.ca","Author":"jonazpiri","Title":"University Canada West closes Vancouver campus following presumptive case of COVID-19 - Global News","Description":"University Canada West closes Vancouver campus following presumptive case of COVID-19 Global News COVID-19 precautions close Vancouver business school for 3-day disinfection CBC.ca Vancouver university temporarily closed over 'possible student exposure' to CO…","Published_Date":"2020-03-05","Content":"A private Vancouver university says it has closed its doors after identifying a student with a presumptive case of COVID-19.In a statement, University Canada West said the “student had been visited by their father who has positively been tested for COVID-19… "}
{"Source_Name":"Engadget","Author":"Jon Fingas","Title":"Coronavirus home testing kits are coming to Seattle","Description":"It might soon be much easier and safer to determine if someone has been infected by the novel coronavirus. The team behind a Gates Foundation-backed project told the Seattle Times that it's preparing to deliver home testing kits for the virus to Seattle (wher…","Published_Date":"2020-03-09","Content":"The test will let people stay at home and reduce the chances of spreading the virus. At the same time, it could also improve the turnaround by processing large numbers of tests in a relatively short space of time. The Gates Foundation's Scott Dowell estimated… "}
{"Source_Name":"ABC News","Author":"LARRY LAGE Associated Press","Title":"University won't change investigation into abuse","Description":"The University of Michigan says it will not change the way it is handling the investigation into allegations of sexual abuse by a late doctor at the University of Michigan","Published_Date":"2020-03-06","Content":"ANN ARBOR, Mich, -- The University of Michigan said Friday that it will not change the way it is handling the investigation into allegations of decades of sexual abuse by a late doctor at the school.The statement came in response to calls by accusers and … "}
{"Source_Name":"Engadget","Author":"Rachel England","Title":"Scientists develop neuroprosthetic tech that amputees don't need to learn","Description":"For those working in the field of neuroprosthetics, the ultimate goal is to give amputees with artificial limbs natural, intuitive and real-time movement. Indeed, advances in the field have led to mind-controlled systems and even those that create kinaestheti…","Published_Date":"2020-03-05","Content":"One of the biggest challenges in mind-controlled prosthetics is finding a strong and stable enough nerve signal to attach to the bionic limb. Scientists already know that peripheral nerves – the network of tiny nerves that fan out to the spinal cord and brain… "}
{"Source_Name":"Mashable","Author":"Natasha Piñon","Title":"Oxford Dictionary's definition of \"woman\" might soon get less offensive","Description":"Woman. Noun. An adult human female. That's benign enough of a dictionary definition. Dig deeper into Google's definition of the word \"woman,\" though, and you'll find some let's just say outdated, language: Words like \"bitch,\" \"maid,\" and \"frail\" all currently…","Published_Date":"2020-03-04","Content":"Woman. Noun. An adult human female. That's benign enough of a dictionary definition. Dig deeper into Google's definition of the word \"woman,\" though, and you'll find some let's just say outdated, language: Words like \"bitch,\" \"maid,\" and \"frail\" all current… "}
{"Source_Name":"Yahoo.com","Author":"KABC – Los Angeles","Title":"10 CSULB students in self-quarantine for possible coronavirus exposure","Description":"Ten Cal State University Long Beach students are in self-quarantine due to concerns of possible exposure to the novel coronavirus, the university announced.","Published_Date":"2020-03-09","Content":"Ten Cal State University Long Beach students are in self-quarantine due to concerns of possible exposure to the novel coronavirus, the university announced"}
{"Source_Name":"Reuters","Author":"Reuters Editorial","Title":"Harvard to move to virtual classes amid coronavirus outbreak","Description":"Harvard University asked its students on Tuesday not to return to campus after Spring Break and said it would begin moving to virtual instruction for graduate and undergraduate classes amid the coronavirus outbreak.","Published_Date":"2020-03-10","Content":"(Reuters) - Harvard University asked its students on Tuesday not to return to campus after Spring Break and said it would begin moving to virtual instruction for graduate and undergraduate classes amid the coronavirus outbreak. The university’s goal is to c… "}
{"Source_Name":"Mashable","Author":"Mark Kaufman","Title":"This cyclone is soaking Southern California with welcome rain","Description":"A big, spinning storm has moved over Southern California, and will douse the region in much needed rain. Seen in the satellite image above, it's a common winter storm, called a mid-latitude cyclone, rotating counter-clockwise like a whirlpool. It will shower …","Published_Date":"2020-03-10","Content":"A big, spinning storm has moved over Southern California, and will douse the region in much needed rain. Seen in the satellite image above, it's a common winter storm, called a mid-latitude cyclone, rotating counter-clockwise like a whirlpool. It will showe… "}
{"Source_Name":"Venturebeat.com","Author":"Dean Takahashi","Title":"Coronavirus inspires University of Washington to create protein-folding puzzle game","Description":"To fight off the coronavirus, the University of Washington has launched a puzzle game that challenges you to build a protein that could stop COVID-19.","Published_Date":"2020-03-03","Content":"To address the coronavirus, the University of Washington has launched a puzzle game that challenges you to build a protein that could stop COVID-19 (the viruss official name) from attacking human cells.The game is available on Foldit, a website that the Cen… "}
{"Source_Name":"Npr.org","Author":"Jon Hamilton","Title":"When Coronavirus Struck Seattle, This Lab Was Ready To Start Testing","Description":"Scientists at the University of Washington's medical school began working on a test for coronavirus back in January. Now they're using it to fight an outbreak in their own backyard.","Published_Date":"2020-03-05","Content":"\"Access to testing is really the major tool we have right now to fight this new coronavirus,\" says Dr. Keith Jerome, who runs a University of Washington lab in Seattle that can now test for the virus.Jonathan Hamilton\/NPRIt's been a busy week at the virol… "}
{"Source_Name":"ABC News","Author":"The Associated Press","Title":"University of Michigan replaces law firm in abuse inquiry","Description":"The University of Michigan is replacing the law firm pegged to lead the investigation into allegations that a deceased team doctor molested hundreds of people","Published_Date":"2020-03-08","Content":"ANN ARBOR, Mich, -- The University of Michigan said it is replacing the law firm pegged to lead the investigation into allegations a deceased team doctor molested hundreds of people after learning that some of its attorney represented high-profile clients a… "}
{"Source_Name":"Business Insider","Author":"Joey Hadden","Title":"Here are all the major US colleges and universities who have switched to remote classes to prevent the spread of the coronavirus","Description":"Classes are being held online across the US to prevent the spread of the novel coronavirus. The new coronavirus originated in Wuhan, China, and has killed about 3,900 people and infected more than 111,000 as of Monday. Some universities, like Rice, are shifti…","Published_Date":"2020-03-09","Content":"Non"}
{"Source_Name":"Boingboing.net","Author":"Mark Frauenfelder","Title":"Harvard is telling all students to stay home after spring break","Description":"Harvard University told its 20,000 students not to return to campus after spring break concludes on March 23. They'll be given online classes instead. From MIT Technology Review : Harvard said the move to online classes is meant to avoid large gatherings and …","Published_Date":"2020-03-10","Content":"Gougers have until March 15 to resell face mask in Japan. After that they face a fine and imprisonment. From Japan Times: In a prominent example of price-gouging, an assemblyman in Shizuoka Prefecture was revealed to have made ¥8.9 million off of selling pack… "}
{"Source_Name":"USA Today","Author":"USA TODAY, Chris Bumbaca, USA TODAY","Title":"Chicago State, UMKC cancel basketball games against Seattle U as precaution against coronavirus","Description":"Chicago State, University of Missouri-Kansas City men's basketball teams canceled games at Seattle University this week due to coronavirus concerns.","Published_Date":"2020-03-04","Content":"What teams are rising and falling as March madness is quickly approaching.USA TODAYChicago State became the first Division I men's basketball program to cancel games due to the coronavirus outbreak, announcing on Tuesday the decision not to travel to Seat… "}
{"Source_Name":"Gizmodo.com","Author":"Andrew Liszewski","Title":"Great, Even the Table Your Phone Is Sitting On Can Now Be Used to Hack It","Description":"There’s an ever-growing list of ways mobile devices can be hacked, which means we have to be increasingly vigilant about security. But now even something as innocuous-seeming as leaving your phone sitting on a table can result in a hack. Researchers just demo…","Published_Date":"2020-03-03","Content":"Theres an ever-growing list of ways mobile devices can be hacked, which means we have to be increasingly vigilant about security. But now even something as innocuous-seeming as leaving your phone sitting on a table can result in a hack. Researchers just demon… "}
{"Source_Name":"Time","Author":"KIm Chandler \/ AP","Title":"Trump Endorses Jeff Sessions’ Competitor in Alabama Senate Race","Description":"President Trump spurned his former Attorney General Jeff Sessions to endorse former Auburn University football coach Tommy Tuberville on Tuesday.","Published_Date":"2020-03-11","Content":"(MONTGOMERY, Ala.) — President Donald Trump on Tuesday night spurned his former Attorney General Jeff Sessions to endorse former Auburn University football coach Tommy Tuberville in the U.S. Senate race in Alabama.Trump announced his support for Tuberville … "}
{"Source_Name":"The Verge","Author":"Jay Peters","Title":"WeChat has been censoring keywords about coronavirus, study finds","Description":"China’s hugely-popular WeChat has been censoring keywords about coronavirus, according to a report published by Citizen Lab. The report also found that popular Chinese livestreaming platform YY has been censoring coronavirus content.","Published_Date":"2020-03-04","Content":"Chinese live-streaming platform YY has also been censoring coronavirus contentIllustration by Alex Castro \/ The VergeChinas most popular messaging app, Tencent-owned WeChat, has been censoring keywords about coronavirus since as early as January 1st, an a… "}
{"Source_Name":"Yahoo.com","Author":"insider@insider.com (Shira Feder)","Title":"A Survivor contestant and scarcity expert explains why you're panic-buying","Description":"Kelly Goldsmith is a professor of marketing at Vanderbilt University, who focuses on scarcity and panic after competing on the reality show Survivor.","Published_Date":"2020-03-10","Content":"Kelly Goldsmith, a professor and scarcity expert.Vanderbilt Owen Graduate School of Management<ul>As the number of coronavirus cases tops 100,000, more and more people are panic-buying items like hand sanitizer, toilet paper, and face masks. <l… "}
{"Source_Name":"CNN","Author":"Ramin Mostaghim, Mohammed Tawfeeq and Angela Dewan, CNN","Title":"Iran to temporarily free 54,000 prisoners as coronavirus spreads","Description":"Iran will temporarily release 54,000 people from prisons as officials struggle to contain the rapid spread of the biggest coronavirus outbreak in the Middle East.","Published_Date":"2020-03-04","Content":"Tehran (CNN)Iran will temporarily release 54,000 people from prisons as officials struggle to contain the rapid spread of the biggest coronavirus outbreak in the Middle East. Iran has reported 77 deaths, one of the highest confirmed death tolls outside of C… "}
{"Source_Name":"TechCrunch","Author":"Devin Coldewey","Title":"R&D roundup: soft 3D printing, backscatter Wi-Fi and other bleeding-edge tech","Description":"I see far more research articles than I could possibly write up. This column collects the most interesting of those papers and advances along with notes on why they may prove important in the world of tech and startups. This week: advances in rocketry, machin…","Published_Date":"2020-03-02","Content":"I see far more research articles than I could possibly write up. This column collects the most interesting of those papers and advances along with notes on why they may prove important in the world of tech and startups.This week: advances in rocketry, machi… "}
{"Source_Name":"Engadget","Author":"Jon Fingas","Title":"Drones can navigate like bats using four mics and a speaker","Description":"Bats can find their way in the dark using echolocation, so why can't drones ? Researchers have managed just that. They've developed a system that lets a drone navigate using just four microphones and a speaker. It relies on the familiar concept of measuring d…","Published_Date":"2020-03-04","Content":"The drone currently has to be stationary to get a feel for its environment, but the scientists hope to use the technology mid-flight. The team will also look at situations where the drone might be restricted.If this system is available worldwide, it could l… "}
{"Source_Name":"Engadget","Author":"Jon Fingas","Title":"NASA wants students' help designing tech for the Moon and Mars","Description":"NASA is enlisting whatever help it can get to make sure its crewed Moon and Mars missions go smoothly, and that might include help from schools. The agency is running a new round of its Moon to Mars Exploration Systems and Habitation Academic Innovation Chall…","Published_Date":"2020-03-02","Content":"The awards will be relatively modest at $15,000 to $50,000, but NASA stressed that this doesn't necessarily involve tangible products. It can also involve research that fills \"knowledge gaps\" or reduces risks, for instance. Proposals are due by April 24th.T… "}
{"Source_Name":"Cnnphilippines.com","Author":null,"Title":"UP among top 100 universities in the world for performing arts, development studies - CNN Philippines","Description":"UP among top 100 universities in the world for performing arts, development studies CNN Philippines UP breaks into world’s Top 100 universities for performing arts ABS-CBN News View Full coverage on Google News","Published_Date":"2020-03-05","Content":"Metro Manila (CNN Philippines, March 5) The University of the Philippines (UP) made it to the top 100 list of schools for the performing arts and development studies, according to the latest global rankings of a United Kingdom-based group.UP broke into the … "}
{"Source_Name":"Mashable","Author":"(Deleted account)","Title":"Why YouTube hasn't solved its conspiracy theory problem","Description":"The earth is actually flat! 9\/11 was an inside job! YouTube was once rife with conspiracy theories like these — and its own recommendation algorithm was the culprit. While the company has made serious headway recently in fixing the issue, conspiracy theories …","Published_Date":"2020-03-04","Content":"The earth is actually flat! 9\/11 was an inside job! YouTube was once rife with conspiracy theories like these and its own recommendation algorithm was the culprit. While the company has made serious headway recently in fixing the issue, conspiracy theories … "}
{"Source_Name":"Citynews1130.com","Author":null,"Title":"U of C researchers highlight the importance of hand hygiene - CityNews Vancouver","Description":"CALGARY (CityNews) – An open-source tool designed by University of Calgary researchers is gaining traction as a way to help remind people to wash their hands. This, as Canada reported more cases of COVID-19 on Thursday. READ MORE: WHO racing to send supplies …","Published_Date":"2020-03-05","Content":"CALGARY (CityNews) – An open-source tool designed by University of Calgary researchers is gaining traction as a way to help remind people to wash their hands.This, as Canada reported more cases of COVID-19 on Thursday.READ MORE: WHO racing to send supplie… "}
{"Source_Name":"BBC News","Author":"https:\/\/www.facebook.com\/bbcnews","Title":"Mexican women strike to protest against gender-based violence","Description":"Millions of women stay away from work and school to show what a society without women looks like.","Published_Date":"2020-03-09","Content":"Image copyrightReutersImage caption Protesters carried pink crosses to mark the victims of gender-based violenceMillions of women in Mexico have taken part in a day-long strike to highlight rising levels of gender-based violence.The protest, dubbed \"The… "}
{"Source_Name":"Yahoo.com","Author":"BRADY McCOMBS","Title":"Mormon-owned BYU: Same-sex romantic behavior still banned","Description":"Brigham Young University in Utah reiterated Wednesday that “same-sex romantic behavior” is not allowed on campus — dashing the hopes of LGTBTQ students who thought they could be more open after the college previously revised its code of conduct. The universit…","Published_Date":"2020-03-04","Content":"SALT LAKE CITY (AP) Brigham Young University in Utah reiterated Wednesday that same-sex romantic behavior is not allowed on campus dashing the hopes of LGTBTQ students who thought they could be more open after the college previously revised its code of conduc… "}
{"Source_Name":"Business Insider","Author":"Ryder Kimball","Title":"Inside the life and career of Erika James, the first woman and person of color to become dean of the Wharton School in its 139-year-old history.","Description":"Erika James will become the new dean of the Wharton School of the University of Pennsylvania in July 2020. She will be the first woman and person of color to lead the 139-year-old institution, whose notable alumni include Elon Musk, Warren Buffett, Sundar Pic…","Published_Date":"2020-03-03","Content":"Non"}
{"Source_Name":"USA Today","Author":"USA TODAY, From USA TODAY Network and wire reports, USA TODAY","Title":"Mormon crickets, luchador grackle, buried treasure: News from around our 50 states","Description":"University removes bell with ties to slavery in Louisiana, Catholic priests asked not to vote in Minnesota primary, and more","Published_Date":"2020-03-03","Content":"AlabamaMontgomery: The states Black Belt region would become a National Heritage Area eligible for funding and other benefits under a bipartisan move supported by members of the states congressional delegation. Democratic Rep. Terri Sewell said in a news re… "}
{"Source_Name":"Kotaku.com","Author":"Nathan Grayson","Title":"Researchers Are Using A Video Game To Fight Coronavirus","Description":"With COVID-19, aka coronavirus, continuing to spread at an alarming rate, researchers of all stripes are racing to get a handle on it. This includes a team at the University of Washington in Seattle, who’ve taken a novel approach: a video game. Read more...","Published_Date":"2020-03-04","Content":"With COVID-19, aka coronavirus, continuing to spread at an alarming rate, researchers of all stripes are racing to get a handle on it. This includes a team at the University of Washington in Seattle, whove taken a novel approach: a video game.The game, firs… "}
{"Source_Name":"Mentalfloss.com","Author":"Ellen Gutoskey","Title":"49 Notable Columbia University Alumni","Description":"Columbia University, Manhattan's Ivy League institution, boasts Alexander Hamilton, Barack Obama, and even Alicia Keys (sort of) among its former students.","Published_Date":"2020-03-05","Content":"Undeclared undergrads are a dime a dozen, but the majority of incoming freshmenalong with most graduate studentshave a firm idea of where their professional futures lie. And its not always in a traditional occupation. From beer to bagpipes and pot to pop cult… "}
{"Source_Name":"Boingboing.net","Author":"David Pescovitz","Title":"Scientists cook with bug butter made from insects","Description":"Fat from black soldier fly larvae is a \"sustainable and healthy alternative to butter,\" according to scientists at Ghent University in Belgium. According their research though, you can't go with more than half bug butter before it starts to taste suspect or d…","Published_Date":"2020-03-09","Content":"Fat from black soldier fly larvae is a \"sustainable and healthy alternative to butter,\" according to scientists at Ghent University in Belgium. According their research though, you can't go with more than half bug butter before it starts to taste suspect or d… "}
{"Source_Name":"Wired","Author":"Eric Niiler","Title":"Scientists Chase Snowflakes During the Warmest Winter Ever","Description":"A NASA project to study snowstorms in the Northeast has faced a lack of storms and a broken plane. They're not giving up.","Published_Date":"2020-03-05","Content":"Not counting this nights grounded flight, McMurdie and colleagues have flown on 12 trips since the beginning of January. While that may seem like a lot, it's actually about half of what they expected. There just havent been very many storms this year. NOAA of… "}
{"Source_Name":"ABC News","Author":"The Associated Press","Title":"State investigating massage therapist for female athletes","Description":"University of Kansas officials say a man recently charged with a child sex crime had provided massage services to some women's athletic teams since 2015","Published_Date":"2020-03-06","Content":"LAWRENCE, Kan. -- A man recently charged with a child sex crime provided massage services to some University of Kansas women's athletic teams since 2015, the school's chancellor and athletics director said.Chancellor Doug Girard and Athletic Director Jeff… "}
{"Source_Name":"Gizmodo.com","Author":"George Dvorsky","Title":"Bizarre Discovery Reveals Chlamydia-Like Bacteria Beneath the Arctic Seafloor","Description":"A plethora of previously unknown bacterial strains related to chlamydia have been found in the unlikeliest of places: sediment under the Arctic seafloor. The discovery is posing new questions about this diverse and durable group of bacteria and how they came …","Published_Date":"2020-03-09","Content":"A plethora of previously unknown bacterial strains related to chlamydia have been found in the unlikeliest of places: sediment under the Arctic seafloor. The discovery is posing new questions about this diverse and durable group of bacteria and how they came … "}
{"Source_Name":"Gizmodo.com","Author":"Dharna Noor on Earther, shared by Brian Kahn to Gizmodo","Title":"Ecosystems the Size of the Amazon Rainforest Could Collapse Within Decades","Description":"The Amazon is the world’s largest tropical rainforest, covering an area roughly the size of Australia. And yet it and other large ecosystems could be gone within our lifetime. Read more...","Published_Date":"2020-03-10","Content":"The Amazon is the worlds largest tropical rainforest, covering an area roughly the size of Australia. And yet it and other large ecosystems could be gone within our lifetime.In a new paper published on Tuesday in Nature Communications, scientists analyzed d… "}
{"Source_Name":"Reuters","Author":"Andrew Hay","Title":"Seattle-area nursing home unable to test 65 workers with COVID-19 symptoms","Description":"The Seattle-area nursing home at the epicenter of the U.S. coronavirus outbreak said on Monday it had no kits to test 65 employees showing symptoms of the virus that has killed at least 13 patients at the long-term care center.","Published_Date":"2020-03-10","Content":"(Reuters) - The Seattle-area nursing home at the epicenter of the U.S. coronavirus outbreak said on Monday it had no kits to test 65 employees showing symptoms of the virus that has killed at least 13 patients at the long-term care center. The staffers, rep… "}
{"Source_Name":"USA Today","Author":"NorthJersey.com, Anthony Zurita, NorthJersey.com","Title":"Princeton tells students to stay home after spring break amid coronavirus outbreak; classes to go virtual","Description":"Princeton University has asked students to stay home after spring break as New Jersey reported its sixth coronavirus case; classes will go online.","Published_Date":"2020-03-09","Content":"Social media editor Elyse Toribio has the questions you asked on social media about coronavirus in NJ. She sat down with editor Jim O'Neill of The Record to get the answers.NorthJersey.comPrinceton University classes will all go online after spring break … "}
{"Source_Name":"Gizmodo.com","Author":"Yessenia Funes on Earther, shared by Brian Kahn to Gizmodo","Title":"We Now Know How Much Climate Change Contributed to Australia's Disastrous Bushfires","Description":"The most recent Australian bushfire season from hell is one for the record books. And a new analysis published Wednesday shows all the ways humans made it worse, and it’s clearer than ever that climate change left its mark all over this disaster. Read more...","Published_Date":"2020-03-04","Content":"The most recent Australian bushfire season from hell is one for the record books. And a new analysis published Wednesday shows all the ways humans made it worse, and its clearer than ever that climate change left its mark all over this disaster.The findings… "}
{"Source_Name":"Gizmodo.com","Author":"Ryan F. Mandelbaum","Title":"Moviegoers Exposed to Toxic 'Thirdhand Smoke' From Clothing of Smokers, Study Finds","Description":"Simply sitting in a cinema to watch a movie can expose people to the equivalent of one to 10 cigarettes’ worth of secondhand smoke, according to a new chemical analysis. Read more...","Published_Date":"2020-03-04","Content":"Simply sitting in a cinema to watch a movie can expose people to the equivalent of one to 10 cigarettes worth of secondhand smoke, according to a new chemical analysis.Research has already shown that cigarette smoke releases a host of chemicals that are har… "}
{"Source_Name":"Fastcompany.com","Author":"Elizabeth Segran","Title":"Harvard just told students not to come back after spring break due to the coronavirus","Description":"This means that commencement and graduation festivities are also likely to be canceled. This morning, Lawrence Bacow, president of Harvard University, sent a letter out to the entire Harvard community asking students not to return to campus after spring break…","Published_Date":"2020-03-10","Content":"This morning, Lawrence Bacow, president of Harvard University, sent a letter out to the entire Harvard community asking students not to return to campus after spring break and to meet academic requirements remotely until further notice. The university’s sprin… "}
{"Source_Name":"Sudbury.com","Author":"Arron Pickard","Title":"Call ahead, HSN tells anyone who suspects they have symptoms of COVID-19 - Sudbury.com","Description":"Call ahead, HSN tells anyone who suspects they have symptoms of COVID-19 Sudbury.com Sudbury man who attended Toronto conference has COVID-19: health officials CP24 Toronto's Breaking News Ontario investigates after COVID-19 patient believed to have contracte…","Published_Date":"2020-03-11","Content":"Anyone attending Health Sciences North because they are exhibiting symptoms of COVID-19 are encouraged to call ahead, said the hospital in a news release.In that case, the caller is asked to describe their symptoms and travel history, including countries th… "}
{"Source_Name":"Time","Author":"Time","Title":"1929: Virginia Woolf","Description":"In 1928, addressing distinguished female students at the University of Cambridge, novelist and critic Virginia Woolf declared, “A woman must have money and a room of one’s own if she is to write fiction.” Replace “write fiction” with any creative, intellectua…","Published_Date":"2020-03-05","Content":"In 1928, addressing distinguished female students at the University of Cambridge, novelist and critic Virginia Woolf declared, “A woman must have money and a room of one’s own if she is to write fiction.” Replace “write fiction” with any creative, intellectua… "}
{"Source_Name":"The Next Web","Author":"Ivan Mehta","Title":"Scientists set up new telescopes dedicated to finding aliens","Description":"As humanity’s quest to discover aliens continues, a team of researchers has set up two prototype telescopes at Lick Obersevtory near San Jose, specifically for finding the extraterrestrial. These telescopes are part of hundreds of telescopes that are going to…","Published_Date":"2020-03-09","Content":"As humanitys quest to discover aliens continues, a team of researchers has set up two prototype telescopes at Lick Obersevtory near San Jose, specifically for finding the extraterrestrial. These telescopes are part of hundreds of telescopes that are going to … "}
{"Source_Name":"Wired","Author":"Lily Hay Newman","Title":"Russia Is Learning How to Bypass Facebook's Disinfo Defenses","Description":"Social media platforms have stepped up the fight against Russia's Internet Research Agency—but the IRA is evolving too.","Published_Date":"2020-03-05","Content":"Since Russias stunning influence operations during the 2016 United States presidential race, state and federal officials, researchers, and tech companies have been on high alert for a repeat performance. With the 2020 election now just seven months away, thou… "}
{"Source_Name":"Engadget","Author":"Rachel England","Title":"An algorithm could make CPUs a cheap way to train AI","Description":"AI is the backbone of technologies such as Alexa and Siri -- digital assistants that rely on deep machine learning to do their thing. But for the makers of these products -- and others that rely on AI -- getting them \"trained\" is an expensive and often time-c…","Published_Date":"2020-03-03","Content":"Typically, companies use GPUs as acceleration hardware in implementing deep learning in technology. But this is pricey -- top of the line GPU platforms cost around $100,000. Rice researchers have now created a cost-saving alternative, an algorithm called sub-… "}
{"Source_Name":"The Verge","Author":"Justine Calma","Title":"Animals might help us better understand the long-term health effects of wildfires","Description":"Cats and monkeys that survived California blazes might hold clues to understanding the effects of wildfires on human health.","Published_Date":"2020-03-04","Content":"Researchers are learning from cats and monkeys that lived through fires in CaliforniaPhoto by Justin Sullivan \/ Getty ImagesAfter raging fires subside, their impact on peoples health will linger. During and immediately after wildfires, increased hospital … "}
{"Source_Name":"Spiked-online.com","Author":"Benjamin Schwarz","Title":"How woke illiberalism is killing the academy","Description":"The University of Chicago was always a bastion of free speech. But even there, freedom is now under threat.","Published_Date":"2020-03-09","Content":"From its founding in 1890, the University of Chicago has occupied a singular place among American universities. Lacking the ancient lineages and social cachet of the Ivy League schools (Chicago welcomed women and Jews at a time when Harvard, et al, excluded t… "}
{"Source_Name":"Mashable","Author":"Natasha Piñon","Title":"How to support girls' and women's education","Description":"It's the MOST wonderful time of the year: International Women's Day! The commemorative day comes along once a year, on Mar. 8, and marks the perfect time to get a game plan together for supporting women around the world. The United Nation's theme this year — …","Published_Date":"2020-03-08","Content":"It's the MOST wonderful time of the year: International Women's Day! The commemorative day comes along once a year, on Mar. 8, and marks the perfect time to get a game plan together for supporting women around the world. The United Nation's theme this yea… "}
{"Source_Name":"Business Insider","Author":"feedback@businessinsider.com (Áine Cain), Áine Cain","Title":"LIVE UPDATES: See the full results of today's Virginia Democratic primary","Description":"Samantha Lee\/Business Insider Today is Super Tuesday, the day that Virginia and 15 other states and territories will host Democratic party primaries and caucuses. Virginia is holding its primary today, with polls closing at 7 p.m. Eastern. We'll have up-to-th…","Published_Date":"2020-03-03","Content":"Business InsiderVirginia is hosting one of the 16 Democratic party presidential primaries and caucuses taking place on Super Tuesday. Polls in Virginia close at 7 p.m. Eastern, and we will have live vote counts and results happening in real time.Virginia … "}
{"Source_Name":"Theguardian.compolitics","Author":"Jamie Grierson Home affairs correspondent","Title":"Amber Rudd hits out at 'rude' Oxford students after talk cancelled","Description":"Former minister’s appearance at International Women’s Day event called off at last minute The former Conservative home secretary Amber Rudd has hit out at “rude” students at the University of Oxford who cancelled her appearance at an International Women’s Day…","Published_Date":"2020-03-06","Content":"The former Conservative home secretary Amber Rudd has hit out at rude students at the University of Oxford who cancelled her appearance at an International Womens Day event 30 minutes before it was due to take place.The event, called In Conversation: Amber … "}
{"Source_Name":"Reuters","Author":"Reuters Editorial","Title":"Second coronavirus death confirmed in England","Description":"A second patient in England who tested positive for coronavirus has died, England's Chief Medical Officer Chris Whitty confirmed on Friday.","Published_Date":"2020-03-06","Content":"(Reuters) - A second patient in England who tested positive for coronavirus has died, England’s Chief Medical Officer Chris Whitty confirmed on Friday. The patient was being treated at Milton Keynes University Hospital and had underlying health conditions, … "}
{"Source_Name":"CNN","Author":"Joshua Berlinger, CNN","Title":"How one man's epiphany on a Seoul mountain in 1955 laid the foundation for many religious sects in South Korea","Description":"The religious practices of Shincheonji are in the public eye because the movement appears to be the source of South Korea's growing novel coronavirus outbreak that has infected more than 5,000 people there.","Published_Date":"2020-03-07","Content":"Hong Kong (CNN)Members of the Shincheonji religious group dress in identical white shirts, black pants and name tags when they gather to hear founder Lee Man-hee preach.There are no chairs, except for those provided for the elderly or sick. They sit on the … "}
{"Source_Name":"TechCrunch","Author":"Jonathan Shieber","Title":"Wall Street’s terrible, horrible, no good, very bad day ends with the Dow down 2,000","Description":"At least it’s over. The markets endured their worst day of trading of this young year as the Dow Jones Industrial Average dropped 2,000 points to close at 23,850.79 — a 7.79% decline. The Nasdaq Composite Index fell 624.94, to close at 7,950.68, and losses to…","Published_Date":"2020-03-09","Content":"At least it’s over.The markets endured their worst day of trading of this young year as the Dow Jones Industrial Average dropped 2,000 points to close at 23,850.79  — a 7.79% decline. The Nasdaq Composite Index fell 624.94, to close at 7,950.68, and losses … "}
{"Source_Name":"TechCrunch","Author":"Catherine Shu","Title":"Twitter applies its new “manipulated media” label to video retweeted by Trump","Description":"A video retweeted by Donald Trump is the first to be marked with Twitter’s new “manipulated media” tag. The company formally unveiled a new policy last month that said media that has been “significantly and deceptively altered or fabricated” is likely to be l…","Published_Date":"2020-03-09","Content":"A video retweeted by Donald Trump is the first to be marked with Twitters new “manipulated media” tag. The company formally unveiled a new policy last month that said media that has been “significantly and deceptively altered or fabricated” is likely to be la… "}
{"Source_Name":"TechCrunch","Author":"Jonathan Shieber","Title":"Gates Foundation-backed program will soon be issuing home testing kits for COVID-19 in Seattle","Description":"A project funded by the Gates Foundation will soon begin issuing at-home testing kits for the novel coronavirus, COVID-19, according to a report in the Seattle Times. The study, based on a nose-swab should be able to return results in up to two days and will …","Published_Date":"2020-03-08","Content":"A project funded by the Gates Foundation will soon begin issuing at-home testing kits for the novel coronavirus, COVID-19, according to a report in the Seattle Times.The study, based on a nose-swab should be able to return results in up to two days and will… "}
{"Source_Name":"Business Insider","Author":"Avery Hartmans","Title":"Elon Musk says college is 'basically for fun' but 'not for learning,' and that a degree isn't 'evidence of exceptional ability' (TSLA)","Description":"Elon Musk said college is \"not for learning\" and that you can basically learn anything you want to for free. During a Q&A at the Satellite 2020 conference on Monday, the Tesla and SpaceX CEO said he wants to make sure Tesla recruitment doesn't require a colle…","Published_Date":"2020-03-09","Content":"Elon Musk says he doesn't think a college degree means you have \"exceptional ability.\"The Tesla and SpaceX CEO shared his views on college during a fireside chat on Monday at the Satellite 2020 conference. During the audience Q&amp;A portion, Musk was asked… "}
{"Source_Name":"BBC News","Author":"https:\/\/www.facebook.com\/bbcnews","Title":"Coronavirus: Italy sees rapid spread of fake news","Description":"With Italy grappling with the coronavirus outbreak, misleading news has also been spreading.","Published_Date":"2020-03-12","Content":"Image copyrightEPAImage caption Italians have been ordered to stay at home, in an attempt to contain the virusAs Italy grapples with the coronavirus outbreak, misinformation about how to respond to the virus is also spreading.We've been looking at some … "}
{"Source_Name":"Fastcompany.com","Author":"Mark Wilson","Title":"It’s time to redesign travel for the age of COVID-19","Description":"We’re designing travel wrong for pandemics. But the good news is, travel can be fixed. When Qingyan Chen, professor of mechanical engineering at Purdue University, explains the overlooked danger of airborne pathogens, he offers a simple analogy. “I hold a cup…","Published_Date":"2020-03-11","Content":"When Qingyan Chen, professor of mechanical engineering at Purdue University, explains the overlooked danger of airborne pathogens, he offers a simple analogy. “I hold a cup of water. I take a drink. Would you drink? You definitely say no. But in a room, I bre… "}
{"Source_Name":"Yahoo.com","Author":"Chevaz Clarke","Title":"Harvard tells students not to return from spring break","Description":"Students have been asked to completely move out of their campus houses and dorms by Sunday, March 15.","Published_Date":"2020-03-10","Content":"Harvard University has joined the growing list of institutions that are taking strong measures to stem the spread of coronavirus. In a message from university president Larry Bacow sent to students on Tuesday, Harvard has asked students to not return to campu… "}
{"Source_Name":"Abs-cbn.com","Author":null,"Title":"Ateneo stamps class on UV, stakes claim to first seat in PCCL Finals - ABS-CBN Sports","Description":"Ateneo stamps class on UV, stakes claim to first seat in PCCL Finals ABS-CBN Sports Ateneo repeats as PCCL champion, smothers San Beda INQUIRER.net Jancork Cabahug leads way as UV Lancers rip UP Maroons to place third in PCCL Sports Interactive Network Philip…","Published_Date":"2020-03-07","Content":"Ateneo de Manila University weaponized its second unit as Tyler Tio and Jason Credo worked wonders in their 95-63 outclassing of University of Visayas in the semifinals of the 2020 Philippine Collegiate Champions League, Saturday inside Pasig's Ynares Sports … "}
{"Source_Name":"Vice News","Author":"Lauren Kaori Gurley, Jason Koebler","Title":"College Students Create Scholarship to Protest Palantir","Description":"Students at Carnegie Mellon University are protesting the data-mining firm Palantir’s scholarships for women and people of color by creating their own scholarships","Published_Date":"2020-03-09","Content":"Students at Carnegie Mellon University have made a scholarship fund for underrepresented students in STEM to protest the university for allowing the data mining firm Palantir to offer scholarships on campus.  In recent years, Palantir, the $26 billion Silic… "}
{"Source_Name":"Ctvnews.ca","Author":"Carly Yoshida-Butryn","Title":"Protest shuts down major Vancouver intersection | CTV News - CTV News","Description":"Protest shuts down major Vancouver intersection | CTV News CTV News Indigenous people in Canada facing racism over Wet’suwet’en solidarity blockade action Global News B.C. students join nationwide school walkout in support of Wet'suwet'en hereditary chiefs CB…","Published_Date":"2020-03-04","Content":"VANCOUVER -- A student walkout in support of the Wet'suwet'en hereditary chiefs who oppose a liquefied natural gas pipeline through their traditional territory closed the intersection of West 49th Avenue and Cambie Street in Vancouver during the afternoon r… "}
{"Source_Name":"Marketwatch.com","Author":"Sara Dorn","Title":"The New York Post: Stanford, University of Washington cancel classes amid coronavirus outbreak","Description":"Two major U.S. West Coast universities have canceled in-person classes because of the coronavirus as the region emerges as an epicenter for the US outbreak.","Published_Date":"2020-03-07","Content":"Two major U.S. West Coast universities have canceled in-person classes because of the coronavirus as the region emerges as an epicenter for the US outbreak.The University of Washington, which has campuses in Seattle, Tacoma and Bothell, and Stanford Universit… "}
{"Source_Name":"Yahoo.com","Author":"Chris Quintana, USA TODAY","Title":"College closings: More than 100 colleges cancel in-person classes and move online","Description":"In-person classes were canceled at almost 100 universities by midafternoon Wednesday. Dorms emptied, and graduation plans were up in the air.","Published_Date":"2020-03-11","Content":"The coronavirus is upending many of the hallmarks of the American university experience. This may be only the beginning of what is to come. In-person classes were canceled or postponed at more than 100 universities by late afternoon Wednesday, according to … "}
{"Source_Name":"Hypebeast.com","Author":"info@hypebeast.com (HYPEBEAST), HYPEBEAST","Title":"Nike React Infinity Run Sports \"Laser Orange\" & \"University Blue\" Accents","Description":"Designed to keep committed and casual runners alike injury-free and feeling fresh, Nike Running's React Infinity Run is a high-comfort design that's now surfaced in a \"Laser Orange\/University Blue\" colorway. Mixing a foot-hugging knit upper with a wide, soft …","Published_Date":"2020-03-11","Content":"Designed to keep committed and casual runners alike injury-free and feeling fresh, Nike Running‘s React Infinity Run is a high-comfort design that’s now surfaced in a “Laser Orange\/University Blue” colorway. Mixing a foot-hugging knit upper with a wide, soft … "}
{"Source_Name":"Business Insider","Author":"Tyler Sonnemaker","Title":"Mark Zuckerberg and Priscilla Chan's charity wants to 'quadruple' the Bay Area's COVID-19 testing capacity in under a week by buying diagnostic machines (FB)","Description":"The Chan Zuckerberg Initiative has formed a \"COVID-19 task force\" that wants to quadruple the Bay Area's testing capacity, the organization announced Tuesday. The philanthropic group, funded by Priscilla Chan and Mark Zuckerberg, plans to buy additional diagn…","Published_Date":"2020-03-10","Content":"The Chan Zuckerberg Initiative is forming a coronavirus \"task force\" with \"the aim to quadruple the Bay Area's COVID-19 testing and diagnostics capacities,\" the organization announced Tuesday.\"We're funding the acquisition of state-of-the-art FDA approved C… "}
{"Source_Name":"Youtube.com","Author":null,"Title":"Brazil completes Covid-19 DNA sequencing to help in developing vaccines | Coronavirus | World News - WION","Description":"Brazil completes Covid-19 DNA sequencing to help in developing vaccines | Coronavirus | World News WION Washington state coronavirus not yet showing up in B.C. 100 Mile House Free Press Coronavirus outbreak: 3 new cases of COVID-19 in Ontario, province total …","Published_Date":"2020-03-03","Content":"In just 48 hours a group of scientists completed the DNA sequencing of the deadly coronavirus that has already claimed over 3125 lives globally. the experiment was a joint effort by Adolful Leutes Insitute in partnership with Tropical Medical Institute, Unive… "}
{"Source_Name":"Globalnews.ca","Author":"joshkelliott","Title":"Incredible ‘teardrop star’ discovery breaks the mould for astronomers - Global News","Description":"Incredible ‘teardrop star’ discovery breaks the mould for astronomers Global News TESS Discovers New Class of Pulsating Star | Astronomy Sci-News.com Astronomers Have Found a Peculiar New Type of Star That Only Pulses on One Side ScienceAlert Teardrop-shaped …","Published_Date":"2020-03-10","Content":"Amateur astronomers may have just found the oddest couple in the universe and no, they’re not living on Earth.Scientists say they’ve identified an extremely rare star that’s been warped into a never-before-seen teardrop shape by the gravity of its neighbour… "}
{"Source_Name":"Gizmodo.com","Author":"George Dvorsky","Title":"The Search for Aliens Is About to Get a Serious Upgrade","Description":"Construction is set to begin for a large telescopic array dedicated to detecting natural and artificial sources of optical and infrared light. Once operational, the system, called PANOSETI, will be capable of scanning the entire sky, significantly boosting ou…","Published_Date":"2020-03-06","Content":"Construction is set to begin for a large telescopic array dedicated to detecting natural and artificial sources of optical and infrared light. Once operational, the system, called PANOSETI, will be capable of scanning the entire sky, significantly boosting ou… "}
{"Source_Name":"Gizmodo.com","Author":"Ryan F. Mandelbaum","Title":"These Clever Parrots Can Understand Probability","Description":"Scientists studying kea, New Zealand’s alpine parrot, revealed that the famously mischievous birds could understand probabilities, an impressive mental feat. Read more...","Published_Date":"2020-03-03","Content":"Scientists studying kea, New Zealands alpine parrot, revealed that the famously mischievous birds could understand probabilities, an impressive mental feat.The pair of researchers put six birds through a series of trials to see how they made decisions when … "}
{"Source_Name":"Gizmodo.com","Author":"George Dvorsky","Title":"Days on Earth Used to Be 30 Minutes Shorter, Ancient Shell Suggests","Description":"During the Late Cretaceous, days were roughly 30 minutes shorter than they are today, according to chemical traces found on a 70-million-year-old shell belonging to an extinct mollusk. Read more...","Published_Date":"2020-03-09","Content":"During the Late Cretaceous, days were roughly 30 minutes shorter than they are today, according to chemical traces found on a 70-million-year-old shell belonging to an extinct mollusk.Like counting the rings of a stump to discern the age of a tree, scientis… "}
{"Source_Name":"Gizmodo.com","Author":"George Dvorsky","Title":"Scotland Was the Real 'Jurassic Park’ During the Reign of Dinosaurs, Newfound Footprints Suggest","Description":"Paleontologists working on the Isle of Skye in Scotland have uncovered around 50 dinosaur footprints, including track marks compatible with Stegosaurus. The discovery points to the tremendous ecological diversity of the region some 170 million years ago. Read…","Published_Date":"2020-03-11","Content":"Paleontologists working on the Isle of Skye in Scotland have uncovered around 50 dinosaur footprints, including track marks compatible with Stegosaurus. The discovery points to the tremendous ecological diversity of the region some 170 million years ago.Tha… "}
{"Source_Name":"Boingboing.net","Author":"Xeni Jardin","Title":"Largest technical dairy competition in world opens in Wisconsin","Description":"• Coronavirus fears can't stop the fromage In Wisconsin today, the world's largest technical cheese, butter and yogurt competition kicked off with a record 3,667 entries from 26 nations. Some 55 judges will inspect, sniff, and eat samples of 132 classes of da…","Published_Date":"2020-03-04","Content":"Coronavirus fears can't stop the fromageIn Wisconsin today, the world's largest technical cheese, butter and yogurt competition kicked off with a record 3,667 entries from 26 nations.Some 55 judges will inspect, sniff, and eat samples of 132 classes of da… "}
{"Source_Name":"Wired","Author":"Matt Simon","Title":"What's a Pandemic? Your Coronavirus Questions, Answered","Description":"Dr. Seema Yasmin, director of the Stanford Health Communication Initiative, shares how to protect yourself and others in this alarming time.","Published_Date":"2020-03-06","Content":"The SARS-CoV-2 virus, a novel coronavirus, has exploded out of China and spread the disease Covid-19 around the world. Symptoms include fever, cough, and sore throat, and can lead to death in vulnerable populations, particularly the elderly. The World Health … "}
{"Source_Name":"Business Insider","Author":"Brittany Chang","Title":"12 tips to lessen the chances of getting sick while riding trains, subways, and buses in the age of coronavirus, according to experts","Description":"The coronavirus outbreak that originated in Wuhan, China, has infected over 92,000 people and killed more than 3,100. While 87% of the cases have been reported in China, nine people in the US have died because of COVID-19. We spoke to six experts for tips and…","Published_Date":"2020-03-03","Content":"Several public transportation agencies across the country are now taking steps to mitigate the spread of the novel coronavirus and subdue public fears of catching it.For example, New York's Metropolitan Transportation Authority announced that its trains, ca… "}
{"Source_Name":"TechCrunch","Author":"Connie Loizos","Title":"Kinnos, which makes colorizes disinfectant to ensure surfaces are covered, just landed $6 million in funding","Description":"Kinnos, a New York-based startup, was founded six years ago, but what the five-person company produces is suddenly top of mind — and a new round of funding reflects as much. To wit, Kinnos, which makes additives that causes disinfectants to turn blue long eno…","Published_Date":"2020-03-05","Content":"Kinnos, a New York-based startup, was founded six years ago, but what the five-person company produces is suddenly top of mind — and a new round of funding reflects as much.To wit, Kinnos, which makes additives that causes disinfectants to turn blue long en… "}
{"Source_Name":"The Next Web","Author":"Tristan Greene","Title":"Eureka? Scientists think they discovered the particle responsible for dark matter","Description":"A research team lead by nuclear physicists Mikhail Bashkanov and Daniel Watts from the University of York recently published research indicating that a newly discovered particle may be responsible for the existence of dark matter. Scientists estimate that som…","Published_Date":"2020-03-04","Content":"A research team lead by nuclear physicists Mikhail Bashkanov and Daniel Watts from the University of York recently published research indicating that a newly discovered particle may be responsible for the existence of dark matter.Scientists estimate that so… "}
{"Source_Name":"The Next Web","Author":"Thomas Macaulay","Title":"China tests AI that predicts earthquakes better than lousy humans","Description":"China is developing an earthquake prediction system that uses AI to measure seismic activity in one of the world’s most quake-prone countries. The system developed by the University of Science and Technology of China and the China Earthquake Administration an…","Published_Date":"2020-03-09","Content":"China is developing an earthquake prediction system that uses AI to measure seismic activity in one of the worlds most quake-prone countries.The system developed by the University of Science and Technology of China and the China Earthquake Administration an… "}
{"Source_Name":"The Next Web","Author":"Mix","Title":"That unexpected ‘HIV test result’ email you just got is probably a scam","Description":"Don’t panic! That unexpected email about an HIV test result you got is probably just an attempt to trick you into downloading malware designed to steal your personal credentials and financial info. Researchers from security firm Proofpoint have spotted a new …","Published_Date":"2020-03-10","Content":"Dont panic! That unexpected email about an HIV test result you got is probably just an attempt to trick you into downloading malware designed to steal your personal credentials and financial info.Researchers from security firm Proofpoint have spotted a new … "}
{"Source_Name":"The Next Web","Author":"Napier Lopez","Title":"New bendable concrete could help buildings survive earthquakes","Description":"Bendable displays may be all the rage these days, but there’s another material that could benefit from some added flexibility: concrete. Researchers at the Swinburne University of Technology have been developing a bendable, cement-free concrete that could hol…","Published_Date":"2020-03-04","Content":"Bendable displays may be all the rage these days, but theres another material that could benefit from some added flexibility: concrete. Researchers at the Swinburne University of Technology have been developing a bendable, cement-free concrete that could hold… "}